<h1 class="firstHeading">Wiederkehrende Aufgaben bearbeiten</h1><p class='urlname' style='display: none'>Handling-Repetitive-Tasks</p>
<p><span class="OIndex" style="display:none">Origin automatisieren</span> <span class="OIndex" style="display:none">Stapelverarbeitung</span></p><p><br /></p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Analysis_Report_Sheets"><span class="tocnumber">1</span> <span class="toctext">Analyseberichtsbl&auml;tter</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Recalculation"><span class="tocnumber">2</span> <span class="toctext">Neuberechnung</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Dialog_Themes"><span class="tocnumber">3</span> <span class="toctext">Dialogdesigns</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Workbook_and_Project_Templates"><span class="tocnumber">4</span> <span class="toctext">Arbeitsmappen- und Projektvorlagen</span></a><ul>
<li class="toclevel-2 tocsection-5"><a href="#The_Workbook_as_Template"><span class="tocnumber">4.1</span> <span class="toctext">Die Arbeitsmappe als Vorlage</span></a></li>
<li class="toclevel-2 tocsection-6"><a href="#The_Project_as_Template"><span class="tocnumber">4.2</span> <span class="toctext">Das Projekt als Vorlage</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-7"><a href="#Batch_Plotting"><span class="tocnumber">5</span> <span class="toctext">Stapelzeichnen</span></a><ul>
<li class="toclevel-2 tocsection-8"><a href="#Duplicating_Graphs_with_Data_from_Other_Books.2FSheets.2FColumns"><span class="tocnumber">5.1</span> <span class="toctext">Diagramme mit Daten aus anderen Mappen/Bl&auml;ttern/Spalten duplizieren</span></a></li>
<li class="toclevel-2 tocsection-9"><a href="#The_Workbook_as_a_Template_for_Processing_Multiple_Files"><span class="tocnumber">5.2</span> <span class="toctext">Arbeitsmappe als Vorlage zum Verarbeiten mehrerer Dateien verwenden</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-10"><a href="#Batch_Analysis"><span class="tocnumber">6</span> <span class="toctext">Stapelanalyse</span></a><ul>
<li class="toclevel-2 tocsection-11"><a href="#Analyzing_Multiple_Datasets_in_Dialogs"><span class="tocnumber">6.1</span> <span class="toctext">Mehrere Datens&auml;tze in Dialogen analysieren</span></a></li>
<li class="toclevel-2 tocsection-12"><a href="#Using_Gadgets_for_Analyzing_Multiple_Curves"><span class="tocnumber">6.2</span> <span class="toctext">Minitools zum Analysieren mehrerer Kurven verwenden</span></a></li>
<li class="toclevel-2 tocsection-13"><a href="#Batch_Analysis_Using_an_Analysis_Template"><span class="tocnumber">6.3</span> <span class="toctext">Stapelanalyse unter Verwendung einer Analysevorlage</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-14"><a href="#Repeating_Analysis_on_Other_Datasets_or_Data_Plots"><span class="tocnumber">7</span> <span class="toctext">Analyse f&uuml;r andere Datens&auml;tze oder Datenzeichnungen wiederholen</span></a></li>
<li class="toclevel-1 tocsection-15"><a href="#Duplicate_this_Operation"><span class="tocnumber">8</span> <span class="toctext">Diese Operation duplizieren</span></a></li>
<li class="toclevel-1 tocsection-16"><a href="#Repeating_Analysis_Using_Data_Filters"><span class="tocnumber">9</span> <span class="toctext">Analyse mit Hilfe von Datenfiltern wiederholen</span></a></li>
<li class="toclevel-1 tocsection-17"><a href="#Automating_Tasks_Using_Programming"><span class="tocnumber">10</span> <span class="toctext">Aufgaben mit Hilfe von Programmierung automatisieren</span></a></li>
<li class="toclevel-1 tocsection-18"><a href="#Topics_for_Further_Reading"><span class="tocnumber">11</span> <span class="toctext">Weiterf&uuml;hrende Themen</span></a></li>
</ul>
</div>

<h2><a name="Analysis_Report_Sheets"></a><span class="mw-headline">Analyseberichtsbl&auml;tter</span></h2>
<dl><dd><a  class="image"><img alt="UG Analysis Report Sheet.png" src="../images/How_to_Handle_Repetitive_Tasks/UG_Analysis_Report_Sheet.png" width="799"  /></a></dd></dl>
<p>Analyseoperationen wie jene, die mit den Kapiteln <a href="../../GettingStarted/OriginLab/Data_Analysis.html" title="OriginLab:Data Analysis">Analyse</a> oder <a href="../../GettingStarted/OriginLab/Statistics.html" title="OriginLab:Statistics">Statistik</a> aufgef&uuml;hrten Hilfsmitteln durchgef&uuml;hrt werden, erstellen ausf&uuml;hrliche <b>Analyseberichtsbl&auml;tter</b>.</p>
<ul><li> Analyseberichtsbl&auml;tter enthalten Tabellen, die in einer Baumstruktur angeordnet sind.  </li>
<li> Erweitern oder minimieren Sie jeden Zweig, um die Tabellen anzuzeigen bzw. zu verbergen.  </li>
<li> Tabellen sind keine statischen Berichte. Sie werden mit Hilfe von Platzhaltern erzeugt, die mit bestimmten Analyseergebnissen verkn&uuml;pft sind. Daher k&ouml;nnen Ergebnisse bei &Auml;nderungen der Eingabe- bzw. Analyseparameter <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Recalculation" title="OriginLab:How to Handle Repetitive Tasks">neu berechnet</a> werden.</li>
<li> Sie k&ouml;nnen Kommentare zum Blatt hinzuf&uuml;gen oder Tabellen kopieren und sie in andere Fenster Ihres Projekts einf&uuml;gen bzw. einf&uuml;gen-verkn&uuml;pfen.</li>
<li> Analyseberichtsbl&auml;tter enthalten h&auml;ufig eingebettete Diagramme wie Anpassungskurven oder Residuendiagramme. Um diese Diagramme benutzerdefiniert anzupassen, klicken Sie doppelt auf sie. Das eingebettete Diagramm wird in einem separaten Fenster ge&ouml;ffnet, in dem Sie es -- wie jedes Origin-Diagramm -- mit Hilfe der Minisymbolleisten oder dem Dialog Details Zeichnung benutzerdefiniert anpassen k&ouml;nnen. Wenn Sie mit der Anpassung fertig sind, klicken Sie auf die Schaltfl&auml;che Schlie&szlig;en <a  class="image"><img alt="Button close embedded.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_close_embedded.png" width="32"  /></a> und f&uuml;gen Sie das angepasste Diagramm erneut in das Berichtsblatt ein.</li></ul>
<p>Weitere Informationen zu <b>Analyseberichtsbl&auml;ttern</b> finden Sie in der <a class="external text" href="../../UserGuide/UserGuide/Analysis_Report_Sheets_and_Columns.html">Origin-Hilfe</a>.</p>
<h2><a name="Recalculation"></a><span class="mw-headline">Neuberechnung</span></h2>
<p><span class="OIndex" style="display:none">Neuberechnung der Ergebnisse</span> Alle Analyse- und die meisten Datenverarbeitungsdialoge in Origin verf&uuml;gen &uuml;ber das Bedienelement <a class="external text" href="../../UserGuide/UserGuide/Recalculating_Analysis_Results.html"><b>Neu berechnen</b></a> <b><span class="OIndex" style="display:none">Neu berechnen</span></b>. Dieses Element erm&ouml;glicht Ihnen, Ausgabeoperationen mit den Quelldaten zu verbinden. Wenn Neu berechnen auf <b>Auto</b> oder <b>Manuell</b> gesetzt ist, l&ouml;sen &Auml;nderungen an den Quelldaten eine Aktualisierung der Ausgabe aus (im Fall von <b>Manuell</b> geschieht dies ausstehend). Auf diese Weise k&ouml;nnen Sie mehrere Datens&auml;tze analysieren, z.B. durch den Serienimport einer neuen Datendatei, um vorhandene Daten zu ersetzen. Diese Funktion stellt auch die Grundlage zur Erstellung von <b>Analysevorlagen</b> dar. Das Konzept der Analysevorlagen wird unten erl&auml;utert. <span class="OIndex" style="display:none">Automatisch neu berechnen</span> <span class="OIndex" style="display:none">Manuell neu berechnen</span> <span class="OIndex" style="display:none">Schloss, Neu berechnen</span> <br /></p>
<dl><dd><a  class="image"><img alt="LR dialog recalc 1.png" src="../images/How_to_Handle_Repetitive_Tasks/LR_dialog_recalc_1.png" width="611"  /></a></dd></dl>
<p><br /> Die Funktion <b>Neu berechnen</b> hat drei Modi:</p>
<table class="simple">
<tr>
<th> Kein</th>
<td>
<ul><li> Es wird kein Schloss in der Ausgabe angezeigt. </li>
<li> &Auml;nderungen an den Eingabedaten f&uuml;hren zu keiner Aktualisierung der Ausgabe.</li></ul>
</td></tr>
<tr>
<th> Auto</th>
<td>
<ul><li> In den Ausgabespalten und Diagrammen der Ausgabedaten wird ein <b>automatisches</b> gr&uuml;nes Schloss <a  class="image"><img alt="Operation lock auto.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_auto.png" width="14"  /></a> angezeigt. Das Schloss der Hauptoperation wird auf der Spalte ganz links als <a  class="image"><img alt="Operation lock auto.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_auto.png" width="14"  /></a> angezeigt, w&auml;hrend alle verbundenen Operationsspalten rechts von der Hauptoperation das Symbol &quot;+&quot; <a  class="image"><img alt="Operation lock auto related.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_auto_related.png" width="11"  /></a> aufweisen.</li>
<li> Die Ausgabe wird automatisch aktualisiert, wenn Eingabedaten ge&auml;ndert werden.</li>
<li> Sie k&ouml;nnen auch auf ein Schlosssymbol klicken und den Dialog &ouml;ffnen, um &Auml;nderungen an den Analyseeinstellungen vorzunehmen, einschlie&szlig;lich &Auml;ndern des Modus <b>Neu berechnen</b>.</li></ul>
</td></tr>
<tr>
<th> Manuell</th>
<td>
<ul><li> In den aktuellen Ausgabespalten und Diagrammen, die Zeichnungen der Ausgabedaten enthalten, wird ein <b>manuelles</b> gr&uuml;nes Schloss <a  class="image"><img alt="Operation lock manual.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_manual.png" width="13"  /></a> angezeigt. Die verbundenen Operationsspalten rechts von der Hauptoperation zeigt das Symbol &quot;+&quot; <a  class="image"><img alt="Operation lock auto related.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_auto_related.png" width="11"  /></a> an.</li>
<li> Ein gelbes Schloss <a  class="image"><img alt="Operation lock manual pending.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_manual_pending.png" width="14"  /></a> weist darauf hin, dass Eingabedaten ge&auml;ndert wurden und eine Neuberechnung aussteht. Sie k&ouml;nnen Aktualisierungen individuell durch Klicken auf das gelbe Schloss und Ausw&auml;hlen der Option <b>Neu berechnen</b> im Kontextmen&uuml; starten; oder Sie k&ouml;nnen <i>alle</i> ausstehenden Operationen durch Klicken auf die gelbe Schaltfl&auml;che <b>Neu berechnen</b> <a  class="image"><img alt="Button Recalculate Manual.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Recalculate_Manual.png" width="22"  /></a> auf der Standardsymbolleiste aktualisieren.</li>
<li> Sie k&ouml;nnen auch auf ein Schlosssymbol klicken und den Dialog &ouml;ffnen, um &Auml;nderungen an den Analyseeinstellungen vorzunehmen, einschlie&szlig;lich &Auml;ndern des Modus <b>Neu berechnen</b>.</li></ul>
</td></tr></table>
<p><br /> <i><b>Tipps zum Verwalten der Neuberechnungsoperationen</b></i></p>
<ul><li> Wenn Sie mit der linken Maustaste auf das Schloss klicken, wird ein Men&uuml; mit mehreren Optionen angezeigt, einschlie&szlig;lich &Auml;ndern der Analyseparameter, &Ouml;ffnen des Quelldatenblatts, Wechseln zu den Ergebnisbl&auml;ttern und Steuern des Operationsstatus&apos; wie dem Wechsel von manueller zu automatischer Aktualisierung.</li>
<li> Die <b>Standard</b>symbolleiste zeigt eine Schaltfl&auml;che <b>Neu berechnen</b> an, die gr&uuml;n <a  class="image"><img alt="Button Recalculate Auto.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Recalculate_Auto.png" width="22"  /></a> ist, wenn alle Projektoperationen aktuell sind, und gelb <a  class="image"><img alt="Button Recalculate Manual.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Recalculate_Manual.png" width="22"  /></a>, wenn es ausstehende Neuberechnungsoperationen gibt. Wenn Sie ein Projekt ge&ouml;ffnet haben und sehen, dass die Schaltfl&auml;che <b>Neu berechnen</b> gelb ist, wissen Sie, dass Berechnungen ausstehen und die Daten und Datenzeichnungen, die Sie sehen, wom&ouml;glich nicht aktuell sind.</li>
<li> Wenn ein Schlosssymbol dunkelgrau mit der Farbe <a  class="image"><img alt="Gray lock pro only.png" src="../images/How_to_Handle_Repetitive_Tasks/Gray_lock_pro_only.png" width="15"  /></a> angezeigt wird, ist das ein Hinweis darauf, dass die zugeh&ouml;rige Operation in <a class="external text" href="https://www.originlab.com/index.aspx?go=Products/Origin" target="_blank">OriginPro</a> in durchgef&uuml;hrt wurde und das Fenster oder Projekt in der Standardversion von Origin ge&ouml;ffnet wurde. Die Operation wird von der Standardversion von Origin nicht unterst&uuml;tzt. Um die Analyse zu modifizieren oder erneut durchzuf&uuml;hren, ben&ouml;tigen Sie einen Computer mit einer OriginPro-Lizenz.</li>
<li> Wenn ein Schlosssymbol rot <a  class="image"><img alt="Broken operation lock.png" src="../images/How_to_Handle_Repetitive_Tasks/Broken_operation_lock.png" width="15"  /></a> angezeigt wird, ist etwas aufgetreten, dass Neuberechnungen unm&ouml;glich macht. Diese Zust&auml;nde treten selten auf, tun dies aber, wenn Sie beispielsweise eine Projektdatei, die eine benutzerdefinierte Kurvenanpassungsoperation enth&auml;lt, an einen Kollegen weitergeben, dabei aber vergessen, Ihre benutzerdefinierte Anpassungsfunktion mitzugeben.</li>
<li> Gibt es viele Neuberechnungsoperationen in Ihrer Projektdatei, kann Ihre Arbeit verlangsamt werden. Sie k&ouml;nnen die Neuberechnung sperren -- sowohl die <b>manuelle</b> als auch die <b>automatische</b> Neuberechnung --, indem Sie auf ein Schlosssymbol klicken und die Option <b>Neuberechnung sperren</b> im Ausklappmen&uuml; w&auml;hlen. Das Verwenden einer Sperre f&uuml;r ausstehende Neuberechnungen platziert ein gelbes &quot;Sperrsymbol&quot; <a  class="image"><img alt="Button block recalculation manual.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_block_recalculation_manual.png" width="15"  /></a> auf jeder zugeh&ouml;rigen Operation in der Kette. Das Verwenden einer Sperre f&uuml;r aktuelle Neuberechnungen platziert ein gr&uuml;nes &quot;Sperrsymbol&quot; <a  class="image"><img alt="Button block recalculation auto.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_block_recalculation_auto.png" width="15"  /></a> auf jeder zugeh&ouml;rigen Operation in der Kette. Um die Sperre zu entfernen, klicken Sie auf das &quot;Sperrsymbol&quot; und deaktivieren Sie das Kontrollk&auml;stchen. (Beachten Sie, dass das Klicken auf die gelbe Schaltfl&auml;che <b>Neu berechnen</b> <a  class="image"><img alt="Button Recalculate Manual.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Recalculate_Manual.png" width="22"  /></a> auf der Standardsymbolleiste die gesperrten Operationen nicht aktualisiert.)</li>
<li> Um alle Neuberechnungen auszusetzen, dr&uuml;cken Sie <b>Strg + 0</b>, w&auml;hlen Sie <b>Analyse: Automatische Neuberechnung pausieren</b> (nur Arbeitsblatt) oder klicken Sie auf die Schaltfl&auml;che <b>Automatische Neuberechnung pausieren</b> <a  class="image"><img alt="Button pause recalculation.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_pause_recalculation.png" width="25"  /></a> auf der Standardsymbolleiste.</li>
<li> Sie k&ouml;nnen die Schlosssymbole in Ihrem Diagrammfenster verbergen, indem Sie das Diagramm klicken, <b>Ansicht: Zeige</b> im Hauptmen&uuml; w&auml;hlen und das Kontrollk&auml;stchen <b>Schlosssymbole</b> deaktivieren. Dies entfernt <i>nicht</i> die verbundenen Operationen aus dem Diagrammfenster. Um die Symbole wieder anzuzeigen, wiederholen Sie den Vorgang.</li></ul>
<h2><a name="Dialog_Themes"></a><span class="mw-headline">Dialogdesigns</span></h2>
<p><span class="OIndex" style="display:none">Dialogdesigns</span> <span class="OIndex" style="display:none">Designs, Dialog</span> Die Einstellungen in Analysedialogen und die meisten anderen Dialoge zur Datenverarbeitung k&ouml;nnen als <b>Dialogdesign</b>datei gespeichert werden. Sobald sie gespeichert werden, k&ouml;nnen diese Designdateien, die Ihre benutzerdefinierten Einstellungen enthalten, bei Bedarf wieder aufgerufen werden. Mehrere Designdateien k&ouml;nnen von einem Dialog aus gespeichert werden und erm&ouml;glichen die einfache Wiederholung einer Analyse von Datens&auml;tzen, die m&ouml;glicherweise alle unterschiedliche Einstellungen erfordern.</p><p>Die zuletzt verwendeten Dialogeinstellungen werden automatisch als <b>&lt;zuletzt verwendetes&gt;</b> Design gespeichert. Mit Origin k&ouml;nnen Sie Ihre benutzerdefinierten Einstellungen als <b>&lt;Standard&gt;</b>-Design speichern. Auf das Standarddesign, das zuletzt verwendete Design und alle Designs, die Sie unter einem Namen gespeichert haben, k&ouml;nnen Sie &uuml;ber das Ausklappmen&uuml; Design zugreifen, das sich vom Dialog aus &ouml;ffnen l&auml;sst. Die gleichen Designs sind auch &uuml;ber den Befehl im Hauptmen&uuml; verf&uuml;gbar, der mit dem Analysedialog verbunden ist.<br /></p><p><a  class="image"><img alt="Analysis themes menu.png" src="../images/How_to_Handle_Repetitive_Tasks/Analysis_themes_menu.png" width="600"  /></a><br /><br /></p><p>Dialogdesigns k&ouml;nnen mit Hilfe des Hilfsmittels <b>Designs verwalten</b> organisiert werden, das &uuml;ber das Men&uuml; <b>Hilfsmittel</b> verf&uuml;gbar ist.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b> Tutorial: Ein Dialogdesign speichern und erneut verwenden</b></p>
<ol><li> Importieren Sie die Datei <b>Linear Fit.dat</b> aus dem Ordner <b>\Samples\Curve Fitting\</b>.</li>
<li> Markieren Sie Spalte B und w&auml;hlen Sie <b>Analyse: Anpassen: Linearer Fit...</b></li>
<li> Aktivieren Sie im Dialog <b>Lineare Anpassung</b> das Kontrollk&auml;stchen <b>Fester Schnittpunkt mit der Y-Achse</b> (unter <b>Fit-Optionen</b>) und setzen Sie das Bearbeitungsfeld <b>Fester Schnittpunkt mit der Y-Achse bei</b> auf <b>0</b>.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <a  class="image"><img alt="Button Save Theme.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Save_Theme.png" width="21"  /></a> neben <b>Dialogdesign</b> und w&auml;hlen Sie <b>Speichern unter</b>. Geben Sie in dem Feld <b>Designname</b> den Namen <b>Schnittpunkt Null</b> ein und klicken Sie auf <b>OK</b>. Klicken Sie erneut auf <b>OK</b>, um den Dialog Lineare Anpassung zu schlie&szlig;en und die Analyse durchzuf&uuml;hren. Die Ergebnisbl&auml;tter <i>FitLinear1 </i>und <b>FitLinearCurve1</b> werden zu der Arbeitsmappe hinzugef&uuml;gt. </li>
<li> Wechseln Sie zur&uuml;ck zu den Quelldaten und markieren Sie Spalte C. W&auml;hlen Sie <b>Analyse: Anpassen: Linearer Fit</b> im Men&uuml;. Ein Ausklappmen&uuml; mit mehreren Designoptionen wird angezeigt, einschlie&szlig;lich dem Design <b>Schnittpunkt Null</b>, das Sie im vorherigen Schritt gespeichert haben.</li>
<li> W&auml;hlen Sie Ihr gespeichertes Design aus. Die Analyse wird automatisch f&uuml;r Spalte C durchgef&uuml;hrt, wobei die im Design gespeicherten Einstellungen verwendet werden. Beachten Sie, dass der Dialog nicht ge&ouml;ffnet wird. </li></ol>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p><b>Tipps zum Arbeiten mit Designs:</b></p>
<ul><li> Wenn Sie die <b>Shift</b>-Taste gedr&uuml;ckt halten, w&auml;hrend Sie Ihr Design im Hauptmen&uuml; ausw&auml;hlen, wird der verbundene Dialog aufgerufen. Hierbei werden die Einstellungen des gew&auml;hlten Designs in den Dialog geladen.</li>
<li> Das Standarddesign, das mit Origin f&uuml;r eine Analyse ausgeliefert wird, wird als <b>Systemstandard</b> bezeichnet. Klicken Sie auf das Aufklappmen&uuml; im Analysedialog und w&auml;hlen Sie <b>Systemstandard</b>, um es zu laden. </li>
<li> Klicken Sie auf das Aufklappmen&uuml; im Analysedialog und w&auml;hlen Sie <b>L&ouml;schen</b>, um Designs, die Sie erstellt haben, zu l&ouml;schen, einschlie&szlig;lich das benutzerdefinierte <b>&lt;Standard&gt;</b>design. </li>
<li> Die benutzerdefinierten <b>&lt;Standard&gt;</b>designs f&uuml;r alle Analysedialoge werden in der Datei Defaults.xml im <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html"><b>Anwenderdateiordner</b></a> gespeichert. Wenn diese Datei gel&ouml;scht wird, werden die Standardeinstellungen des Systems aller Analysedialoge wieder hergestellt. </li></ul>
</td></tr></table>
<h2><a name="Workbook_and_Project_Templates"></a><span class="mw-headline">Arbeitsmappen- und Projektvorlagen</span></h2>
<p><span class="OIndex" style="display:none">Vorlagen, Arbeitsmappe</span> <span class="OIndex" style="display:none">Vorlagen, Projekt</span> Es gibt eine Anzahl von Gr&uuml;nden zum Speichern einer einzelnen Arbeitsmappe oder einem ganzen Projekt als &quot;Vorlagen&quot;datei. Hier sind einige typische Szenarien.</p>
<ul><li> Sie importieren vielleicht Datendateien, die immer eine feste Anzahl Spalten mit einem sich wiederholenden Muster der Spaltenzuordnungen (z. B. XYyError, XYyError etc.) haben, also erstellen Sie eine benutzerdefinierte Arbeitsmappe nur f&uuml;r den Import dieser Dateien (<b>Datei: Vorlage speichern unter</b>).</li>
<li> Sie importieren regelm&auml;&szlig;ig Datendateien von &auml;hnlicher Struktur, f&uuml;hren einige Routineoperationen der grafischen Darstellung und Analyse mit den Daten durch und erzeugen dann einen Bericht mit Hilfe eines Notizfensters, das in einem Arbeitsblatt oder einer Arbeitsmappe eingebettet ist. Dies w&auml;re ein typisches Beispiel einer <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis_Using_an_Analysis_Template" title="OriginLab:How to Handle Repetitive Tasks">Analysevorlage</a> (<b>Datei: Arbeitsmappe als Analysevorlage speichern</b>).</li>
<li> Sie f&uuml;hren einige Operationen durch &auml;hnlich denen, die im vorherigen Beispiel beschrieben wurden, aber Sie k&ouml;nnen Ihre Arbeitsmappe nicht als Analysevorlage speichern, weil alle Daten beim Speichern aus der Arbeitsmappe gel&ouml;scht werden, wodurch das Blatt mit den Referenzwerten, die Sie f&uuml;r Ihre Analyse brauchen, zerst&ouml;rt w&uuml;rde. Stattdessen k&ouml;nnten Sie nur die importierten Daten l&ouml;schen und Ihre Arbeitsmappe als Fensterdatei speichern (<b>Datei: Fenster speichern unter</b>). Dies bewahrt das Blatt mit den Referenzdaten und und speichert die Analyse- und Grafikoperationen - wie die Analysevorlage - mit der Arbeitsmappe.</li>
<li> Sie importieren Daten routinem&auml;&szlig;ig, f&uuml;hren einige Analysen durch, erzeugen einen Bericht und w&uuml;rden gern das Konzept der Analysevorlagen verwenden (wie im zweiten Punkt), aber Sie haben mehrere Fenster in Ihrem Projekt, einschlie&szlig;lich Layoutfenstern, die nicht in die Arbeitsmappe eingebettet werden k&ouml;nnen. Ein einzelne Analysevorlage f&uuml;r eine Arbeitsmappe reicht also nicht aus. In diesem Fall k&ouml;nnten Sie das Projekt ohne Daten speichern, indem Sie es &quot;klonen&quot; (<b>Datei: Aktuelles Projekt klonen</b>).</li></ul>
<h3><a name="The_Workbook_as_Template"></a><span class="mw-headline">Die Arbeitsmappe als Vorlage</span></h3>
<p>Die Arbeitsmappe kann Arbeitsbl&auml;tter mit Daten, Metadaten, frei beweglichen oder eingebetteten Diagrammen, eingebetteten Matrizen und Notizen, au&szlig;erdem Skripte, Variablen und andere unterst&uuml;tzende Daten enthalten. <span class="OIndex" style="display:none">Diagramm einbetten, Origin-Vorlagen</span></p><p>Sie k&ouml;nnen eine Arbeitsmappe als Vorlage f&uuml;r repetitive Aufgaben der grafischen Darstellung und/oder Datenanalyse speichern. Abh&auml;ngig von Ihren Anforderungen gibt es drei Optionen zum Speichern Ihrer Arbeitsmappen -- als eine <b>Arbeitsmappe</b> (OGWU), als eine <b>Vorlage</b> (OTWU) oder als eine <b>Analysevorlage</b> (OGWU):</p>
<ul><li> <b>Arbeitsmappe (OGWU)</b>: Das W&auml;hlen von <b>Datei: Fenster speichern unter</b> speichert den <i>gesamten</i> Arbeitsmappeninhalt.</li>
<li> <b>Analysevorlage (OGWU)</b>: Das W&auml;hlen von <b>Datei: Arbeitsmappe als Analysevorlage speichern</b> l&ouml;scht alle Datenspalten, die in Analyseoperationen in der Arbeitsmappe vor dem Speichern verwendet werden. Operationen werden bewahrt genauso wie die Daten, die <i>nicht</i> mit den Analyseoperationen verbunden sind.<span class="OIndex" style="display:none">Analysevorlagen</span><span class="OIndex" style="display:none">Vorlagen, Analyse</span> </li>
<li> <b>Vorlage (OTWU)</b>: Das W&auml;hlen von <b>Datei: Vorlage speichern unter</b> speichert die Struktur der Arbeitsmappe, plus jegliche Analyseoperationen, die in der Arbeitsmappe vorhanden sind. Alle Daten jedoch, einschlie&szlig;lich der Daten, die nicht mit diesen Analyseoperationen verbunden sind, werden gel&ouml;scht.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Der Dialog <b>Neue Mappe</b> ist eine aktualisierte Vorlagenbibliothek zum Verwalten von Arbeitsmappen, Matrixmappen und Analysevorlagen. Siehe unter <a href="../../GettingStarted/OriginLab/Workbooks_Worksheets_Columns.html#Workbooks" title="OriginLab:Workbooks Worksheets Columns">Arbeitsmappen</a> eine &Uuml;bersicht &uuml;ber die Dialogfunktionen.</p></td></tr></table>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b>Tutorial: Eine Analysevorlage erstellen</b></p>
<ol><li> &Ouml;ffnen Sie eine neue Arbeitsmappe und importieren Sie die Datei <b>Samples\Curve Fitting\Sensor01.dat</b>.</li>
<li> Markieren Sie Spalte B und verwenden Sie <b>Analyse: Anpassen: Linearer Fit</b>, um den Dialog <b>Lineare Anpassung</b> zu &ouml;ffnen.</li>
<li> Setzen Sie die Auswahlliste <b>Neu berechnen</b> auf <b>Auto</b>.</li>
<li> Klicken sie auf die Registerkarte <b>Fit-Steuerung</b>, aktivieren Sie das Kontrollk&auml;stchen <b>Fester Schnittpunkt mit der Y-Achse</b> und geben Sie <b>0</b> in dem Bearbeitungsfeld <b>Fester Schnittpunkt mit der Y-Achse bei</b> ein. </li>
<li> Klicken Sie auf <b>OK</b>, um den Dialog zu schlie&szlig;en und die lineare Regression durchzuf&uuml;hren.</li>
<li> Antworten Sie mit &quot;Ja&quot; und wechseln Sie zum Berichtsblatt <b>FitLinear1</b>, um die Ergebnisse, einschlie&szlig;lich Zeichnungen der am besten angepassten Linie und Residuen, anzuzeigen.</li>
<li> Wechseln Sie dann zur&uuml;ck zu dem urspr&uuml;nglichen Datenblatt und importieren Sie die Datei <b>Samples\Curve Fitting\Sensor02.dat</b>. Die Analyseergebnisse werden automatisch mit diesen neuen Daten aktualisiert. Beachten Sie, dass Sie weiterhin diese Arbeitsmappe nutzen k&ouml;nnten, um weitere Daten zu importieren; oder Sie k&ouml;nnen mit der rechten Maustaste auf den Fenstertitel der Arbeitsmappe klicken und <b>Ohne Daten duplizieren</b> w&auml;hlen, um eine neue Arbeitsmappe zu erstellen, in der die Operation der linearen Anpassung bereits abgespeichert ist. Dies erm&ouml;glicht Ihnen, neue Daten in die neue Arbeitsmappe zu importieren und auf diese Weise bei Bedarf ein Projekt mit mehreren solcher Arbeitsmappen zu speichern.</li>
<li> W&auml;hlen Sie bei aktiver Arbeitsmappe <b>Datei: Arbeitsmappe als Analysevorlage speichern</b>, vergeben Sie in dem sich &ouml;ffnenden Dialog einen Namen wie <b>Lineare Anpassung der Sensordaten</b> und klicken Sie auf <b>Speichern</b>.</li>
<li> W&auml;hlen Sie im Men&uuml; <b>Datei: Zuletzt verwendete Mappen</b> und dann die Vorlage, die im vorherigen Schritt gespeichert wurde. Die Arbeitsmappe wird ge&ouml;ffnet und das Datenblatt ist leer.</li>
<li> Importieren Sie die Datei <b>Samples\Curve Fitting\Sensor3.dat</b> in das leere Datenblatt (1. Blatt). Die Analyseergebnisse werden automatisch beim Datenimport erzeugt.</li></ol>
</td></tr></table>
<p><b>Analysevorlagen</b> k&ouml;nnen Zusammenfassungsbl&auml;tter und benutzerdefinierte Berichtsbl&auml;tter (<a class="external text" href="../../Tutorial/Tutorial/Creating_a_Custom_Report_Sheet.html">basierend auf dem Arbeitsblatt</a> oder <a href="../../GettingStarted/OriginLab/Publishing_and_Export.html#HTML_Reports_from_Notes_Windows" title="OriginLab:Publishing and Export">HTML</a>) einschlie&szlig;en, wodurch sie zu einem idealen Medium zum Importieren, Analysieren, Zeichnen und Berichten der Ergebnisse Ihrer Routineanalysen werden. Zusammen mit dem <a class="external text" href="../../UserGuide/UserGuide/Batch_Processing.html">Hilfsmittel <b>Stapelverarbeitung</b></a> k&ouml;nnen Sie sie verwenden, um eine Reihe von Analysen und grafischen Operationen f&uuml;r eine beliebige Anzahl von Datendateien zu wiederholen und ein Zusammenfassungsbericht im PDF-Format f&uuml;r jede Datei zu erstellen, w&auml;hrend sie verarbeitet wird. In den Abschnitten <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Plotting" title="OriginLab:How to Handle Repetitive Tasks"><b>Stapelzeichnen</b></a> und <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis" title="OriginLab:How to Handle Repetitive Tasks"><b>Stapelanalyse</b></a> dieses Kapitels sind Beispiele f&uuml;r die Verwendung der Arbeitsmappe als eine Vorlage beim Durchf&uuml;hren von sich wiederholenden Aufgaben aufgef&uuml;hrt.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Notizfenster unterst&uuml;tzen jetzt <b>HTML</b>. Notizfenster k&ouml;nnen zur Arbeitsmappe hinzugef&uuml;gt werden (klicken Sie mit der rechten Maustaste auf den Reiter des Arbeitsblatts und <b>Notizen als Blatt hinzuf&uuml;gen</b>), wodurch es einfach ist, HTML-Berichte in Ihre <b>Analysevorlagen</b> einzubinden. Weitere Informationen finden Sie unter <a href="../../GettingStarted/OriginLab/Publishing_and_Export.html#HTML_Reports_from_Notes_Windows" title="OriginLab:Publishing and Export"><b>HTML-Berichte aus Notizfenstern</b></a>.</p></td></tr></table>
<h3><a name="The_Project_as_Template"></a><span class="mw-headline">Das Projekt als Vorlage</span></h3>
<p>Die Origin-Projektdatei kann auch als eine &quot;Vorlage&quot; zum Ausf&uuml;hren von sich wiederholenden Grafik- und Analyseaufgaben verwendet werden -- insbesondere wenn Ihre Analyse- und Grafikaufgaben nicht innerhalb einer einzelnen Arbeitsmappe gel&ouml;st werden k&ouml;nnen.</p><p>Die Grundschritte zum Erstellen einer &quot;Projektvorlage&quot; sind die folgenden:</p>
<ol>
<li>Erstellen Sie die gew&uuml;nschten Diagramme und/oder Analyseergebnisse aus den Daten in Ihrer/n Arbeitsmappe/n und speichern Sie das Projekt. </li>
<li>Nach Speichern des Projekts w&auml;hlen Sie <b>Datei: Aktuelles Projekt klonen</b>. Ein kleiner Dialog wird ge&ouml;ffnet, in dem das geklonte Projekt konfiguriert werden kann:<dl><dd><dl><dd><a  class="image"><img alt="ClrAllData Dialog.png" src="../images/How_to_Handle_Repetitive_Tasks/ClrAllData_Dialog.png" width="343"  /></a></dd></dl></dd></dl>
</li>
<ul> 
<li><b>Datenkonnektoren hinzuf&uuml;gen</b>: Aktivieren Sie dieses Kontrollk&auml;stchen, um <b>Datenkonnektoren</b> aus dem geklonten Projekt in Ihr gespeichertes Projekt einzuf&uuml;gen. Jedes geklonte Arbeitsblatt ist mit dem urspr&uuml;nglichen Arbeitsblatt in dem gespeicherten Projekt verbunden. Wenn Sie beabsichtigen, Daten aus andren &auml;hnlichen Dateien in Ihr geklontes Projekt zu importieren, sollten Sie dieses Kontrollk&auml;stchen deaktivieren.</li>
<li><b>Alle l&ouml;schen</b>: Es werden nur die importierten Daten gel&ouml;scht. Die Analyseoperationen werden im geklonten Projekt bewahrt. </li>
<li><b>Importierte Daten und Berechnungen l&ouml;schen</b>: Die importierten Daten und Analyseoperationen werden gel&ouml;scht.</li>
</ul>
<li>Klicken Sie auf <b>OK</b>, um Ihr geklontes Projekt zu erstellen. Die ausgew&auml;hlten Daten werden gel&ouml;scht und das geklonte Projekt wird unter dem Namen UNTITLED zum Arbeitsbereich hinzugef&uuml;gt.</li>
<li>Benennen und speichern Sie das geklonte Projekt. Wenn Sie soweit sind, weitere Datendateien zu verarbeiten, k&ouml;nnen Sie es &ouml;ffnen und neue Daten importieren:</li>
<ul>
<li>Wenn Ihre Analyse- und Grafikoperationen mit einer bestimmten Reihe von Datendateien verkn&uuml;pft sind, die regelm&auml;&szlig;ig aktualisiert werden, m&uuml;ssen Sie nicht unbedingt Konnektoren verwenden. Sie k&ouml;nnen einfach die Dateien neu importieren (<b>Daten: Neu importieren</b> oder <b>Direkt neu importieren</b>).</li>
<li>Wenn Ihre Operationen mit Hilfe von <a href="../../GettingStarted/OriginLab/Import_Data.html#Data_Connectors" title="OriginLab:Import Data">Datenkonnektoren</a> verkn&uuml;pft sind, klicken Sie auf das Symbol der Konnektoren <a  class="image"><img alt="DC Icon Live.png" src="../images/How_to_Handle_Repetitive_Tasks/DC_Icon_Live.png" width="18"  /></a> und w&auml;hlen Sie im Popup-Men&uuml; <b>Import</b> (nur dieser Konnektor) oder <b>Alle importieren</b> (alle Konnektoren in der Mappe).</li>
<li>Ein m&ouml;gliches Szenarium w&auml;re, dass Sie alle Ihre Daten in einer einzelnen Origin-Projektdatei speichern. Wenn Sie aus Ihrem geklonten Projekt Datenkonnektoren zu Ihrem urspr&uuml;nglichen Projekt hinzugef&uuml;gt haben, dann k&ouml;nnen Sie selektiv nur die Daten importieren, die Sie f&uuml;r Ihre Grafik- und Analyseoperationen brauchen. Wenn Sie fertig sind, k&ouml;nnen Sie die Datei unter einem neuen Namen speichern, wodurch Ihr geklontes Projekt zur Wiederverwendung verf&uuml;gbar bleibt.</li>
</ul>
</ol>
<h2><a name="Batch_Plotting"></a><span class="mw-headline">Stapelzeichnen</span></h2>
<p><span class="OIndex" style="display:none">Stapelzeichnen</span> Origin stellt mehrere Methoden zur Verf&uuml;gung, um Diagramme aus mehreren Datens&auml;tzen oder Dateien per Stapelverarbeitung zu zeichnen. Die folgenden zwei Abschnitte umrei&szlig;en, wie mehrere Diagramme aus (1) Daten, die sich bereits in Arbeitsbl&auml;ttern befinden, und (2) aus mehreren Datendateien erstellt werden. Zus&auml;tzlich zu diesen beiden Verfahrensweisen kann das Stapelzeichnen auch programmatisch mit Hilfe von LabTalk-Skript oder Origin C durchgef&uuml;hrt werden.</p>
<h3><a name="Duplicating_Graphs_with_Data_from_Other_Books.2FSheets.2FColumns"></a><span class="mw-headline">Diagramme mit Daten aus anderen Mappen/Bl&auml;ttern/Spalten duplizieren</span></h3>
<p>Wenn Sie mehrere Arbeitsmappen, Arbeitsbl&auml;tter oder Spalten mit &auml;hnlicher Datenstruktur haben wie diejenigen, die zum Zeichnen des Diagramms verwendet wurden, k&ouml;nnen Sie Origin veranlassen, das Diagramm &uuml;ber <b>Fenster: Duplizieren (Stapelzeichnen)</b> mit neuen Daten zu kopieren. Es gibt zwei F&auml;lle:</p>
<ul><li> Wenn Sie ein Diagramm mit einem einzelnen Datensatz gezeichnet und es benutzerdefiniert angepasst haben und dieses Diagramm mit anderen Daten in dem gleichen Arbeitsblatt &quot;klonen&quot; m&ouml;chten: W&auml;hlen Sie <b>Fenster: Duplizieren (Stapelzeichnen): Duplizieren mit neuen Spalten</b>. W&auml;hlen Sie andere Daten (Spalten), die Sie zeichnen m&ouml;chten. Jede Spalte wird als neues Diagramm gezeichnet. </li>
<li> Wenn Sie ein Diagramm mit Daten aus einem Arbeitsblatt oder einer Arbeitsmappe gezeichnet und es benutzerdefiniert angepasst haben und dieses Diagramm mit einem anderen Arbeitsblatt oder einer anderen Arbeitsmappe mit &auml;hnlicher Datenstruktur &quot;klonen&quot; m&ouml;chten: W&auml;hlen Sie <b>Fenster: Duplizieren (Stapelzeichnen): Duplizieren mit neuen Bl&auml;ttern/Mappen</b>. Origin listet alle Arbeitsbl&auml;tter bzw. Arbeitsmappen mit einer &auml;hnlichen Datenstruktur auf. W&auml;hlen Sie das Arbeitsblatt bzw. die Arbeitsmappe, aus der Sie zeichnen m&ouml;chten. Jedes Arbeitsblatt/jede Arbeitsmappe wird als ein neues Diagramm gezeichnet. <span class="OIndex" style="display:none">Diagramme, mit neuen Daten &quot;klonen&quot;</span></li></ul>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b>Tutorial: Ein Diagramm mit Daten aus anderen Mappen/Bl&auml;ttern duplizieren</b></p>
<ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Neues Projekt</b> <a  class="image"><img alt="Button New Project.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_New_Project.png" width="22"  /></a> auf der Symbolleiste <b>Standard</b>.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Importassistent</b> <a  class="image"><img alt="Button Import Wizard.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Import_Wizard.png" width="25"  /></a> in der gleichen Symbolleiste. Der Dialog des Importassistents wird ge&ouml;ffnet.</li>
<li> Klicken Sie auf die Schaltfl&auml;che Durchsuchen <a  class="image"><img alt="Button Browse.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Browse.png" width="20"  /></a> rechts neben dem Feld <b>Datei</b>. Navigieren Sie zu dem Ordner <b>Import and Export</b> und markieren Sie die Dateien <b>S15-125-03.dat</b>, <b>S21-235-07.dat</b> und <b>S32-014-04.dat</b>. Klicken Sie auf <b>Hinzuf&uuml;gen</b> und dann auf <b>OK</b>. Klicken Sie im Dialog Importassistent auf <b>Fertigstellen</b>. Die drei Dateien werden in drei separate Arbeitsmappen importiert.</li>
<li> Markieren Sie alle drei Y-Spalten in einer der Arbeitsmappen und w&auml;hlen Sie im Men&uuml; <b>Zeichnen &gt; 2D: Mehrere Kurven: 3Y, Y-YY</b>, um ein Diagramm mit mehreren Y-Achsen und einer gemeinsamen X-Achse zu erstellen. Nehmen Sie die gew&uuml;nschten Anpassungen an dem Diagramm vor.</li>
<li> Klicken Sie mit der rechten Maustaste auf die Titelleiste des Diagrammfensters. W&auml;hlen Sie dann <b>Duplizieren (Stapelzeichnen)</b> im Kontextmen&uuml;. </li>
<li> Dr&uuml;cken Sie in dem aufgerufenen Dialog die Strg-Taste und w&auml;hlen Sie die zwei anderen Arbeitsmappen/Arbeitsbl&auml;tter. Klicken Sie dann auf <b>OK</b>. Es werden zwei weitere Diagramme mit den Daten aus den zwei anderen Arbeitsmappen/Arbeitsbl&auml;ttern erstellt. </li></ol>
</td></tr></table>
<h3><a name="The_Workbook_as_a_Template_for_Processing_Multiple_Files"></a><span class="mw-headline">Arbeitsmappe als Vorlage zum Verarbeiten mehrerer Dateien verwenden</span></h3>
<p>Wenn Sie Diagramme mit vielen Datendateien zeichnen, aber nicht zuerst alle Datendateien in die Arbeitsmappe importieren m&ouml;chten, k&ouml;nnen Sie eine Datei importieren, das/die gew&uuml;nschte/n Diagramm/e basierend auf diesen Daten erstellen, dann das/die Diagramm/e zu Ihrer Arbeitsmappe hinzuf&uuml;gen und die Arbeitsmappe als Vorlage speichern. Mit Hilfe dieser Vorlage k&ouml;nnen Sie mehrere Dateien verarbeiten und eine Mappe f&uuml;r jede Datei und das entsprechende Diagramm erstellen.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b>Tutorial: Diagramme aus mehreren Datendateien erstellen</b></p>
<ol><li> W&auml;hlen Sie bei aktiver neuer Arbeitsmappe <b>Daten: Datei importieren: Einzelnes ASCII</b> und importieren Sie die Datei <b>Sensor01.dat</b> aus dem Unterordner <b>Samples\Curve Fitting</b> des Origin-Installationsverzeichnisses.</li>
<li> Markieren Sie Spalte B und erstellen Sie ein Punkt-Liniendiagramm der Daten.</li>
<li> Klicken Sie doppelt auf die X-Achse, um den Dialog Achsen zu &ouml;ffnen. Stellen Sie sicher, dass die Registerkarte <b>Skalierung</b> aktiv ist. W&auml;hlen Sie sowohl <b>Horizontal</b> als auch <b>Vertikal</b> im linken Bedienfeld und setzen Sie <b>Neuskalieren</b> auf <b>Auto</b>. Klicken Sie auf <b>OK</b>. Dies stellt sicher, dass die Diagrammskalierung automatisch bei Daten&auml;nderung aktualisiert wird.</li>
<li> Klicken Sie in der Arbeitsmappe mit der rechten Maustaste auf den Reiter des Arbeitsblatts und w&auml;hlen Sie <b>Diagramm als Blatt hinzuf&uuml;gen</b>. W&auml;hlen Sie dann das oben erstellte Diagramm aus und klicken Sie auf <b>Fertig</b>. Es wird ein neues Blatt zu der Arbeitsmappe hinzugef&uuml;gt, das ein eingebettetes Diagramm enth&auml;lt.</li>
<li> Wechseln Sie zum Datenblatt, klicken Sie doppelt auf den Reiter und benennen Sie das Blatt in <b>Daten</b> um.</li>
<li> W&auml;hlen Sie <b>Worksheet: Worksheet l&ouml;schen</b>, um die Daten in diesem Blatt zu l&ouml;schen. Beachten sie, dass dieser Schritt optional ist. Durch das L&ouml;schen der Daten wird die Gr&ouml;&szlig;e der Vorlage reduziert, die im n&auml;chsten Schritt gespeichert wird. </li>
<li> W&auml;hlen Sie <b>Datei: Fenster speichern unter</b>, vergeben Sie einen Namen wie <b>Sensordaten und Diagramm</b> und klicken Sie auf <b>Speichern</b>.</li>
<li> Jetzt k&ouml;nnen Sie diese Vorlage verwenden, um mehrere Dateien zu verarbeiten. W&auml;hlen Sie im Men&uuml; <b>Datei: Stapelverarbeitung</b>.</li>
<li> In dem aufgerufenen Dialog setzen Sie den <b>Modus Stapelverarbeitung</b> auf <b>Analysevorlage laden</b> und navigieren dann im Feld <b>Analysevorlage</b> zu der von Ihnen gespeicherten Vorlage.</li>
<li> Setzen Sie die <b>Datenquelle</b> auf <b>Aus Dateien importieren</b> und w&auml;hlen Sie die drei Dateien <b>Sensor01.dat</b>, <b>Sensor02.dat</b> und <b>Sensor03.dat</b> aus dem Unterordner <b>Samples\Curve Fitting</b>.</li>
<li> Legen Sie f&uuml;r <b>Datenblatt</b> die Option <b>Daten</b> fest und f&uuml;r <b>Ergebnisblatt</b> die Option <b>Keine</b>. </li>
<li> Klicken Sie auf <b>OK</b>, um den Dialog zu schlie&szlig;en. Sie sollten drei Arbeitsmappen erhalten, bei denen die Daten in das erste Blatt importiert sind und sich die aktualisierten Diagramme im zweiten Blatt befinden. Um die Diagramme weiter zu bearbeiten, klicken Sie doppelt auf das Diagramm, um eine bearbeitbare Seite aufzurufen.</li></ol>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn die Verarbeitung Ihrer Daten benutzerdefinierte Importeinstellungen erfordert, werden diese Einstellungen standardm&auml;&szlig;ig im Datenblatt gespeichert. Auf diese Weise im Blatt gespeicherte Einstellungen werden f&uuml;r den Import verwendet, wenn eine Stapelverarbeitung mehrerer Dateien mit Hilfe der Arbeitsmappe als Vorlage durchgef&uuml;hrt wird.</p></td></tr></table>
<h2><a name="Batch_Analysis"></a><span class="mw-headline">Stapelanalyse</span></h2>
<p>Origin bietet mehrere M&ouml;glichkeiten, um die Stapelanalyse von mehreren Dateien, Datenspalten oder Datenzeichnungen durchzuf&uuml;hren.</p>
<h3><a name="Analyzing_Multiple_Datasets_in_Dialogs"></a><span class="mw-headline">Mehrere Datens&auml;tze in Dialogen analysieren</span></h3>
<p>Einige Analysedialoge, zum Beispiel Lineare Anpassung und Nichtlinearer Fit, unterst&uuml;tzen die Analyse von mehreren Datens&auml;tzen. Berichtsbl&auml;tter, die durch diese Dialoge erzeugt wurden, enthalten eine Zusammenfassungstabelle, die die Parameterwerte f&uuml;r jeden Datensatz und andere zugeh&ouml;rige Ergebnisse wie die G&uuml;te der Anpassungsindikatoren auff&uuml;hrt. Die Zusammenfassungstabelle kann in ein externes Blatt zur weiteren Verarbeitung kopiert werden.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b> Tutorial: Mehrere Datens&auml;tze anpassen</b></p>
<ol><li> &Ouml;ffnen Sie eine neue Arbeitsmappe und importieren Sie die Datei <b>Samples\Curve Fitting\Multiple Gaussians.dat</b> aus dem Origin-Installationsverzeichnis.</li>
<li> Legen Sie die Langnamen der vier Y-Spalten mit <b>Peak 1</b>, <b>Peak 2</b>, <b>Peak 3</b> und <b>Peak 4</b> fest.</li>
<li> Markieren Sie alle vier Y-Spalten und w&auml;hlen Sie <b>Analyse: Anpassen: Nichtlinearer Fit</b>, um den Dialog <b>NLFit</b> zu &ouml;ffnen.</li>
<li> W&auml;hlen Sie <b>Gauss</b> in der Auswahlliste <b>Funktion</b>, klicken Sie dann auf die Schaltfl&auml;che <b>Fit</b>, um die Anpassung durchzuf&uuml;hren und schlie&szlig;en Sie den Dialog.</li>
<li> Wechseln Sie zum Berichtsblatt <b>FitNL1</b>. Es wird eine Tabelle mit dem Namen <b>Zusammenfassung</b> gezeigt, die die Fitparameter und die Fitstatistik f&uuml;r jeden Datensatz auflistet.</li></ol>
<p><a  class="image"><img alt="GSB Batch NLFit Summary.png" src="../images/How_to_Handle_Repetitive_Tasks/GSB_Batch_NLFit_Summary.png" width="550"  /></a></p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Klicken Sie im Berichtsblatt des nichtlinearen Fits auf die Schaltfl&auml;che mit dem nach unten zeigenden Pfeil <a  class="image"><img alt="Button Extract Worksheet DropDown.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Extract_Worksheet_DropDown.png" width="16"  /></a> neben der Tabelle <b>Zusammenfassung</b> und w&auml;hlen Sie <b>Eine Kopie als neues Blatt erstellen</b>. Eine Kopie der Tabelle wird erzeugt, in der alle Zellen mit dem Bericht verkn&uuml;pft sind. Jegliche Aktualisierungen/&Auml;nderungen an der Anpassung aktualisieren automatisch die Werte in diesem kopierten Blatt. Dieses Blatt kann dann verwendet werden, um zu zeichnen oder eine sekund&auml;re Analyse der Anpassungsparameter durchzuf&uuml;hren.</p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Beim Nummerieren von z. B. einem Spaltenlangnamen, wie Sie das in Schritt 2 oben getan haben, geben Sie die Zeichenkette in die erste Zelle ein (z. B. &quot;Peak 1&quot;), w&auml;hlen Sie die Zelle und fahren Sie mit der Maus &uuml;ber die untere rechte Ecke. Wenn der Cursor ein &quot;<b>+</b>&quot; wird, ziehen Sie ihn &uuml;ber die anderen Zellen. Der Inhalt der ersten Zelle wird auf andere Zellen erweitert.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Extend string to other cells.png" src="../images/How_to_Handle_Repetitive_Tasks/Extend_string_to_other_cells.png" width="301"  /></a></dd></dl></dd></dl>
</td></tr></table>
<h3><a name="Using_Gadgets_for_Analyzing_Multiple_Curves"></a><span class="mw-headline">Minitools zum Analysieren von mehreren Kurven verwenden</span></h3>
<p><span class="OIndex" style="display:none">Minitools</span><span class="OIndex" style="display:none">Region of Interest (ROI)</span> Origin verf&uuml;gt &uuml;ber mehrere Minitools f&uuml;r die Durchf&uuml;hrung von interaktiven Analysen gezeichneter Daten. Minitools erm&ouml;glichen das Ausw&auml;hlen eines bestimmten Datenbereichs, das Wechseln zwischen Datens&auml;tzen und das Festlegen von verschiedenen Einstellungen, die sich auf die Ausf&uuml;hrung der Analyse beziehen.</p><p>Die meisten Minitools bieten eine Option zum Durchf&uuml;hren der Analyse auf alle Datenzeichnungen in dem aktuellen Layer oder alle Datenzeichnungen auf der Diagrammseite. Daher k&ouml;nnen Sie eine sich wiederholende Analyse auf mehrere Datens&auml;tze mit den gleichen Einstellungen durchf&uuml;hren und eine Tabelle mit den Ergebnissen &uuml;ber alle Datens&auml;tze erzeugen.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><span class="OIndex" style="display:none">Grafische Datenauswahl (ROI)</span><p><b>Tutorial: Das Minitool Integration zum Integrieren von mehreren Kurven verwenden </b></p>
</p>
<ol><li> &Ouml;ffnen Sie das Projekt &quot;Samples\Spectroscopy\Absorbance Spectra.opj&quot;.</li>
<li> W&auml;hlen Sie bei einem aktiven Diagrammfenster <b>Minitools: Integration</b> im Hauptmen&uuml;. </li>
<li> Klicken Sie in dem sich &ouml;ffnenden Dialog auf die Registerkarte <b>Basislinie</b> und setzen Sie die Auswahlliste <b>Modus</b> auf <b>Gerade Linie</b>.</li>
<li> Klicken Sie auf die Registerkarte <b>Ausgabe</b>, erweitern Sie den Zweig <b>Eigenschaften ausgeben in</b> und aktivieren Sie <b>An Worksheet anh&auml;ngen</b>. Klicken Sie auf <b>OK</b>, um den Dialog zu schlie&szlig;en.</li>
<li> Ein sogenanntes ROI-Objekt (Region of Interest) wird in dem Diagramm platziert. Klicken Sie ggf. auf das ROI-Feld und ver&auml;ndern Sie die Gr&ouml;&szlig;e dieses Objekts, um den gesamten Datenbereich, der in dem Diagramm gezeichnet wurde, abzudecken. Die integrierte Fl&auml;che wird als schattierter Bereich angezeigt.</li>
<li> Klicken Sie auf die Schaltfl&auml;che mit dem Pfeil <a  class="image"><img alt="Right arrow menu button.png" src="../images/How_to_Handle_Repetitive_Tasks/Right_arrow_menu_button.png" width="17"  /></a> oben rechts im ROI-Objekt und w&auml;hlen Sie dann <b>Daten &auml;ndern</b> im Kontextmen&uuml;, um zu einer anderen Zeichnung im Layer zu wechseln. Pr&uuml;fen Sie, ob die aktuellen Einstellungen der Basislinie f&uuml;r andere Kurven im Layer geeignet sind.</li>
<li> Klicken Sie auf die Pfeilschaltfl&auml;che <a  class="image"><img alt="Right arrow menu button.png" src="../images/How_to_Handle_Repetitive_Tasks/Right_arrow_menu_button.png" width="17"  /></a>, w&auml;hlen Sie <b>Neue Ausgabe f&uuml;r alle Kurven (N)</b> oder dr&uuml;cken Sie direkt die N-Taste. Die Integration wird f&uuml;r alle Kurven durchgef&uuml;hrt. </li>
<li> Klicken Sie erneut auf den Pfeil <a  class="image"><img alt="Right arrow menu button.png" src="../images/How_to_Handle_Repetitive_Tasks/Right_arrow_menu_button.png" width="17"  /></a> und w&auml;hlen Sie <b>Zum Berichtsblatt gehen</b>. Erweitern Sie das Berichtsblatt, um die Integrationsergebnisse aller Kurven anzuzeigen.</li></ol>
<p><a  class="image"><img alt="GSB BatchAnalysis Gadget.png" src="../images/How_to_Handle_Repetitive_Tasks/GSB_BatchAnalysis_Gadget.png" width="660"  /></a></p></td></tr></table>
<h3><a name="Batch_Analysis_Using_an_Analysis_Template"></a><span class="mw-headline">Stapelanalyse mit Analysevorlage</span></h3>
<p><span class="OIndex" style="display:none">Analysevorlagen</span><span class="OIndex" style="display:none">Vorlagen, Analyse</span><span class="OIndex" style="display:none">Analyseberichte</span><span class="OIndex" style="display:none">Berichte, Analyse</span> Das Hilfsmittel <b>Stapelverarbeitung</b> erm&ouml;glicht Ihnen, mehrere Dateien oder Datens&auml;tze mit Hilfe einer <b>Analysevorlage</b> zu verarbeiten. F&uuml;hren Sie einfach die Analyse f&uuml;r eine der Dateien durch, fassen Sie alle gew&uuml;nschten Ergebnisse und Berichtsbl&auml;tter in einer Arbeitsmappe zusammen und speichern Sie diese Arbeitsmappe als eine Analysevorlage. Das Hilfsmittel Stapelverarbeitung verwendet dann die Analysevorlage, um mehrere Dateien/Datens&auml;tze zu verarbeiten. Sie haben die Option, eine Arbeitsmappe f&uuml;r jede Datei/jeden Datensatz zu speichern und au&szlig;erdem eine Zusammenfassungstabelle mit ausgew&auml;hlten Analyseparametern und anderen Metadaten zu erstellen, die Sie in Ihrer Analysevorlage vorkonfiguriert haben.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b>Tutorial: Stapelanalyse von mehreren Dateien mit Hilfe einer Analysevorlage</b></p>
<ol><li> W&auml;hlen Sie im Men&uuml; <b>Datei: Stapelverarbeitung</b>. Der Dialog der <b>Stapelverarbeitung</b> wird ge&ouml;ffnet.</li>
<li> Setzen Sie den <b>Modus Stapelverarbeitung</b> auf <b>Analysevorlage laden</b>.</li>
<li> Klicken Sie auf die Schaltfl&auml;che Durchsuchen <a  class="image"><img alt="Button Browse.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Browse.png" width="20"  /></a> rechts vom Feld <b>Analysevorlage</b> und navigieren Sie zur Datei <i>&lt;Origin-Programmordner&gt;</i><b>\Samples\Batch Processing\Sensor Analysis.OGW</b>. Diese Analysevorlage enth&auml;lt mehrere Bl&auml;tter f&uuml;r die lineare Regressionsanalyse, Berichtserstellung und Zusammenfassungstabellen.</li>
<li> Setzen Sie die <b>Datenquelle</b> auf <b>Aus Dateien importieren</b>. Klicken Sie dann auf die Schaltfl&auml;che <a  class="image"><img alt="Button Browse.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Browse.png" width="20"  /></a> rechts von der <b>Dateiliste</b> und w&auml;hlen Sie im Unterordner <b>Samples\Curve Fitting</b> die Dateien <b>Sensor01.dat</b>, <b>Sensor02.dat</b> und <b>Sensor03.dat</b> aus.</li>
<li> Setzen Sie <b>Datensatzidentifikator</b> auf <b>Dateiname</b>, <b>Datenblatt/-bl&auml;tter</b> auf <b>Daten</b> und <b>Ergebnisblatt</b> auf <b>Ergebnis</b>. Beachten Sie, dass dies die Namen der existierenden Bl&auml;tter in der Analysevorlage sind.</li>
<li> <b>Zwischenmappen l&ouml;schen</b> deaktivieren</li>
<li> Klicken Sie auf <b>OK</b>, um den Dialog zu schlie&szlig;en, und verarbeiten Sie die drei Dateien (Sie k&ouml;nnen auf die Frage mit &quot;Nein&quot; antworten). Sie erhalten drei Mappen mit Daten, Analyseergebnissen und Bericht f&uuml;r jede Datei und eine vierte Mappe, die die Zusammenfassungstabelle der Analyseergebnisse von allen Dateien enth&auml;lt.</li></ol>
<dl><dd><a  class="image"><img alt="GSB BatchAnalysis Files.png" src="../images/How_to_Handle_Repetitive_Tasks/GSB_BatchAnalysis_Files.png" width="547"  /></a></dd></dl>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Das Speichern der anf&auml;nglichen Arbeitsmappe als Analysevorlage ist optional. Sie k&ouml;nnen einfach das Origin-Projekt (.opj) speichern und beim n&auml;chsten Mal die Daten in Ihrer Arbeitsmappe ersetzen, um alle Ergebnisse und Diagramme zu aktualisieren. Das Hilfsmittel <b>Stapelverarbeitung</b> verf&uuml;gt auch &uuml;ber eine Option zum wiederholten Importieren von Dateien in das aktive Fenster, so dass Sie eine vorhandene Mappe innerhalb eines Projekts  (das alle gew&uuml;nschten Analysen und Diagramme enth&auml;lt) einfach wieder verwenden k&ouml;nnen als Vorlage f&uuml;r die Stapelanalyse.</p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Sie k&ouml;nnen Analyseberichte per Stapelverarbeitung mit Hilfe einer benutzerdefinierten <b>MS Word</b>-Vorlage erzeugen mit der Option, eine <b>PDF</b>- und/oder eine <b>MS Word</b>-Datei f&uuml;r jeden Bericht auszugeben. Au&szlig;erdem k&ouml;nnen Sie die Berichte in einer einzelnen Datei kombinieren. Informationen zur <b>Stapelverarbeitung mit Word-Vorlage zum Erzeugen von Berichten</b> finden Sie in <a class="external text" href="../../Tutorial/Tutorial/Batch_Processing_with_Word_Template_for_Reporting.html">diesem Tutorial</a>.</p></td></tr></table>
<h2><a name="Repeating_Analysis_on_Other_Datasets_or_Data_Plots"></a><span class="mw-headline">Analyse f&uuml;r andere Datens&auml;tze oder Datenzeichnungen wiederholen</span></h2>
<p>Bei einigen Analyseoperationen k&ouml;nnen Sie die Analyse f&uuml;r einen Datensatz oder eine Datenzeichnung durchf&uuml;hren und dann die Analyse f&uuml;r alle anderen Daten wiederholen. Diese Funktion ist &uuml;ber einen Kontextmen&uuml;befehl verf&uuml;gbar, wenn Sie auf das mit der Operation verbundene Schloss klicken.</p>
<ul><li> Wenn Sie in Arbeitsblattspalten oder Berichten auf das Schloss klicken, wird der Men&uuml;befehl <b>Dies f&uuml;r alle Y-Spalten wiederholen</b> angezeigt. Durch Auswahl dieser Option wird die Analyse f&uuml;r alle anderen Y-Spalten in dem Quelldatenblatt wiederholt. </li>
<li> Wenn Sie in einem Diagramm auf das Schloss klicken, wird der Men&uuml;befehl <b>Dies f&uuml;r alle Zeichnungen wiederholen</b> angezeigt. Durch Auswahl dieser Option wird die Analyse f&uuml;r alle anderen Datenzeichnungen auf der Diagrammseite durchgef&uuml;hrt, sogar wenn die Zeichnungen sich in verschiedenen Layern befinden.</li></ul>
<p>Dies ist insbesondere f&uuml;r solche Analysedialoge n&uuml;tzlich wie z. B. zum <b>Gl&auml;tten</b> oder <b>Interpolation</b> etc., die nur die Eingabe von einem Datensatz unterst&uuml;tzen. Solange die Daten <i>in einem Arbeitsblatt enthalten</i> oder <i>in einem Diagramm gezeichnet</i> sind, kann die Analyse f&uuml;r alle anderen Datens&auml;tze wiederholt werden.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Alert_icon.png" width="57"  border="0" /></td><td><p>Anwender sollten eine &Auml;nderung in <b>Origin 2022b</b> beachten: In &auml;lteren Versionen, wenn die urspr&uuml;ngliche Analyseausgabe ein neues Blatt oder eine neue Mappe erstellte, erstellte die Funktion <b>Dies f&uuml;r alle wiederholen</b> ein neues Blatt oder eine neue Mappe f&uuml;r die restlichen Y-Spalten oder Zeichnungen. Anwender &auml;u&szlig;erten den Wunsch, die gesamte Ausgabe an ein einzelnes Blatt zu senden, unabh&auml;ngig von der urspr&uuml;nglichen Ausgabespezifikation. Wenn die Eingabespalten einen gemeinsamen X-Datensatz teilen, wird der X-Datensatz nur einmal in das Ausgabeblatt geschrieben. Um zum alten Verhalten zur&uuml;ckzukehren, setzen Sie <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#R"><b>@RAO</b> = <i>0</i></a> (Standard ist <i>1</i>).</p>
	</td>
	</tr>
	</table>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b>Tutorial: Mehrere Spalten in einem Arbeitsblatt gl&auml;tten</b></p>
<ol><li> Importieren Sie die Datei <b>\Samples\Curve Fitting\Multiple Gaussians.dat</b> in eine leere Arbeitsmappe.</li>
<li> Markieren Sie Spalte B und w&auml;hlen Sie im Men&uuml; <b>Analyse: Signalverarbeitung: Gl&auml;tten</b>, um den Dialog <b>smooth</b> zu &ouml;ffnen.</li>
<li> &Uuml;bernehmen Sie die Standardeinstellungen und klicken Sie auf <b>OK</b>, um die Gl&auml;ttung durchzuf&uuml;hren. Es wird eine neue Spalte mit den gegl&auml;tteten Daten hinzugef&uuml;gt.</li>
<li> Klicken Sie auf das Schloss <a  class="image"><img alt="Operation lock manual.png" src="../images/How_to_Handle_Repetitive_Tasks/Operation_lock_manual.png" width="13"  /></a> in der Ausgabespalte und w&auml;hlen Sie <b>Dies f&uuml;r alle Y-Spalten wiederholen</b>. Drei weitere Spalten der gegl&auml;tteten Daten mit den gleichen Einstellungen werden aus den Daten in den Spalten C bis E erzeugt.</li></ol>
</td></tr></table>
<h2><a name="Duplicate_this_Operation"></a><span class="mw-headline">Diese Operation duplizieren</span></h2>
<p>Die Ausgabe, die durch Origins Analyseoperationen erzeugt wird, wird mit ihren Quelldaten durch eine besondere Analyse und eine besondere Reihe von Analyseparametern verkn&uuml;pft. Diese Verkn&uuml;pfung wird durch das Platzieren eines <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Recalculation" title="OriginLab:How to Handle Repetitive Tasks">&quot;Operationsschlosses&quot;</a> auf der Analyseausgabe gekennzeichnet und -- es sei denn, der <a href="#Recalculation">Anwender schaltet die Neuberechnung f&uuml;r eine bestimmte Operation <i>aus</i></a> -- diese Ergebnisse werden generell f&uuml;r die Bearbeitung &quot;gesperrt&quot;. Sie k&ouml;nnen weitere Informationen dar&uuml;ber unter <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Analysis_Report_Sheets" title="OriginLab:How to Handle Repetitive Tasks">Analyseberichtsbl&auml;tter</a> und <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Recalculation" title="OriginLab:How to Handle Repetitive Tasks">Neuberechnung</a> in den einf&uuml;hrenden Abschnitten dieses Kapitels finden.</p><p>Das Schlosssymbol auf der Analyseausgabe kann angeklickt werden, um ein Men&uuml; zu &ouml;ffnen, das Ihnen postanalytischen Zugriff auf die Operationsparameter und weitere Informationen gew&auml;hrt. Dies umfasst den Dialog und den Parametersatz, die zum Erzeugen der Analyseausgabe verwendet wurde. Es wird durch Klicken auf <b>Parameter &auml;ndern</b> ge&ouml;ffnet.</p><p>Am Ende dieses Men&uuml;s sehen Sie den Eintrag <b>Diese Operation duplizieren</b>.</p>
<dl><dd><a  class="image"><img alt="UG lock dujplicate this operation.png" src="../images/How_to_Handle_Repetitive_Tasks/UG_lock_dujplicate_this_operation.png" width="433"  /></a></dd></dl>
<p>Eine m&ouml;gliche Verwendung der Funktion ist folgende:</p>
<ol><li> Die Anwenderin f&uuml;hrt eine Analyseoperation f&uuml;r eine Datenzeichnung durch, beispielsweise eine Anpassungsoperation mittels der nichtlineare Kurvenanpassung (NLFit).</li>
<li> Die Anwenderin ist nicht sicher, welche Anpassungsfunktion die Daten am besten modelliert, also versucht sie eine Anpassung mit Hilfe einer potenziellen Funktion.</li>
<li> Sie klickt auf das sich ergebende Operationsschloss und w&auml;hlt <b>Diese Operation duplizieren</b>.</li>
<li> Eine Duplikatsanalyse wird ausgef&uuml;hrt und ein zweites Operationsschloss wird zum Diagrammfenster hinzugef&uuml;gt.</li>
<li> Die Anwenderin klickt auf das zweite Operationsschloss, w&auml;hlt <b>Parameter &auml;ndern</b> und, wenn der Dialog NLFit ge&ouml;ffnet ist, w&auml;hlt ihre alternative Anpassungsfunktion und f&uuml;hrt eine neue Anpassungsoperation durch. Die neue Anpassungsoperation ergibt eine neue Ausgabe, die jetzt mit der Ausgabe verglichen werden kann, die von einer Anpassung mit der ersten Anpassungsfunktion erzeugt wurde.</li></ol>
<dl><dd><dl><dd><a  class="image"><img alt="UG duplicate this operation nlfit.png" src="../images/How_to_Handle_Repetitive_Tasks/UG_duplicate_this_operation_nlfit.png" width="487"  /></a></dd></dl></dd></dl>
<h2><a name="Repeating_Analysis_Using_Data_Filters"></a><span class="mw-headline">Analyse mit Hilfe von Datenfiltern wiederholen</span></h2>
<p><span class="OIndex" style="display:none">Datenfilter f&uuml;r wiederkehrende Aufgaben</span><span class="OIndex" style="display:none">Wiederkehrende Aufgaben, Filter f&uuml;r</span></p><p>Gro&szlig;e Datens&auml;tze mit mehreren Spalten k&ouml;nnen schnell reduziert werden, indem Filterbedingungen auf eine oder mehrere Spalten angewendet werden. Diese <a class="external text" href="../../UserGuide/UserGuide/Data_Filter.html">Datenfilterfunktion</a> kann auch zusammen mit der <a class="external text" href="../../UserGuide/UserGuide/Copy_Columns_to_New_Destination.html">X-Funktion zum Kopieren von Spalten (colcopy)</a> verwendet werden, um mehrere Diagramme aus den gleichen Quelldaten mit Hilfe unterschiedlicher Filterbedingungen zu erzeugen. Die gefilterten Daten k&ouml;nnen auch analysiert werden, so dass Sie die Diagramme und Analyseergebnisse der verschiedenen Filterbedingungen vergleichen k&ouml;nnen.</p><p>Ausgew&auml;hlte Spalten des Quelldatenblatts k&ouml;nnen kopiert werden, um Unterbl&auml;tter zu erzeugen, in denen die Filterbedingung mit dem Hauptblatt synchronisiert bleibt bzw. f&uuml;r das Unterblatt blockiert wird. Wenn das Quelldatenblatt aktualisiert wird, werden alle Unterbl&auml;tter, zugeh&ouml;rigen Diagramme und Analyseergebnisse automatisch mit Hilfe ihrer jeweiligen Filterbedingungen aktualisiert. Zus&auml;tzlich kann die Filterbedingung eines bestimmten Unterblattes jederzeit wieder auf das Hauptblatt angewendet werden.</p><p>Das Bild unten zeigt die Quellarbeitsmappe mit Daten von mehreren Autoherstellern. Zwei Mappen wurden aus einem Teildatensatz und einem Datenfilter erstellt, um die Daten auf einen bestimmten Autohersteller zu beschr&auml;nken. Es wurde eine lineare Regressionsanalyse der gefilterten Daten durchgef&uuml;hrt, so dass Sie die Ergebnisse der zwei Filter miteinander vergleichen k&ouml;nnen.</p>
<dl><dd><a  class="image"><img alt="GSB DataFilter Locked.png" src="../images/How_to_Handle_Repetitive_Tasks/GSB_DataFilter_Locked.png" width="600"  /></a></dd></dl>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b> Tutorial: Eine Filterbedingung f&uuml;r kopierte Spalten blockieren </b></p>
<ol><li> Importieren Sie die Datei <b>\Samples\Statistics\automobile.dat</b></li>
<li> Klicken Sie auf die Spalte <b>Make</b> und dann auf die Schaltfl&auml;che <b>Datenfilter hinzuf&uuml;gen/entfernen</b> <a  class="image"><img alt="Button Add Or Remove Data Filter.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Add_Or_Remove_Data_Filter.png" width="23"  /></a> auf der Symbolleiste Worksheet-Daten.</li>
<li> Klicken Sie auf das Filtersymbol <a  class="image"><img alt="Button Add Or Remove Data Filter.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Add_Or_Remove_Data_Filter.png" width="23"  /></a>, das zu der Spalte hinzugef&uuml;gt wurde, und deaktivieren Sie alle Hersteller au&szlig;er <i>Honda</i> (<b>Hinweis:</b> Deaktivieren Sie das H&auml;kchen neben <b>Alle ausw&auml;hlen</b>, aktivieren Sie dann <i>Honda</i> und klicken Sie auf <b>OK</b>).</li>
<li> Halten Sie die Strg-Taste gedr&uuml;ckt und markieren Sie die Spalten <b>Make</b>, <b>Power</b> und <b>Engine Displacement</b>. Klicken Sie als N&auml;chstes mit der rechten Maustaste und w&auml;hlen Sie im Kontextmen&uuml; <b>Spalte kopieren in</b>.</li>
<li> Erweitern Sie im aufgerufenen Dialog <b>Beschriftungen kopieren</b> und setzen Sie ein H&auml;kchen neben <b>Langname</b> und <b>Einheiten</b>. Klicken Sie dann auf <b>OK</b>. Es wird ein neues Arbeitsblatt zur Arbeitsmappe hinzugef&uuml;gt. Dies enth&auml;lt nur die Daten von Honda f&uuml;r <i>Power</i> und <i>Engine Displacement</i>.</li>
<li> Klicken Sie auf den Reiter des neuen Arbeitsblatts und halten Sie die Maustaste gedr&uuml;ckt. Ziehen Sie es auf eine leere Stelle des Arbeitsbereichs, um eine separate Arbeitsmappe zu erstellen.</li>
<li> Klicken Sie auf eines der Schl&ouml;sser in den Spalten dieses kopierten Blattes und w&auml;hlen Sie <b>Arbeitsblattfilter: Blockieren</b>. Die Filterbedingungen werden f&uuml;r dieses Blatt blockiert. Wenn Sie die Filterbedingung in dem urspr&uuml;nglichen Datenblatt &auml;ndern, ist dieses kopierte Blatt nicht betroffen. </li>
<li> Sie k&ouml;nnen jetzt zur urspr&uuml;nglichen Mappe <b>automobile</b> zur&uuml;ckkehren, auf das Filtersymbol klicken und die Filterbedingung auf Toyota setzen. Verwenden Sie <b>Spalten kopieren in</b>, um ein weiteres Arbeitsblatt zu erstellen.</li>
<li> Markieren Sie Spalte B in Ihrer Arbeitsmappe Honda, klicken Sie mit der rechten Maustaste auf sie und w&auml;hlen Sie <b>Setzen als: X</b>. Tun Sie dasselbe f&uuml;r die Mappe Toyota. </li>
<li> Markieren Sie Spalte C in Ihrer Arbeitsmappe Honda und klicken Sie auf die Schaltfl&auml;che <b>Punktdiagramm</b> <a  class="image"><img alt="Button Scatter Plot.png" src="../images/How_to_Handle_Repetitive_Tasks/Button_Scatter_Plot.png" width="25"  /></a> auf der Symbolleiste 2D-Grafiken. Tun Sie dasselbe f&uuml;r die Mappe Toyota. Dadurch erhalten Sie zwei Zeichnungen von Power vs Engine Displacement, eine f&uuml;r Honda, eine f&uuml;r Toyota.</li>
<li> Klicken Sie auf die Zeichnung f&uuml;r Honda und w&auml;hlen Sie <b>Analyse: Anpassen: Linearer Fit</b>. &Uuml;bernehmen Sie die Standardeinstellungen des Dialogs und klicken Sie auf <b>OK</b>. Tun Sie dasselbe f&uuml;r die Zeichnung von Toyota. Es wird eine lineare Anpassung f&uuml;r beide Datens&auml;tze durchgef&uuml;hrt und f&uuml;r beide jeweils ein Analyseberichtsblatt erstellt.</li>
<li> Vergleichen Sie die Anpassungsergebnisse f&uuml;r die zwei Automobilhersteller.</li></ol>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/How_to_Handle_Repetitive_Tasks/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn sich ein Datenfilter auf einer Spalte befindet, die f&uuml;r eine Analyseoperation eingegeben wird, werden die gefilterten Daten (verborgene Zeilen) standardm&auml;&szlig;ig in der Analyse ignoriert. Um verborgene Zeilen einzuschlie&szlig;en, klicken Sie auf das Symbol eines Analyseschlosses und setzen Sie <b>Verborgene Zeilen ignorieren</b> = <i>Nein</i>.</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG Ignore Hidden Rows ShortMenu.png" src="../images/How_to_Handle_Repetitive_Tasks/UG_Ignore_Hidden_Rows_ShortMenu.png" width="338"  /></a></dd></dl></dd></dl>
</td></tr></table>
<h2><a name="Automating_Tasks_Using_Programming"></a><span class="mw-headline">Aufgaben mit Hilfe von Programmierung automatisieren</span></h2>
<p><span class="OIndex" style="display:none">In Origin programmieren</span></p><p>Zus&auml;tzlich zu den oben erw&auml;hnten Methoden zum Automatisieren von Aufgaben <span class="OIndex" style="display:none">Automatisieren von Origin</span> mit Hilfe der Benutzeroberfl&auml;che, k&ouml;nnen Sie auch programmatisch auf Funktionen der grafischen Darstellung und Analyse zugreifen, entweder &uuml;ber die Programmiersprache <b>LabTalk</b>, &uuml;ber <b>Origin C</b> oder &uuml;ber <b>Python</b> (intern oder extern). Der Zugriff auf Diagrammdesigns und -vorlagen und Analysevorlagen kann programmiert werden. Sie k&ouml;nnen einige dieser Verfahren manuell einrichten, indem Sie zuerst die Vorlagen (Diagrammvorlagen, Analysevorlagen™ etc.) mit Hilfe der grafischen Benutzeroberfl&auml;che erstellen und dann Ihren Code schreiben, mit dem die entsprechenden Vorlagen nach Bedarf aufgerufen werden.</p><p>Das <a href="../../GettingStarted/OriginLab/Programming_in_Origin.html" title="OriginLab:Programming in Origin">Kapitel zum Programmieren</a> in diesem Handbuch verhilft Ihnen zu einem &Uuml;berblick &uuml;ber die in Origin verf&uuml;gbaren Programmierungsoptionen. Links zu tiefer gehenden Informationen zum Thema Programmierung finden sich ebenfalls in diesem Kapitel.</p>
<h2><a name="Topics_for_Further_Reading"></a><span class="mw-headline">Weiterf&uuml;hrende Themen</span></h2>
<ul><li> <a class="external text" href="../../UserGuide/UserGuide/Recalculating_Analysis_Results.html">Neuberechnung der Analyseergebnisse bei Daten- oder Parameter&auml;nderung</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Dialog_Themes.html">Einstellungen von Analysedialogen als Design speichern</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Theme_Organizer.html#The_Dialog_Themes_Tab">Designs verwalten, Dialogdesigns</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Analysis_Templates.html">Analysevorlagen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Batch_Processing.html">Stapelverarbeitung und Analysevorlagen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Copy_Paste_Operation.html">Operationen kopieren und einf&uuml;gen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Data_Filter.html">Datenfilter f&uuml;r verschiedene Ansichten der Daten verwenden</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Analysis_Report_Sheets_and_Columns.html">Analyseberichtsbl&auml;tter und -spalten</a></li>
<li> <a class="external text" href="http://www.originlab.com/doc/Tutorials/Batch-Processing" target="_blank">Tutorial: Stapelverarbeitung</a></li>
<li> <a class="external text" href="http://originlab.com/index.aspx?go=Support/VideoTutorials&amp;ss=chm&amp;pid=1559" target="_blank">Video: Stapelverarbeitung</a></li>
<li> <a class="external text" href="http://www.originlab.com/doc/Tutorials/Combine-QuickPeakGadget-PA" target="_blank">Tutorial: Minitool Peakanalyse mit dem Hilfsmittel Peaks analysieren kombinieren</a></li></ul>



    