<h1 class="firstHeading">Daten importieren</h1><p class='urlname' style='display: none'>Import-Data</p>
<dl><dd><a  class="image"><img alt="Import grand image4 650px.png" src="../images/Import_Data/Import_grand_image4_650px.png" width="801"  /></a></dd></dl>
<p>In Origin 2019b wurde ein neuer Mechanismus f&uuml;r den Datenimport eingef&uuml;hrt, den wir als <b>Datenkonnektoren</b> bezeichnen. Wie der Name andeutet, erstellen Datenkonnektoren eine Verbindung zwischen Ihrem Projekt und einer externen Quelldatei. Die Quelldatei kann lokal sein, sie kann sich auf dem Unternehmensnetzwerk befinden; sie kann sogar auf einem Webserver sein. Beim Speichern des Projekts unterst&uuml;tzen Datenkonnektoren Optionen zum Ausschlie&szlig;en von importierten Daten (kleinere Dateien unterhalten au&szlig;erdem einen Live-Verbindung zu den Quelldaten). Dies dient auch dem Schutz der Daten gegen versehentliches &Auml;ndern und L&ouml;schen. Datenkonnektoren unterst&uuml;tzen den Import der zuvor nicht verf&uuml;gbaren Datenquellen, einschlie&szlig;lich n <b>HTML-Tabellen</b> und <b>JavaScript Object Notation (JSON)</b>. Datenkonnektoren unterst&uuml;tzen <b>Drag&amp;Drop</b> und <b>Automatisch Importieren beim &Ouml;ffnen des Projekts</b>. Zus&auml;tzlich f&auml;hrt OriginLab damit fort, die Unterst&uuml;tzung f&uuml;r Konnektoren auf neue Datenformate zu erweitern. In <b>Origin 2021b</b> wurden zum Beispiel die Konnektoren f&uuml;r Dateien des Formats <b>National Instruments TDMS</b> und <b>NetCDF</b> verbessert; au&szlig;erdem wurde ein neuer Konnektor f&uuml;r Dateien des Formats <b>Thermo Fisher Scientific MSRawFile</b> hinzugef&uuml;gt.</p><p><br /> <i><b>Weitere unterst&uuml;tzte Importmechanismen:</b></i></p>
<ul><li> OriginLab unterst&uuml;tzt weiterhin Origins langj&auml;hrige Kombination von <b>X-Funktion + filterbasierte Routinen</b> f&uuml;r ASCII-, CSV-, Excel-, Bin&auml;rdateien und vielen Drittanbieterformaten, einschlie&szlig;lich MATLAB, pClamp, NI TDM und NetCDF. Wenn Sie ein Langzeitanwender sind und Importfilter und -designs besitzen, mit denen Sie schon lange arbeiten, sollten diese wie immer funktionieren.</li>
<li> <b>Kopieren-Einf&uuml;gen</b> Eignet sich f&uuml;r einen schnellen Import von einfach strukturierten Daten (am n&uuml;tzlichsten zum Einf&uuml;gen von Daten in Arbeitsbl&auml;tter). </li>
<li> F&uuml;r komplexe ASCII-, bin&auml;re oder benutzerdefinierte Dateitypen k&ouml;nnen Sie die grafische Bedienoberfl&auml;che des <b>Importassistenten</b> verwenden, um Ihre Datei zu analysieren und die Einstellungen in einer Importfilterdatei zu speichern. Der Importassistent unterst&uuml;tzt Funktionen wie das Speichern von Dateimetadaten in Variablen und das Verwenden von benutzerdefinierten Origin-C-Funktionen f&uuml;r die Datenverarbeitung und den Import.</li>
<li> Falls Sie mit <b>SQL</b>-Datenbanken arbeiten, k&ouml;nnen Sie Origins <b>Datenbankkonnektor</b> und die Bedienoberfl&auml;che des <b>SQL-Editors</b> verwenden, um Verbindungszeichenketten und SQL-Abfragen zu erstellen.</li></ul>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#A_Note_to_Upgrade_Users"><span class="tocnumber">1</span> <span class="toctext">Hinweise f&uuml;r Anwender von Upgrades</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Data_Connectors"><span class="tocnumber">2</span> <span class="toctext">Datenkonnektoren</span></a><ul>
<li class="toclevel-2 tocsection-3"><a href="#Things_to_Know_about_Data_Connectors"><span class="tocnumber">2.1</span> <span class="toctext">Informationen zu den Datenkonnektoren</span></a></li>
<li class="toclevel-2 tocsection-4"><a href="#Data_Source_File_Path"><span class="tocnumber">2.2</span> <span class="toctext">Dateipfad der Datenquelle</span></a></li>
<li class="toclevel-2 tocsection-5"><a href="#Data_Navigator"><span class="tocnumber">2.3</span> <span class="toctext">Datennavigator</span></a></li>
<li class="toclevel-2 tocsection-6"><a href="#Data_Connectors_and_Drag-and-Drop"><span class="tocnumber">2,4</span> <span class="toctext">Datenkonnektoren und Drag&amp;Drop</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-7"><a href="#Connecting_to_Text.2FCSV"><span class="tocnumber">3</span> <span class="toctext">Mit Text/CSV verbinden</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#Connecting_to_MATLAB_Files"><span class="tocnumber">4</span> <span class="toctext">Mit MATLAB-Dateien verbinden</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#Connecting_to_NetCDF_and_Shapefiles"><span class="tocnumber">5</span> <span class="toctext">Mit NetCDF und Shapefiles verbinden</span></a></li>
<li class="toclevel-1 tocsection-10"><a href="#Connecting_to_a_Cloud_Drive"><span class="tocnumber">6</span> <span class="toctext">Mit einer Cloud verbinden</span></a></li>
<li class="toclevel-1 tocsection-11"><a href="#Working_with_Excel_Data"><span class="tocnumber">7</span> <span class="toctext">Mit Excel-Daten arbeiten</span></a><ul>
<li class="toclevel-2 tocsection-12"><a href="#Connecting_to_Excel_Files"><span class="tocnumber">7.1</span> <span class="toctext">Mit Excel-Dateien verbinden</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-13"><a href="#Import_from_File"><span class="tocnumber">8</span> <span class="toctext">Aus Dateien importieren</span></a><ul>
<li class="toclevel-2 tocsection-14"><a href="#Importing_ASCII_Files_with_impASC"><span class="tocnumber">8.1</span> <span class="toctext">ASCII-Dateien mit impASC importieren</span></a></li>
<li class="toclevel-2 tocsection-15"><a href="#Saving_Import_Settings"><span class="tocnumber">8.2</span> <span class="toctext">Importeinstellungen speichern</span></a></li>
<li class="toclevel-2 tocsection-16"><a href="#Third_Party_Formats"><span class="tocnumber">8,3</span> <span class="toctext">Drittanbieterformate</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-17"><a href="#The_Import_Wizard"><span class="tocnumber">9</span> <span class="toctext">Der Importassistent</span></a></li>
<li class="toclevel-1 tocsection-18"><a href="#Copy.2FPaste_the_Clipboard_Data"><span class="tocnumber">10</span> <span class="toctext">Daten der Zwischenablage kopieren/einf&uuml;gen</span></a></li>
<li class="toclevel-1 tocsection-19"><a href="#Selectively_Import_Data_by_Querying_an_Origin_File"><span class="tocnumber">11</span> <span class="toctext">Daten selektiv durch Abfrage einer Origin-Datei importieren</span></a></li>
<li class="toclevel-1 tocsection-20"><a href="#Database"><span class="tocnumber">12</span> <span class="toctext">Datenbank</span></a></li>
<li class="toclevel-1 tocsection-21"><a href="#Digitizer"><span class="tocnumber">13</span> <span class="toctext">Digitalisierer</span></a></li>
<li class="toclevel-1 tocsection-22"><a href="#Saving_Origin_Files_without_Imported_Data"><span class="tocnumber">14</span> <span class="toctext">Origin-Dateien ohne importierten Daten speichern</span></a></li>
<li class="toclevel-1 tocsection-23"><a href="#Re-Importing_Data_Files"><span class="tocnumber">15</span> <span class="toctext">Erneutes Importieren von Datendateien</span></a></li>
<li class="toclevel-1 tocsection-24"><a href="#Clone_Import"><span class="tocnumber">16</span> <span class="toctext">Import klonen</span></a></li>
<li class="toclevel-1 tocsection-25"><a href="#Topics_for_Further_Reading"><span class="tocnumber">17</span> <span class="toctext">Weiterf&uuml;hrende Themen</span></a></li>
</ul>
</div>

<h2><a name="A_Note_to_Upgrade_Users"></a><span class="mw-headline">Hinweise f&uuml;r Anwender von Upgrades</span></h2>
<p>Langj&auml;hrige Origin-Anwender, die ein Upgrade von einer der &auml;lteren Versionen durchf&uuml;hren, sollten beachten, dass die Importfunktionen k&uuml;rzlich vom Men&uuml; <b>Datei</b> zu dem neuen Men&uuml; <b>Daten</b> verschoben wurden. Hier finden Sie auch Origins neueste Hilfsmittel f&uuml;r den Datenimport: <b>Datenkonnektoren</b>.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Import fF Moved.png" src="../images/Import_Data/Import_fF_Moved.png" width="622"  /></a></dd></dl></dd></dl>
<h2><a name="Data_Connectors"></a><span class="mw-headline">Datenkonnektoren</span></h2>
<dl><dd><dl><dd><a  class="image"><img alt="Data Connector General Concept.png" src="../images/Import_Data/Data_Connector_General_Concept.png" width="687"  /></a></dd></dl></dd></dl>
<p><b>Datenkonnektoren</b> stellen einen allgemeinen Mechanismus zum Importieren von Daten aus <i>lokalen</i> oder <i>webbasierten</i> Dateien und Seiten in Ihre Origin-Projekte dar. Datenkonnektoren unterscheiden sich von &auml;lteren Origin-Importmethoden haupts&auml;chlich durch zwei (modifizierbare) Standardverhalten:</p>
<ul><li> Daten, die &uuml;ber Datenkonnektoren importiert werden, sind f&uuml;r die Bearbeitung  <a class="external text" href="../../UserGuide/Category/Data_Connector.html#Data_Integrity"><i>gesperrt</i></a>. Dies unterst&uuml;tzt bei der Sicherstellung der Datenintegrit&auml;t.</li>
<li> Daten, die &uuml;ber Konnektor importiert wurden, werden <a class="external text" href="../../UserGuide/Category/Data_Connector.html#Excluding_or_Saving_Imported_Data"><i>nicht mit dem Projekt gespeichert</i></a>. Dadurch bleiben Ihre Projektdateien kleiner.</li></ul>
<p><br /> Datenkonnektoren unterst&uuml;tzen eine Reihe von g&auml;ngigen Datenformaten, einschlie&szlig;lich:</p>
<ul><li> <b>Text/CSV</b></li>
<li> <b>Excel</b></li>
<li> <b>Origin-Datei</b> (Projekt, Arbeitsmappe, Matrix)</li>
<li> <b>MATLAB</b></li>
<li> <b>JavaScript Object Notation (JSON)</b></li>
<li> <b>HDF</b></li>
<li> <b>TDMS</b></li>
<li> <b>HTML-Tabelle</b></li>
<li> <b>Importfilter</b> (Verwendung eines <a class="external text" href="../../UserGuide/Category/Importing_Data_by_Drag_and_Drop.html#Origin_Import_Filters">benutzerdefinierten Importfilters</a> mit Datenkonnektor) </li>
<li> <b>Shapefile</b></li>
<li> <b>NetCDF</b></li>
<li> <b>XML</b></li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tip_icon.png" width="57"  border="0" /></td><td><p>Um eine Verbindung zur <b>SQL</b>-Datenbank herzustellen, siehe <a href="#Database"><b>Datenbank</b></a>.</p></td></tr></table>
<p><br /> <i><b>Um Daten mit einem Datenkonnektor zu importieren:</b></i></p>
<ol><li> Klicken Sie bei aktiver Arbeitsmappe auf das Men&uuml; <b>Daten</b>. </li></ol>
<dl><dd><ul><li> Wenn Sie eine Verbindung zu einer lokalen Datei oder einer Datei im Netzwerk herstellen m&ouml;chten, w&auml;hlen Sie <b>Mit Datei verbinden</b> und w&auml;hlen Sie einen Dateityp. </li>
<li> Um eine Verbindung zu mehreren Dateien herzustellen, klicken Sie auf <b>Mit mehreren Dateien verbinden</b>. </li>
<li> Wenn Sie eine Verbindung zu Webdaten herstellen m&ouml;chten, klicken Sie auf <b>Mit Web verbinden</b> und geben Sie eine URL ein.</li></ul></dd></dl>
<h3><a name="Things_to_Know_about_Data_Connectors"></a><span class="mw-headline">Informationen zu den Datenkonnektoren</span></h3>
<ul><li> Per Standard, wenn die Dateigr&ouml;&szlig;e der Importdaten 500kB &uuml;berschreitet, werden die importierten Daten und die Diagramme, die aus diesen Daten erstellt werden, NICHT mit der Origin-Datei gespeichert (siehe LabTalk-Systemvariable <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#F.2CG"><b>@FSE</b></a>). Alle Analyseausgaben, die sich aus den importierten Daten ergeben, WERDEN mit der Origin-Datei gespeichert. Bei der Arbeit mit gro&szlig;en Projekten kann das Nichtspeichern der Rohdaten mit Ihrer Projektdatei kann in betr&auml;chtlichem Ma&szlig;e die Dateigr&ouml;&szlig;e reduzieren und die Leistung verbessern.</li>
<li> <b>WICHTIG</b>: Da &uuml;ber Konnektor importierte Daten (&gt; 500 kB) standardm&auml;&szlig;ig NICHT mit der Projektdatei gespeichert werden, sollten Anwender sich immer fragen, ob sie die importierten Daten aufheben m&uuml;ssen. Dies ist insbesondere wahr, wenn die Datenquelle webbasiert und an einer Stelle jenseits Ihrer Kontrolle gespeichert ist. Sollten Sie es vorziehen, alle Daten, die &uuml;ber einen Datenkonnektor importiert wurden, mit Ihrer Origin-Datei zu speichern, klicken Sie auf das Symbol des Datenkonnektors und entfernen Sie das H&auml;kchen neben <b>Importierte Daten beim Speichern ausschlie&szlig;en</b>, bevor Sie Ihre Datei speichern<strong><sup>&dagger;</sup></strong>. Beachten Sie, dass jede Mappe, die einen Datenkonnektor enth&auml;lt, ihr eigenes H&auml;kchen zum <b>Ausschlie&szlig;en...</b> hat. Falls Sie sich alternativ entscheiden, dass Sie keine Datenkonnektoren brauchen, k&ouml;nnen Sie auf das Symbol Datenkonnektor klicken und <b>Datenkonnektor entfernen</b> (aus dieser Mappe) oder <b>Datenkonnektoren aus allen Mappen entfernen</b> (im Projekt) w&auml;hlen.</li>
<li> Daten k&ouml;nnen jederzeit neu importiert werden, indem Sie auf das Symbol des Datenkonnektors (<a  class="image"><img alt="DC Icon DataMod.png" src="../images/Import_Data/DC_Icon_DataMod.png" width="18"  /></a> oder <a  class="image"><img alt="DC Icon Live.png" src="../images/Import_Data/DC_Icon_Live.png" width="18"  /></a>) in der oberen linken Ecke der Arbeitsmappe klicken und <b>Importieren</b> (<b>Strg+4</b>) oder <b>Alle importieren</b> w&auml;hlen. </li>
<li> Daten, die &uuml;ber Datenkonnektoren importiert werden, sind f&uuml;r die Bearbeitung standardm&auml;&szlig;ig gesperrt. Sie k&ouml;nnen sie grafisch darstellen und sie analysieren, aber Sie k&ouml;nnen sie nicht modifizieren. Dies ist eine Absicherung gegen versehentliche &Auml;ndern der Daten, die aber einige Anwender als zu einschr&auml;nkend empfinden. Entsperren Sie Daten, indem Sie auf das Konnektorsymbol klicken und die Option <b>Importierte Daten entsperren</b> w&auml;hlen. Lesen Sie in <a class="external text" href="../../QuickHelp/QuickHelp/How_to_allow_changing_data_when_data_connector_is_used.html">dieser FAQ</a> Informationen zum Entfernen von Bearbeitungseinschr&auml;nkungen f&uuml;r Daten, die mit einem Konnektor importiert wurden.</li>
<li> Eine Arbeitsmappe kann nur <i>einen Konnektortyp</i> haben (z. B. Text/CSV). F&uuml;r Dateien mit einer einfachen Struktur wie Text/CSV k&ouml;nnen Sie mehrere Bl&auml;tter mit mehreren separaten Dateien verbinden, solange sie denselben Konnektor teilen. F&uuml;r Dateien mit komplexeren Strukturen wie Excel oder MATLAB stellen Sie anfangs eine Verbindung zu einem Blatt/einer Variable her. Dann verwenden Sie den Befehl <b>Blatt/Bl&auml;tter hinzuf&uuml;gen und verbinden</b> im Kontextmen&uuml; vom <a href="../../GettingStarted/OriginLab/Import_Data.html#Data_Navigator" title="OriginLab:Import Data">Datennavigator</a>, um weitere Bl&auml;tter /Variablen in der Mappe hinzuzuf&uuml;gen. Sie k&ouml;nnen nur eine einzelne Excel- oder MATLAB-Datei mit einer einzelnen Origin-Arbeitsmappe oder Matrixmappe verbinden.</li>
<li> In Mappen, die Dateien mit einer einfachen Struktur enthalten (z. B. CSV) wird das Blatt mit einem leeren Konnektor hinzugef&uuml;gt, wenn Sie mit der rechten Maustaste auf einen Blattreiter klicken und ein neues Blatt hinzuf&uuml;gen. Der nicht verbundene Zustand wird durch ein hellgelbes Symbol f&uuml;r den Konnektor <a  class="image"><img alt="DC Icon Empty.png" src="../images/Import_Data/DC_Icon_Empty.png" width="18"  /></a> gekennzeichnet (siehe <a href="#Data_Source_File_Path">Konnektorzust&auml;nde unten</a>). Klicken Sie auf ein Konnektorsymbol, um ein Kontextmen&uuml; zu &ouml;ffnen, in dem Sie das Blatt mit einer Datenquelle verbinden k&ouml;nnen.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="Data Connector Shortcut Menu.png" src="../images/Import_Data/Data_Connector_Shortcut_Menu.png" width="479"  /></a></dd></dl></dd></dl>
<ul><li> Datenkonnektoren, die Sie nicht verwenden, k&ouml;nnen verborgen werden, indem Sie <b>Daten: Mit Datei verbinden: Benutzerdefiniert anpassen ...</b> w&auml;hlen und das Kontrollk&auml;stchen neben den nicht verwendeten Konnektoren deaktivieren.</li>
<li> Datenkonnektoren f&uuml;r Dateiformate, die nicht mit Origin ausgeliefert werden, sind &uuml;ber <b>Daten: Mit Datei verbinden: Neu hinzuf&uuml;gen ...</b> verf&uuml;gbar. Neue Datenkonnektoren werden zum Men&uuml; <b>Daten</b> hinzugef&uuml;gt.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="UG data connector add new.png" src="../images/Import_Data/UG_data_connector_add_new.png" width="403"  /></a></dd></dl></dd></dl>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Alert_icon.png" width="57"  border="0" /></td><td><p><strong><sup>&dagger;</sup></strong>Origin speichert Daten, die &uuml;ber <b>Daten: Mit Web verbinden</b> importiert wurden, f&uuml;r einen Zeitraum im Zwischenspeicher. Dieser Zeitraum wird von der LabTalk-Systemvariable <b>@CFDT</b> plus der Dateigr&ouml;&szlig;e bestimmt. Per Standard verwendet eine Datei von 10 MB zwischengespeicherte Daten f&uuml;r ~24 h. Mit anderen Worten, wenn Sie innerhalb von 24 Stunden einen erneuten Import durchf&uuml;hren (d. h. eine neue Verbindung zur Webdatei herstellen), verwenden Sie Daten, die sich vom ersten Import noch im Zwischenspeicher befinden. Wenn Sie einen erneuten Import dieser 10-MB-Datei nach Ablauf von 24 Stunden durchf&uuml;hren, wurde der Zwischenspeicher gel&ouml;scht und die Daten werden frisch importiert. Um zu erfahren, wie Sie dieses Zwischenspeicherverhalten steuern, lesen Sie diese Themen:</p>
<ul><li> <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#C">LabTalk-Systemvariable <b>@CFDT</b></a></li>
<li> <a class="external text" href="../../LabTalk/LabTalk/Delete_(command).html">Der LabTalk-Befehl <b>delete -web</b></a> </li></ul>
	</td>
	</tr>
	</table>
<h3><a name="Data_Source_File_Path"></a><span class="mw-headline">Dateipfad der Datenquelle</span></h3>
<p>Ein Datenkonnektorsymbol wird in f&uuml;nf Zust&auml;nden angezeigt:</p>
<ul><li> Wenn die Datenquelle verbunden ist, sieht das Symbol folgenderma&szlig;en aus: <a  class="image"><img alt="DC Icon Live.png" src="../images/Import_Data/DC_Icon_Live.png" width="18"  /></a></li>
<li> Wenn die Daten im Blatt f&uuml;r die Bearbeitung gesperrt sind (entweder &uuml;ber das <a href="#Data_Connectors">Men&uuml; Konnektor</a> oder <a class="external text" href="../../QuickHelp/QuickHelp/How_to_allow_changing_data_when_data_connector_is_used.html"><b>@IPDC=0</b></a>), sieht das Symbol folgenderma&szlig;en aus: <a  class="image"><img alt="DC Icon Unlocked.png" src="../images/Import_Data/DC_Icon_Unlocked.png" width="18"  /></a></li>
<li> Wenn der Import von einer Datenquelle ausstehend ist, sieht das Symbol folgenderma&szlig;en aus: <a  class="image"><img alt="DC Icon DataMod.png" src="../images/Import_Data/DC_Icon_DataMod.png" width="18"  /></a></li>
<li> Wenn ein neues Blatt zu einer verbundenen Mappe hinzugef&uuml;gt wurde, wird ein leerer Datenkonnektor zum Blatt hinzugef&uuml;gt und das Symbol sieht folgenderma&szlig;en aus: <a  class="image"><img alt="DC Icon Empty.png" src="../images/Import_Data/DC_Icon_Empty.png" width="18"  /></a></li>
<li> Wenn die Datenquelle nicht mehr zur Verf&uuml;gung steht (die Datenquelle wurde z. B. verschoben), sieht das Symbol folgenderma&szlig;en aus: <a  class="image"><img alt="DC Icon Broken.png" src="../images/Import_Data/DC_Icon_Broken.png" width="18"  /></a></li>
<li> Wenn das Blatt vor Bearbeitungen aller Art gesch&uuml;tzt ist (<a href="../../GettingStarted/OriginLab/Workbooks_Worksheets_Columns.html#Protecting_Worksheet_Data" title="OriginLab:Workbooks Worksheets Columns">Arbeitsblattschutz</a>), ist das Konnektormen&uuml; deaktiviert und die Symbole sehen folgenderma&szlig;en aus:<a  class="image"><img alt="DC icon disabled.png" src="../images/Import_Data/DC_icon_disabled.png" width="18"  /></a></li></ul>
<p><br /> Unabh&auml;ngig vom Verbindungsstatus k&ouml;nnen Sie auf das Konnektorsymbol klicken. Verwenden Sie dann den <b>Dateipfad der Datenquelle</b> und den <b>Allgemeinen Datenpfad</b>, damit die Verbindung zwischen Ihren Origin-Dateien und Quelldaten erhalten bleibt.</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG Common Data Path Dialogs.png" src="../images/Import_Data/UG_Common_Data_Path_Dialogs.png" width="742"  /></a></dd></dl></dd></dl>
<ul><li> <b>Relativ zum Projektpfad</b>: Wenn Ihre Daten in Ordnern unter der Projektdatei gespeichert werden, k&ouml;nnten Sie den Dateipfad der Datenquelle auf <b>Relativ zum Projektpfad</b> setzen. Sie k&ouml;nnen das Projekt und die Datenquellen zusammen verschieben. Ihre relativen Pfade werden bewahrt. Es sind keine Pfadkorrekturen erforderlich, wenn Sie die Projektdatei von einer anderen Stelle in Ihrem Netzwerk erneut &ouml;ffnen. </li>
<li> <b>Relativ zum allgemeinen Datenpfad</b>: Wenn die Datenquellen sich unter einem allgemeinen Pfad befinden, k&ouml;nnten Sie den Dateipfad der Datenquelle auf <b>Relativ zum allgemeinen Datenpfad</b> setzen. Wenn die Dateien in der Folge verschoben werden, k&ouml;nnen Sie den <b>Allgemeinen Datenpfad</b> und dann <b>Alle Mappe importieren</b> erneut einrichten.</li></ul>
<h3><a name="Data_Navigator"></a><span class="mw-headline">Datennavigator</span></h3>
<p>Der <b>Datennavigator</b> ist ein minimierbares Bedienfeld, das automatisch zur Arbeitsmappe hinzugef&uuml;gt wird, wenn Sie eine Verbindung zu Dateien mit mehreren Seiten/Variablen wie Excel, MATLAB oder Origin-Projekte herstellen.</p>
<dl><dd><a  class="image"><img alt="UG data navigator overview.png" src="../images/Import_Data/UG_data_navigator_overview.png" width="716"  /></a></dd></dl>
<ul><li> Origin importiert die Daten aus dem ersten Blatt und listet weitere Bl&auml;tter in abgeblendeter Weise auf.</li>
<li> Klicken Sie mit der rechten Maustaste auf ein abgeblendetes Blatt -- oder dr&uuml;cken Sie STRG oder SHIFT und w&auml;hlen Sie mehrere Bl&auml;tter -- und w&auml;hlen Sie <b>Bl&auml;tter hinzuf&uuml;gen und verbinden</b>.</li>
<li> Der Dateiname wird dem <b>Langnamen</b> der Mappe zugewiesen und der urspr&uuml;ngliche Blattname wird dem <b>Namen</b> des Blatts zugewiesen.</li>
<li> Verbundene Bl&auml;tter k&ouml;nnen aus der aktuellen Origin-Arbeitsmappe gel&ouml;scht werden.</li></ul>
<h3><a name="Data_Connectors_and_Drag-and-Drop"></a><span class="mw-headline">Datenkonnektoren und Drag&amp;Drop</span></h3>
<p>F&uuml;r die Dateitypen, die unter <b>Daten: Mit Datei verbinden</b> aufgef&uuml;hrt sind, wird Drag&amp;Drop unterst&uuml;tzt.</p>
<ul><li> Bei Dateien mit einer einfachen Headerinformation (z. B. nur Spaltenname und Einheiten), wird ein Datenkonnektor hinzugef&uuml;gt und die Datei wird ohne einen Importfilter ordentlich geparst.</li>
<li> Bei Dateien, die nicht ordentlich geparst werden (d. h. die Headerinformation endet im Datenteil des Arbeitsblatt), erw&auml;gen Sie, einen <a class="external text" href="../../UserGuide/UserGuide/Import_Wizard_Save_Filters_Page_(All_Data_Types).html">Origin-Importfilter (*.oif)</a> mit Hilfe des <a href="#The_Import_Wizard">Importassistenten</a> zu erstellen.</li>
<li> Importfilter k&ouml;nnen im Datendateiordner, im Ordner Anwenderdateien\Filters oder im aktuellen Fenster gespeichert werden. Wenn Sie beabsichtigen, eine <a class="external text" href="../../UserGuide/UserGuide/Basic_Child_Window_Operations.html#Saving_a_window_to_a_file">Vorlage</a> f&uuml;r Ihren Datenimport zu verwenden, k&ouml;nnen Sie den Filter im Fenster speichern. Ansonsten sollte die Filterdatei (*.oif) entweder im Datendateiordner oder im Ordner \Anwenderdateien\Filters abgelegt werden.</li></ul>
<h2><a name="Connecting_to_Text.2FCSV"></a><span class="mw-headline">Mit Text/CSV verbinden</span></h2>
<p><span class="OIndex" style="display:none">CSV-Dateien</span></p><p>Sie k&ouml;nnen einen Datenkonnektor verwenden, um lokale oder im Web gespeicherte Textdateien (TXT, DAT, CSV) zu importieren. Die Datenkonnektormethoden funktionieren gut f&uuml;r diese Dateitypen. Sie vereinfachen und in manchen F&auml;lle beheben eininge der Probleme, die mit Origins &auml;lteren auf  X-Funktionen basierenden Importroutinen im Zusammenhang stehen. Der Import von Datums-/Zeitdaten erfordert zum Beispiel immer die <a class="external text" href="../../UserGuide/UserGuide/Dates_and_Times_in_the_Worksheet.html">manuelle Konfiguration von Datums-/Zeitdaten</a>. Wenn Sie Datenkonnektoren verwenden, wird diese Konfiguration automatisch f&uuml;r Sie &uuml;bernommen, wenn Ihre Datums-/Zeitdaten einem leicht erkennbaren Standardformat entsprechen.</p><p><br /> <i><b>Um eine Verbindung zu einer Datei auf einem lokalen oder LAN-Netzwerk herzustellen:</b></i></p>
<ol><li> W&auml;hlen Sie bei aktiver Arbeitsmappe <b>Daten: Mit Datei verbinden: Text/CSV</b>. </li>
<li> Suchen Sie nach Ihrer Datei und w&auml;hlen Sie sie aus.</li>
<li> Legen Sie Ihre <b>CSV-Importoptionen</b> fest. In vielen F&auml;llen k&ouml;nnen Sie einfach die Standardwerte &uuml;bernehmen und Ihre Datei wird sauber importiert. Versuchen Sie testweise, Daten ohne &Auml;ndern der Standardwerte zu importieren. Wenn die Ergebnisse nicht befriedigend sind, f&uuml;hren Sie den Import erneut aus und &auml;ndern Sie die Standardeinstellungen. Klicken Sie auf die Schaltfl&auml;che <b>Weitere Optionen</b> (links von <b>OK</b>) f&uuml;r weitere Optionen.</li></ol>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p>In diesem Kurztutorial verwenden wir den <b>Text/CSV-Konnektor</b>, um eine Textdatei mit einer Datums-/Zeitkomponente zu importieren. W&auml;hrend &auml;ltere Origin-Importmethoden die Datums-/Zeitdaten als Text behandelten und Anwender die Datums-/Zeitspalte nach dem Import manuell auf Datum setzen mussten, kann der Text/CSV-Konnektor die Arbeitsblattspalte automatisch beim Import konfigurieren.</p>
<ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Neue Arbeitsmappe</b> <a  class="image"><img alt="Button New Workbook.png" src="../images/Import_Data/Button_New_Workbook.png" width="23"  /></a> und w&auml;hlen Sie <b>Daten: Mit Datei verbinden: Text/CSV</b>.</li>
<li> Navigieren Sie zu &lt;<i>Origin-Programmordner</i>&gt;\Samples\Import and Export\  und &ouml;ffnen Sie die Datei Date with higher precision.dat.</li>
<li> &Uuml;bernehmen Sie alle Standardeinstellungen im Dialog <b>CSV-Importoptionen</b> und klicken Sie auf <b>OK</b>. Die Daten werden in die Arbeitsmappe importiert.</li>
<li> Klicken Sie auf die Spalten&uuml;berschrift<i>A</i>, um die Spalte zu markieren, klicken Sie mit der rechten Maustaste und w&auml;hlen Sie <b>Einstellungen</b>. Beachten Sie, dass <b>Format</b> automatisch auf <i>Datum</i> und <b>Anzeige</b> auf <i>Benutzerdefinierte Anzeige</i> gesetzt wurde und dass ein benutzerdefiniertes Format in <b>Benutzerdefinierte Anzeige</b> gezeigt wird.</li></ol>
<dl><dd><a  class="image"><img alt="Import custom date time.png" src="../images/Import_Data/Import_custom_date_time.png" width="628"  /></a></dd></dl>
</td></tr></table>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p>In diesem Kurztutorial verwenden wir einen Datenkonnektor, um mehrere Dateien zu importieren. Diese Dateien mit identischen Strukturen haben mehrere Zeilen mit Metadaten, die wir bewahren m&ouml;chten. Sie verwenden daher eine Importfilterdatei, die <a class="external text" href="../../Tutorial/Tutorial/Import_Wizard.html">mit dem Importassistenten entwickelt wurde</a>, um  die Dateien zu importieren und die Metadaten f&uuml;r mehrere <a class="external text" href="../../UserGuide/UserGuide/Displaying_Supporting_Data_in_Worksheet_Header_Rows.html">Spaltenbeschriftungszeilen</a> in jedem Arbeitsblatt zu schreiben. Sie werden sehen, (a) wie mehrere Dateien mit Hilfe eines Datenkonnektors importiert werden und (b) wie Sie eine <a class="external text" href="../../UserGuide/Category/Importing_Data_by_Drag_and_Drop.html#Origin_Import_Filters">Importfilterdatei (*.oif)</a> verwenden, die mit einer &auml;lteren Version von Origin entwickelt wurde, um Dateien mit Hilfe von Origins neuer Technologie der Datenkonnektoren zu importieren.</p>
<ol><li> &Ouml;ffnen Sie ein neues Projekt und w&auml;hlen Sie bei aktiver Arbeitsmappe <b>Daten: Mehrere Dateien verbinden</b>.</li>
<li> Legen Sie im Dialog <b>files2dc</b> Folgendes fest:<ul><li> <b>Datenkonnektor</b> = <i>Importfilter</i></li>
<li> <b>Quelle</b> = <i>Festgelegte Dateien</i></li>
<li> <b>Dateinamen</b> = <i>&lt;Origin-Programmordner&gt;</i>\Samples\Import and Export\S15-125-03.dat, S21-235-07.dat und S32-014-04.dat</li>
<li> <b>Gleiche Mappe</b> = aktiviert (Aktivieren des Kontrollk&auml;stchens holt alle Dateien in eine Mappe.)</li></ul></li>
<li> Klicken Sie auf <b>OK</b> und setzen Sie im aufgerufenen Dialog den <b>Importfilter</b> = Datenordner: VarsFromFileNameAndHeader.oif</li>
<li> Klicken Sie auf <b>OK</b>. Die drei Dateien werden als separate Bl&auml;tter in die Arbeitsmappe importiert.</li></ol>
</td></tr></table>
<p><br /> <i><b>Um eine Verbindung zu einer Datei im Web herzustellen:</b></i></p>
<ol><li> W&auml;hlen Sie <b>Daten: Mit Web verbinden</b>.</li>
<li> Wenn Sie eine Datei-URL haben, geben Sie sie in das Feld <b>URL</b> ein. Andernfalls setzen Sie <b>Dateityp</b> auf <i>Text/CSV</i> (optional, aber es hilft die <b>Zuletzt verwendeten URLs</b> zu filtern). Klicken Sie dann direkt auf <b>Zuletzt verwendete URLs</b> und w&auml;hlen Sie auf der Liste.</li></ol>
<dl><dd><a  class="image"><img alt="Connect to web dialog URL.png" src="../images/Import_Data/Connect_to_web_dialog_URL.png" width="668"  /></a></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tip_icon.png" width="57"  border="0" /></td><td><p>Sie k&ouml;nnen den Dialog <b>CSV-Importoptionen</b> verwenden, um einen teilweisen Import der im Web gespeicherten Dateien festzulegen, genauso wie Sie das f&uuml;r lokal gespeicherte Dateien k&ouml;nnen. Aktivieren Sie das Kontrollk&auml;stchen <b>Teilweiser Import</b> f&uuml;r eine Anleitung zur Syntax, die zum Definieren der zu importierenden <b>Spalte</b> und <b>Zeile</b> verwendet wird.</p></td></tr></table>
<table class="note">

<tr>
<td> <b>Hinweis:</b> Weitere Informationen zum Arbeiten mit Text/CSV-Daten finden Sie in der Origin-Hilfe:<p><b>Hilfe: Origin: Origin-Hilfe &gt; <a class="external text" href="../../UserGuide/UserGuide/Connecting_to_File.html#Text.2FCSV_Connector">Text/CSV-Konnektor</a></b></p>
</td></tr></table>
<h2><a name="Connecting_to_MATLAB_Files"></a><span class="mw-headline">Mit MATLAB-Dateien verbinden</span></h2>
<p>Origin unterst&uuml;tzt weiterhin den &auml;lteren <a href="../../GettingStarted/OriginLab/Import_Data.html#Third_Party_Formats" title="OriginLab:Import Data">auf X-Funktionen basierenden MAT-Dateiimport</a>. Die Datenkonnektoren bieten jedoch einige deutliche Vorteile beim Import von lokal und im Web gespeicherten MATLAB-Dateien:</p>
<ul><li> Durch das Verbinden mit einer MATLAB-Datei auf Root-Ebene werden alle Variablen als Origin-Matrixobjekte in das Matrixblatt eingef&uuml;gt.</li>
<li> Ein Schieber wird hinzugef&uuml;gt, so dass Sie die Origin-Matrixobjekte im Blatt &quot;durchbl&auml;ttern&quot; k&ouml;nnen. Sie k&ouml;nnen zwischen Schieber und Miniaturbildern mit Hilfe der Minisymbolleistenschaltfl&auml;che <b>Schieber oder Miniaturbilder</b> wechseln.</li>
<li> Der Konnektor f&uuml;gt auch einen minimierbaren <a href="../../GettingStarted/OriginLab/Import_Data.html#Data_Navigator" title="OriginLab:Import Data"><b>Datennavigator</b></a> zum Fenster hinzu. Wenn Sie Variablen als einzelne Bl&auml;tter hinzuf&uuml;gen m&ouml;chten, k&ouml;nnen Sie mit der rechten Maustaste auf die Liste des Datennavigators klicken und sie hinzuf&uuml;gen.</li></ul>
<dl><dd><a  class="image"><img alt="UG slider or thumb MAT.png" src="../images/Import_Data/UG_slider_or_thumb_MAT.png" width="773"  /></a></dd></dl>
<p><br /> <i><b>Um eine Verbindung zu einer MATLAB-Datei herzustellen:</b></i></p>
<ol><li> Klicken Sie bei einer aktiven Arbeits- oder Matrixmappe auf <b>Daten: Mit Datei verbinden: MATLAB</b> oder <b>Daten: Mit Web verbinden</b> und geben Sie eine URL in Ihre .mat-Datei ein.</li>
<li> W&auml;hlen Sie die Variablen aus, die Sie importieren m&ouml;chten (f&uuml;gen Sie sie in das untere Bedienfeld des Browsers ein) und klicken Sie auf <b>OK</b>.</li></ol>
<p><br /></p>
<table class="note">

<tr>
<td> <b>Hinweis:</b> Weitere Informationen zum Arbeiten mit dem JSON/MATLAB-Konnektor finden Sie in der Origin-Hilfe:<p><b>Hilfe: Origin: Origin-Hilfe&gt; <a class="external text" href="../../UserGuide/UserGuide/Connecting_to_File.html#JSON.2FMATLAB">JSON/MATLAB</a></b></p>
</td></tr></table>
<h2><a name="Connecting_to_NetCDF_and_Shapefiles"></a><span class="mw-headline">Mit NetCDF und Shapefiles verbinden</span></h2>
<p>Das NetCDF-Dateiformat wird zum Teilen von multidimensionalen wissenschaftlichen Daten verwendet. Das Format ist im Bereich der Klimawissenschaft weit verbreitet. Shapefiles werden h&auml;ufig dazu verwendet, geografische Grenzen und weitere geo-r&auml;umliche Daten zu speichern.</p>
<dl><dd><a  class="image"><img alt="Import NetCDF Image Map.png" src="../images/Import_Data/Import_NetCDF_Image_Map.png" width="799"  /></a></dd></dl>
<p><br /> <i><b>Um eine Verbindung zu einer NetCDF-Datei herzustellen:</b></i></p>
<ol><li> Klicken Sie bei einer aktiven Arbeits- oder Matrixmappe auf <b>Daten: Mit Datei verbinden: NetCDF</b> oder <b>Daten: Mit Web verbinden</b> und geben Sie eine URL in Ihre .nc-Datei ein.</li>
<li> W&auml;hlen Sie die Variablen aus, die Sie importieren m&ouml;chten, indem Sie sie in das untere Bedienfeld des Browsers einf&uuml;gen.</li>
<li> Passen Sie <b>Importoptionen</b> (Schaltfl&auml;che &quot;Stift&quot;) nach Bedarf an und klicken Sie zweimal auf <b>OK</b>.</li>
<li> Wenn eine Arbeitsmappe aktiv ist, aber die Variable eine Matrixmappe erfordert, werden Sie aufgefordert, eine neue Matrixmappe oder eine eingebettete Matrixmappe in die aktive Arbeitsmappe einzuf&uuml;gen.</li></ol>
<p><br /> <i><b>Um eine Verbindung zu einer Shapefile herzustellen:</b></i></p>
<ol><li> W&auml;hlen Sie bei aktiver Arbeits- oder Matrixmappe auf <b>Daten: Mit Datei verbinden: Shapefile</b> und navigieren Sie zu und w&auml;hlen Sie Ihre .shp-Datei.</li>
<li> Legen Sie fest, ob die <b>Attribute geladen</b> und (optional) kodiert und/oder <b>In WGS84 konvertiert</b> werden soll(en), und klicken Sie auf <b>OK</b>.</li></ol>
<table class="note">

<tr>
<td> <b>Hinweis:</b> Weitere Informationen zum Arbeiten mit dem NetCDF-Konnektor finden Sie in der Origin-Hilfe:<p><b>Hilfe: Origin: Origin-Hilfe &gt; <a class="external text" href="../../UserGuide/UserGuide/Connecting_to_File.html#NetCDF">NetCDF-Konnektor</a></b></p>
</td></tr></table>
<h2><a name="Connecting_to_a_Cloud_Drive"></a><span class="mw-headline">Mit einer Cloud verbinden</span></h2>
<p>Sie k&ouml;nnen eine Verbindung zu <b>Origin</b>-, <b>MS-Excel</b>- und <b>ASCII</b>-Dateien, die auf MS OneDrive oder Google Drive gespeichert sind, herstellen. Wenn Sie Ihre Kontozugangsdaten eingerichtet haben, ist das Verbinden mit Cloud-Dateien &auml;hnlich dem Verbinden mit lokalen Dateien:</p>
<ol><li> Klicken Sie bei aktiver Arbeitsmappe auf <b>Daten: Mit Cloud verbinden</b>. Dies &ouml;ffnet den Browser zum Ausw&auml;hlen von Dateien. </li>
<li> Verwenden Sie die Bedienelemente der Auswahlliste des Browsers, um die Cloud-Services oder -Konten ggf. zu wechseln.<dl><dd> <a  class="image"><img alt="Data Connect to Cloud Browser.png" src="../images/Import_Data/Data_Connect_to_Cloud_Browser.png" width="538"  /></a></dd></dl></li>
<li> W&auml;hlen Sie eine Datei und klicken auf <b>&Ouml;ffnen</b>.</li></ol>
<p>Beachten Sie, dass Sie beim ersten Verbinden mit einem Cloud-Konto gebeten werden, dieses Konto zu verifizieren. OriginLabs Zugriff und &Uuml;bertragung von Daten zwischen Ihrem Cloud-Konto und lokalen Computer findet nur mit Hilfe einer tempor&auml;ren Datei statt. Es wird keine weitere Kommunikation von Informationen durchgef&uuml;hrt.</p>
<h2><a name="Working_with_Excel_Data"></a><span class="mw-headline">Mit Excel-Daten arbeiten</span></h2>
<p><span class="OIndex" style="display:none">Excel</span> Zum Arbeiten mit Excel-Daten in Origin haben Sie mehrere Optionen:</p>
<ul><li> Sie k&ouml;nnen Ihre Excel-Daten in die Zwischenablage kopieren und diese Daten in Origin einf&uuml;gen bzw. die Inhalte einf&uuml;gen.</li>
<li> Sie k&ouml;nnen einen <b>Datenkonnektor</b> verwenden, um eine lokale Excel-Datei zu importieren, indem Sie (1) <b>Daten: Mit Datei verbinden: Excel</b> w&auml;hlen, (2) auf die Schaltfl&auml;che <a  class="image"><img alt="Button Import Excel.png" src="../images/Import_Data/Button_Import_Excel.png" width="25"  /></a> auf der Symbolleiste <b>Standard</b> klicken oder (3) Ihre Excel-Datei in den Origin-Arbeitsbereich ziehen. </li>
<li> Sie k&ouml;nnen einen <b>Datenkonnektor</b> verwenden, um Excel-Daten aus dem Web zu importieren, indem Sie <b>Daten: Mit Web verbinden: Excel</b> w&auml;hlen (siehe unten).</li>
<li> Sie k&ouml;nnen Origins &auml;ltere, auf X-Funktionen basierende Routinen verwenden, um eine lokale Excel-Datei zu importieren, indem Sie auf <b>Daten: Aus Datei importieren</b> klicken. Diese Option wurde k&uuml;rzlich verborgen, um den Excel-Konnektor zu f&ouml;rdern. Sollten Sie diese Methode jedoch vorziehen, lesen Sie <a class="external text" href="../../UserGuide/UserGuide/Working_with_Microsoft_Excel.html#Importing_Excel_Data_using_the_impMSExcel_X-Function_Dialog">diesen Abschnitt der <b>Origin-Hilfe</b></a>.</li></ul>
<p><br /> <i><b>Weitere wichtige Informationen:</b></i></p>
<ul><li> Origin importiert Dateien des Typs .xls, .xlsx oder .xlsm. </li>
<li> Wenn Sie Daten mit dem Excel-Konnektor importieren, k&ouml;nnen Sie die Daten von Origins Seite her jederzeit aktualisieren, indem Sie auf das Konnektorsymbol <a  class="image"><img alt="Dadta connector icon connect.png" src="../images/Import_Data/Dadta_connector_icon_connect.png" width="16"  /></a> klicken und <b>Importieren</b> w&auml;hlen. Oder Sie importieren Ihre Excel-Daten in dem Moment, in dem Sie das mit Excel verbundene Origin-Projekt &ouml;ffnen.</li>
<li> Wenn Sie die &auml;ltere (X-Funktions-basierte) impMSExcel-Importroutine verwenden: Bestimmte Informationen des Dateiimports werden in der Arbeitsmappe beim Importieren gespeichert. Sobald Sie eine Excel-Datei in eine Origin-Arbeitsmappe importiert haben, k&ouml;nnen Sie die Funktion <b>Erneut importieren</b> auf der Standardsymbolleiste verwenden, um eine aktualisierte Excel-Datei erneut in Ihre Origin-Arbeitsmappe zu importieren -- einschlie&szlig;lich diejenigen mit mehreren Bl&auml;ttern.</li>
<li> Origin unterst&uuml;tzt kein dynamisches Verkn&uuml;pfen einer Excel-Arbeitsmappe mit einer anderen Excel-Arbeitsmappe. Es erkennt und &uuml;bersetzt auch keine Excel-Formeln.</li></ul>
<p><br /></p>
<table class="note">

<tr>
<td> <b>Hinweis:</b> Weitere Informationen zum Arbeiten mit Excel-Daten finden Sie in der Origin-Hilfe:<p><b>Hilfe: Origin: Origin-Hilfe &gt; <a class="external text" href="../../UserGuide/Category/Working_with_Microsoft_Excel.html">Mit  Microsoft Excel arbeiten</a></b> und <a class="external text" href="../../UserGuide/UserGuide/Connecting_to_File.html#Excel"><b>Mit Datei verbinden &gt; Excel</b></a></p>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tip_icon.png" width="57"  border="0" /></td><td><p>Sowohl der <b>Excel-Konnektor</b> als auch die <b>impMSExcel</b>-Routinen unterst&uuml;tzen den teilweisen Import von Excel-Daten. Weitere Informationen finden Sie in der Origin-Hilfe unter <a class="external text" href="../../UserGuide/Category/Partial_Importing_and_Re_Importing.html"><b>Teilweises Importieren und Erneutes Importieren</b></a>.</p></td></tr></table>
<h3><a name="Connecting_to_Excel_Files"></a><span class="mw-headline">Mit Excel-Dateien verbinden</span></h3>
<p>Origins <b>Datenkonnektoren</b> erstellen eine Live-Verbindung zwischen Ihren externen Datendateien und Ihrem Origin-Projekt.</p>
<ul><li> Um eine Verbindung zu einer lokalen Datei herzustellen, klicken Sie auf <b>Daten: Mit Datei verbinden</b> oder auf die Schaltfl&auml;che <a  class="image"><img alt="Button Import Excel.png" src="../images/Import_Data/Button_Import_Excel.png" width="25"  /></a> auf der Symbolleiste <b>Standard</b>.</li>
<li> Um eine Verbindung zu einer im Web gespeicherten Datei herzustellen, klicken Sie auf <b>Daten: Mit Web verbinden</b>.</li>
<li> Sie k&ouml;nnen eine Excel-Datei pro Origin-Arbeitsmappe verbinden.</li>
<li> Wenn die Datei eine Datei mit mehreren Bl&auml;ttern ist, m&uuml;ssen Sie zuerst eine Verbindung zu einem einzelnen Blatt herstellen. Dies &ouml;ffnet den <b>Datennavigator</b> (oben beschrieben), in dem Sie eine Verbindung zu zus&auml;tzlichen Bl&auml;ttern herstellen k&ouml;nnen.</li>
<li> Wenn alle Bl&auml;tter identisch strukturiert sind, so dass sichergestellt ist, dass das erste Blatt ordentlich geparst wird (die Headerinformation wird z. B. korrekt verarbeitet), dann k&ouml;nnen Sie zus&auml;tzliche Bl&auml;tter ohne weitere Anpassungen verbinden. </li></ul>
<dl><dd><a  class="image"><img alt="Excel connect import options structure.png" src="../images/Import_Data/Excel_connect_import_options_structure.png" width="742"  /></a></dd></dl>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Neue Arbeitsmappe</b> <a  class="image"><img alt="Button New Workbook.png" src="../images/Import_Data/Button_New_Workbook.png" width="23"  /></a>, um eine neue Arbeitsmappe zu erstellen. W&auml;hlen Sie dann <b>Daten: Mit Datei verbinden: Excel</b>.</li>
<li> Navigieren Sie zum &lt;<i>Origin-Programmordner</i>&gt;\Samples\Import and Export\United States Energy (1980-2013).xls und &ouml;ffnen Sie die Datei.</li>
<li> &Uuml;bernehmen Sie alle Standardeinstellungen im Dialog <b>Excel-Importoptionen</b> und klicken Sie auf <b>OK</b>.</li>
<li> Halten Sie im Bedienfeld <b>Datennavigator</b>, das auf der linken Seite der Arbeitsmappe ge&ouml;ffnet wird, die Strg-Taste gedr&uuml;ckt und w&auml;hlen Sie die anderen drei (abgeblendeten) Bl&auml;tter. Klicken Sie mit der rechten Maustaste und w&auml;hlen Sie <b>Blatt/Bl&auml;tter hinzuf&uuml;gen und verbinden</b>. Die verbleibenden Bl&auml;tter -- <i>Natural Gas</i>, <i>Coal</i> und <i>Total Primary Energy</i> -- werden in die Arbeitsmappe importiert. Beachten Sie: Wenn die unverbundenen Bl&auml;tter gro&szlig; sind, k&ouml;nnen Sie sie nach Bedarf nacheinander verbinden.</li></ol>
</td></tr></table>
<h2><a name="Import_from_File"></a><span class="mw-headline">Aus Dateien importieren</span></h2>
<p><span class="OIndex" style="display:none">ASCII-Daten</span> Die Importroutinen, die unter <b>Daten: Aus Datei importieren</b> aufgef&uuml;hrt werden, sind &auml;lter als die Datenkonnektoren. Auch wenn die Routinen f&uuml;r <b>Aus Datei importieren</b> nicht mehr entwickelt werden, <i>werden</i> sie noch immer unterst&uuml;tzt.</p><p>Beachten Sie auch, dass wom&ouml;glich keine Konnektoren f&uuml;r einige der Dateitypen, die in <a href="../../GettingStarted/OriginLab/Import_Data.html#Third_Party_Formats" title="OriginLab:Import Data">dieser Tabelle</a> aufgelistet sind, existieren. Falls kein Datenkonnektor existiert, sollten Sie die Methoden unter <b>Daten: Aus Datei importieren</b> verwenden.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Alert_icon.png" width="57"  border="0" /></td><td><p>Die Schaltfl&auml;che <b>ASCII-Dateidaten</b> <a  class="image"><img alt="Button Import ASCII.png" src="../images/Import_Data/Button_Import_ASCII.png" width="20"  /></a> auf der Symbolleiste Standard ruft nun die Routine <b>Daten: Mit Dateien verbinden: Text/CSV</b> auf. Weiteres zur Routine <b>impASC</b> lesen Sie im n&auml;chsten Abschnitt.</p>
	</td>
	</tr>
	</table>
<h3><a name="Importing_ASCII_Files_with_impASC"></a><span class="mw-headline">ASCII-Dateien mit impASC importieren</span></h3>
<ul><li> Die Methode <b>Daten: Aus Datei importieren: Mehrere ASCII</b> (<a  class="image"><img alt="Button Import Multiple ASCII.png" src="../images/Import_Data/Button_Import_Multiple_ASCII.png" width="23"  /></a>) funktioniert im Allgemeinen gut beim Importieren von Textdateien, die eine einfache Struktur haben (funktioniert f&uuml;r den Import einzelner oder mehrerer Dateien). Diese Routine bearbeitet &uuml;blicherweise Dateien mit g&auml;ngigen Trennzeichen und einer einfachen Headerstruktur ohne Anpassungen. </li>
<li> Wenn der Dateiimport Anpassungen braucht, aktivieren Sie das Kontrollk&auml;stchen <b>Optionendialog zeigen</b> beim Ausw&auml;hlen Ihrer Datei(en) im Dialog <b>ASCII</b>. Der Dialog <b>impASC</b> wird vor dem eigentlichen Dateiimport aufgerufen und erlaubt Ihnen, Einstellungen f&uuml;r die Verarbeitung der Dateien festzulegen. </li></ul>
<dl><dd> <a  class="image"><img alt="Import data 1.png" src="../images/Import_Data/Import_data_1.png" width="612"  /></a></dd></dl>
<table class="note">

<tr>
<td> <b>Hinweis:</b> Weitere Informationen zum Arbeiten mit dem <b>ASCII-Import mit dem Dialog impASC</b> finden Sie in der Origin-Hilfe:<p><b>Hilfe: Origin: Origin-Hilfe &gt; <a class="external text" href="../../UserGuide/UserGuide/Customizing_the_ASCII_Import_Options.html">ASCII-Importoptionen benutzerdefiniert anpassen</a></b></p>
</td></tr></table>
<h3><a name="Saving_Import_Settings"></a><span class="mw-headline">Importeinstellungen speichern</span></h3>
<p>Wenn Sie die Importeinstellungen im Dialog <b>impASC</b> angepasst haben, k&ouml;nnen Sie sie mit einer von zwei Methoden speichern:</p>
<ul><li> Mit der Arbeitsblatt<a class="external text" href="../../UserGuide/UserGuide/Basic_Child_Window_Operations.html#Saving_a_window_to_a_file">vorlage</a>.</li>
<li> Als eine <a class="external text" href="../../UserGuide/UserGuide/Dialog_Themes.html#Saving_Dialog_Themes"><b>Design</b></a>datei aus dem Dialog impASC heraus (einschlie&szlig;lich <a class="external text" href="../../UserGuide/Category/Importing_Data_by_Drag_and_Drop.html#Save_Settings_for_Drag-and-Drop">Speichern f&uuml;r Drag&amp;Drop</a>). </li></ul>
<p>Das Speichern der Importeinstellungen mit der Arbeitsblattvorlage bietet &Uuml;bertragbarkeit (z. B. k&ouml;nnen Vorlagen einfach mit Kollegen geteilt werden). Das Speichern von Importeinstellungen als ein Design bietet den Vorteil, dass eine beliebige Anzahl von kombinierten Importoptionen beim Importieren &uuml;ber den Dialog impASC aufgerufen werden k&ouml;nnen.</p><p>Einzelheiten zu Designs und Vorlagen finden Sie in dem Kapitel <a href="../../GettingStarted/OriginLab/Customizing_Origin.html#Templates_and_Themes" title="OriginLab:Customizing Origin"><i>Origin benutzerdefiniert anpassen</i></a> weiter hinten in diesem Dokument. Sie k&ouml;nnen au&szlig;erdem weitere Informationen unter &quot;Weiterf&uuml;hrende Themen&quot; nachlesen.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tip_icon.png" width="57"  border="0" /></td><td><p>Sie k&ouml;nnen Ihr eigenes Importdesign schnell aus der Liste unten im Men&uuml; <b>Daten</b> laden. Sie k&ouml;nnen auch das Men&uuml; <b>Daten: Aus Datei importieren: Dateitypen hinzuf&uuml;gen/entfernen</b> verwenden, um den Dialog <b>Benutzerdefinierte Anpassung des Importmen&uuml;s</b> zu &ouml;ffnen. In diesem Dialog haben Sie die M&ouml;glichkeit, <b>Anwenderdesigns</b> zum Men&uuml; <b>Daten: Aus Datei importieren</b> hinzuzuf&uuml;gen.</p></td></tr></table>
<h3><a name="Third_Party_Formats"></a><span class="mw-headline">Drittanbieterformate</span></h3>
<p>Wenn ein <a href="#Data_Connectors"><b>Datenkonnektor</b></a> f&uuml;r ein bestimmtes Drittanbieterformat nicht existiert, k&ouml;nnen Sie noch Origins &auml;ltere auf X-Funktionen basierenden Importroutinen verwenden. Origin importiert viele g&auml;ngige Fomate von Drittanbietern, einschlie&szlig;lich pClamp, NI TDM und NetCDF. Wie bei allen auf X-Funktionen basierenden Routinen k&ouml;nnen Sie die Importoptionen f&uuml;r Drittanbieterformate benutzerdefiniert anpassen und Ihre <a class="external text" href="../../UserGuide/Category/Importing_Data_by_Drag_and_Drop.html#Save_Settings_for_Drag-and-Drop">Einstellungen mit der Arbeitsblattvorlage</a> oder als <a class="external text" href="../../UserGuide/UserGuide/Dialog_Themes.html#Saving_Dialog_Themes">Dialogdesign</a> f&uuml;r die sp&auml;tere Verwendung speichern. Wie andere unterst&uuml;tzte Dateitypen auch k&ouml;nnen Sie Drittanbieterdateien mit <a class="external text" href="../../UserGuide/UserGuide/Introduction_to_Import_Filters_Manager.html">Drag&amp;Drop</a> importieren. <span class="OIndex" style="display:none">pClamp</span> <span class="OIndex" style="display:none">HDF5</span> <span class="OIndex" style="display:none">SPC</span> <span class="OIndex" style="display:none">MATLAB</span> <span class="OIndex" style="display:none">JCAMP</span></p>
<table class="simple">
<tr>
<th> Dateityp</th>
<th> Methode</th>
<th> Weitere Informationen k&ouml;nnen Sie nachlesen unter<p><b>Hilfe: Origin: Origin-Hilfe &gt; Daten importieren und exportieren</b></p>
</th></tr>
<tr>
<td>
<p><br /><span class="OIndex">Thermo</span> (<span class="OIndex">SPC</span>, <span class="OIndex">CGM</span>) <br /><span class="OIndex">pCLAMP</span> (<span class="OIndex">ABF</span>, <span class="OIndex">DAT</span>, <span class="OIndex">AB?</span>) <br /><span class="OIndex">Princeton Instruments</span> (<span class="OIndex">SPE</span>) <br />Sound (<span class="OIndex">WAV</span>) <br /><span class="OIndex">NetCDF</span> (<span class="OIndex">NC</span>) <br />CDF (<span class="OIndex">CDF</span>) <br />HDF5 (<span class="OIndex">H5</span>, <span class="OIndex">HE</span>, <span class="OIndex">HDF5</span>) <br /><span class="OIndex">NI DIAdem</span> (DAT) <span class="OIndex" style="display:none">National Instruments</span> <br /><span class="OIndex">Famos</span> (<span class="OIndex">DAT</span>, <span class="OIndex">RAW</span>) <br /><span class="OIndex">ETAS INCA</span> MDF (DAT, <span class="OIndex">MDF</span>) <br /><span class="OIndex">IgorPro</span> (<span class="OIndex">PXP</span>, <span class="OIndex">IBW</span>) <br /><span class="OIndex">Prism</span> (<span class="OIndex">PZFX</span>, <span class="OIndex">XML</span>) <br />MATLAB (<span class="OIndex">Mat</span>) <br /><span class="OIndex">Minitab</span> (<span class="OIndex">MTW</span>, <span class="OIndex">MPJ</span>) <br /><span class="OIndex">KaleidaGraph</span> (<span class="OIndex">QDA</span>) <br /><span class="OIndex">SigmaPlot</span> (<span class="OIndex">JNB</span>) <br />MZXML(<span class="OIndex">mzData</span>, <span class="OIndex">mzXML</span>, <span class="OIndex">mzML</span>, <span class="OIndex">imzML</span>) <br /><span class="OIndex">EarthProbe</span> (<span class="OIndex">EPA</span>) <br />EDF (<span class="OIndex">EDF</span>, <span class="OIndex">BDF</span>, <span class="OIndex">REC</span>, <span class="OIndex">HYP</span>) <br /><span class="OIndex">Somat</span> SIE (<span class="OIndex">SIE</span>) <br /><span class="OIndex">JCAMP-DX</span> (<span class="OIndex">DX</span>, <span class="OIndex">DX1</span>, <span class="OIndex">JDX</span>, <span class="OIndex">JCM</span>) <br /><span class="OIndex">HEKA</span> (DAT) <br /><span class="OIndex">SPSS</span> (<span class="OIndex">SAV</span>) <br /><span class="OIndex">BRUKER OPUS</span> <br /><span class="OIndex">SAS</span> (<span class="OIndex">sas7bdat</span>) <br /><span class="OIndex">Tektronix</span> (<span class="OIndex">ISF</span>) <br />Data Translation (<span class="OIndex">DCF</span>, <span class="OIndex">HPF</span>) <br />Binary 2D Array (<span class="OIndex">IMG</span>, <span class="OIndex">B2D</span>)<span class="OIndex" style="display:none">Binary 2D Array, Import</span> <br />Image <span class="OIndex" style="display:none">Image, Import</span></p>
</td>
<td> <b>Daten: Aus Datei importieren:</b></td>
<td> <b>&gt; Drittanbieterdateien importieren</b></td></tr>
</table>
<table class="note">

<tr>
<td><b>Hinweis:</b> Einige dieser Drittanbieterformate werden standardm&auml;&szlig;ig verborgen. Zum Hinzuf&uuml;gen w&auml;hlen Sie <b>Daten: Aus Datei importieren: Dateitypen hinzuf&uuml;gen/entfernen...</b>. Der Dialog <b>Benutzerdefinierte Anpassung des Importmen&uuml;s</b> wird aufgerufen, in dem Sie w&auml;hlen k&ouml;nnen, welche Dateitypen im Men&uuml; <b>Aus Datei importieren</b> gezeigt werden. Um ein Trennzeichen nach einem Men&uuml;befehl einzuf&uuml;gen, klicken Sie mit der rechten Maustaste auf das Bedienfeld rechts und w&auml;hlen Sie <b>Trennzeichen hinzuf&uuml;gen</b>. Um ein Trennzeichen zu entfernen, klicken Sie im rechten Bedienfeld doppelt auf das Trennzeichen.</td></tr></table>
<p><span class="OIndex" style="display:none">Drag&amp;Drop, Importieren mit</span></p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn kein Datenkonnektor f&uuml;r einen gegebenen Dateityp existiert (d. h. die in der Tabelle oben gelisteten Typen), wird die Drag&amp;Drop-Unterst&uuml;tzung durch die Dateierweiterung geregelt und zwar &uuml;ber den Dialog <b>Importfilter verwalten</b>. Klicken Sie im Hauptmen&uuml; auf <b>Einstellungen: Importfilter verwalten</b>.</p></td></tr></table>
<table class="note">

<tr>
<td> <b>Hinweis:</b> Weitere Informationen zum Arbeiten mit <b>Drittanbieterdateien</b> finden Sie in der Origin-Hilfe:<p><b>Hilfe: Origin: Origin-Hilfe &gt; <a class="external text" href="../../UserGuide/UserGuide/Importing_Third_Party_Files.html">Drittanbieterdateien importieren</a></b></p>
</td></tr></table>
<h2><a name="The_Import_Wizard"></a><span class="mw-headline">Der Importassistent</span></h2>
<p>F&uuml;r den Import von komplexen ASCII-Dateien -- die Dateien, die nicht ausreichend gut mit den bereits erw&auml;hnten Methoden verarbeitet werden k&ouml;nnen -- k&ouml;nnen Sie den interaktiven <b>Importassistenten</b> verwenden. Dateien mit einem optionalen Headerabschnitt, gefolgt von einer sequenziellen Bin&auml;rstruktur, k&ouml;nnen auch mit dem Importassistenten importiert werden: <span class="OIndex" style="display:none">Bin&auml;re Daten</span> <span class="OIndex" style="display:none">Importassistent</span>.</p><p>Ein weiterer Vorteil beim Verwenden des Importassistenten f&uuml;r Ihre ASCII-Daten ist, dass Sie Importfilter erstellen k&ouml;nnen, die auf eine Gruppe von Datendateien mit &auml;hnlichen Namen abzielen. Dies ist insbesondere hilfreich, wenn diese Dateien Metadaten enthalten, die auf eine bestimmte Weise verarbeitet werden m&uuml;ssen. Der Filter kann dann f&uuml;r Drag&amp;Drop-Importoperationen verwendet und zum Men&uuml; <b>Daten: Aus Datei importieren</b> hinzugef&uuml;gt werden. Sie k&ouml;nnen diese Importfilter im Men&uuml; <b>Einstellungen: Importfilter verwalten</b> anzeigen und bearbeiten.</p><p><br /> <i><b>Um den Importassistenten auszuf&uuml;hren:</b></i></p>
<ol><li> W&auml;hlen Sie <b>Daten: Aus Datei importieren: Importassistent</b> oder klicken Sie auf die Schaltfl&auml;che <a  class="image"><img alt="Button Import Wizard.png" src="../images/Import_Data/Button_Import_Wizard.png" width="25"  /></a>, die sich auf der Symbolleiste <b>Standard</b> befindet. </li></ol>
<ul><li> Entwickeln Sie Origin-Importfilterdateien (*.oif) f&uuml;r den Import von ASCII-Dateien, die nicht zufriedenstellend mit dem Text/CSV-Konnektor verarbeitet werden.</li>
<li> Importieren Sie Daten von Webseiten mit Hilfe der Zwischenablage (siehe unten).</li>
<li> Sie k&ouml;nnen Variablen aus dem Dateinamen und -header extrahieren.</li>
<li> Legen Sie die benutzerdefinierten Trennzeichen und Datenformate fest, um Ihre Daten zu analysieren.</li>
<li> Es besteht weiterhin die M&ouml;glichkeit, Ihre importierten Daten mit Hilfe eines benutzerdefinierten LabTalk-Skripts nachzubearbeiten. </li></ul>
<p><br /></p>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen k&ouml;nnen Sie in der Hilfe nachlesen unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Daten importieren und exportieren &gt; <a class="external text" href="../../UserGuide/Category/The_Import_Wizard.html">Der Importassistent</a> </b></p>
</td></tr></table>
<h2><a name="Copy.2FPaste_the_Clipboard_Data"></a><span class="mw-headline">Daten der Zwischenablage kopieren/einf&uuml;gen</span></h2>
<p><span class="OIndex" style="display:none">Daten der Zwischenablage, Importieren</span> Ein einfacher Weg, um Daten in Origin einzulesen, ist das Kopieren von Daten in die Zwischenablage, von wo aus sie dann in Origin eingef&uuml;gt werden k&ouml;nnen. Dies kann so unkompliziert vonstatten gehen, wie das Ausw&auml;hlen und Kopieren eines Datenblocks in einer Excel-Arbeitsmappe und dessen Einf&uuml;gen  in eine Origin-Arbeitsmappe. Daten in der Zwischenablage k&ouml;nnen jedoch m&ouml;glicherweise nicht auf eine Weise formatiert, angeordnet oder getrennt sein, die es einfach macht, sie in Origin zu importieren. Im Folgenden finden Sie einige Informationen, die Sie dazu wissen sollten:</p>
<ul><li> Daten, die aus Excel kopiert und in Origin eingef&uuml;gt werden, werden mit vollst&auml;ndiger Genauigkeit &uuml;bertragen, unabh&auml;ngig von der Anzahl der angezeigten Dezimalstellen in Excel.</li>
<li> Wenn Sie mit Excel-Dateien arbeiten, die Headerinformationen enthalten, f&uuml;gen Sie die Daten aus der Zwischenablage in Zeile 1 in Origin ein (nicht die Spaltenbeschriftungszeilen) und verwenden Sie dann die (Kontextmen&uuml;-)Befehle <b>Als Langname setzen</b>, <b>Als Einheiten setzen</b>, <b>Als Kommentar setzen</b> etc., um Ihre Metadaten zu definieren.</li>
<li> Daten, die Sie aus dem Internet kopiert wurden, k&ouml;nnen auf verschiedene Weise formatiert werden. Sie m&uuml;ssen m&ouml;glicherweise ein wenig experimentieren, um die Methode zu finden, die Ihre Daten am saubersten &uuml;bertr&auml;gt. Sollte ein einfacher Vorgang des Kopierens und Einf&uuml;gens nicht ausreichen, versuchen Sie, den <b>Importassistent</b> zu verwenden. Der Importassistent beinhaltet eine interaktive Bedienoberfl&auml;che zum Parsen von Daten aus der Zwischenablage mit dem zus&auml;tzlichen Vorteil, dass Sie Ihre Vorgehensweise in einer Importfilterdatei (.oif) speichern k&ouml;nnen, um diese entsprechenden Einstellungen f&uuml;r identisch formatierte Daten zu einem sp&auml;teren Zeitpunkt erneut verwenden zu k&ouml;nnen. Weitere Informationen k&ouml;nnen Sie im Tutorial <a class="external text" href="../../UserGuide/UserGuide/Using_the_Import_Wizard_to_Import_Clipboard_Data.html">Verwenden des Importassistenten zum Importieren von Daten aus der Zwischenablage</a> nachlesen.</li></ul>
<dl><dd><dl><dd> <a  class="image"><img alt="Import data wizard composite resample office 600px.png" src="../images/Import_Data/Import_data_wizard_composite_resample_office_600px.png" width="600"  /></a></dd></dl></dd></dl>
<h2><a name="Selectively_Import_Data_by_Querying_an_Origin_File"></a><span class="mw-headline">Daten selektiv durch Abfrage einer Origin-Datei importieren</span></h2>
<p>Sie k&ouml;nnen selektiv Datenspalten aus einer externen Origin-Datei importieren, indem Sie vor dem Import eine SQL-&auml;hnliche Abfrage im <b>Datenkonnektor-Browser</b> festlegen.</p>
<dl><dd><a  class="image"><img alt="UG Import Origin SQL.png" src="../images/Import_Data/UG_Import_Origin_SQL.png" width="611"  /></a></dd></dl>
<p><i><b>Um Origin-Dateien selektiv mit Hilfe des Origin Connector abzufragen:</b></i></p>
<ol><li> W&auml;hlen Sie bei aktivem Arbeitsblatt <b>Daten: Mit Datei verbinden</b> oder <b>Mit Web verbinden</b>.</li>
<li> Navigieren Sie zu Ihrer Origin-Datei und klicken auf <b>&Ouml;ffnen</b>. Der Datenkonnektor-Browser wird ge&ouml;ffnet.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Abfrage ausw&auml;hlen</b> <b><a  class="image"><img alt="UG Select Query Button.png" src="../images/Import_Data/UG_Select_Query_Button.png" width="42"  /></a></b>.</li>
<li> Geben Sie Ihre Abfrage im Dialog Abfrage ausw&auml;hlen ein und klicken Sie dann auf <b>OK</b>.</li></ol>
<p>Die Daten werden selektiv in die aktive Arbeitsmappe importiert, wie in Ihrer Abfrage angegeben.</p><p><br /> <i><b>Allgemeine Schl&uuml;sselw&ouml;rter:</b></i></p>
<table class="simple" style="width: 80%">
<tr>
<th style="width: 40%">Schl&uuml;sselwort</th>
<th style="width: 40%">Beschreibung</th></tr>
<tr>
<td>_SName</td>
<td>Kurzname, z. B. _SName, Sheet_SName</td></tr>
<tr>
<td>_LName</td>
<td>Langname, z. B. _LName, Book_LName</td></tr>
<tr>
<td>_Comments</td>
<td>Kommentare, z. B. _Comments, Sheet_Comments</td></tr>
<tr>
<td>Column_D1</td>
<td>benutzerdefinierter Parameter der Spalte, wobei <i>1</i> der Parameterindex ist</td></tr>
<tr>
<td>Column_[Name]</td>
<td>benutzerdefinierter Parameter der Spalte, wobei [Name] ein Parametername ist, der Leerzeichen enth&auml;lt</td></tr></table>
<p><br /> <i><b>Beispiele:</b></i></p>
<pre class="lt" style="font-family:monospace;">W&auml;hle die Spalten aus dem Projekt, bei denen _SName <span style="color: #000080;">==</span> <span style="color: #ff00ff;">&quot;A&quot;</span>; w&auml;hle die Spalten aus dem Projekt, bei denen _Comments wie <span style="color: #ff00ff;">&quot;S*3&quot;</span>; w&auml;hle die Spalten aus dem Projekt, bei denen <span style="color: #000000;">(</span>Column_P1 like <span style="color: #ff00ff;">&quot;*y*&quot;</span> und Column_D1 <span style="color: #000080;">&gt;</span> <span style="color: #0000dd;">3</span><span style="color: #000000;">)</span>; w&auml;hle die Spalten aus dem Projekt, bei denen Sheet_SName wie <span style="color: #ff00ff;">&quot;Trial*&quot;</span>; w&auml;hle die Spalten aus dem Projekt, bei denen <span style="color: #000000;">(</span>Book_SName wie <span style="color: #ff00ff;">&quot;Book*&quot;</span> oder Book_LName wie<span style="color: #ff00ff;">&quot;*fit*&quot;</span><span style="color: #000000;">)</span>.</pre>
<p><br /> <i><b>Weitere Informationen finden Sie unter</b></i> <a class="external text" href="../../UserGuide/UserGuide/Examples_of_using_SQL_query_condition_in_Origin_Connector.html">Beispiele der Verwendung von SQL-Abfragebedingungen im Origin Connector</a>.</p>
<h2><a name="Database"></a><span class="mw-headline">Datenbank</span></h2>
<p><span class="OIndex" style="display:none">SQL-Daten</span></p><p>Origin unterst&uuml;tzt das Verbinden von Datenbanken per ODBC und OLE DB. Au&szlig;erdem enth&auml;lt Origin einen einfachen SQL-Editor, um Verbindungszeichenketten hinzuzuf&uuml;gen und SQL-Abfragen innerhalb von Origin zu erzeugen.</p><p><br /> Um SQL-Daten zu importieren, starten Sie mit dem Men&uuml;befehl <b>Daten: Mit Datenbank verbinden</b>:</p>
<ul><li> Mit <b>&Ouml;ffnen</b> k&ouml;nnen Sie nach einer gespeicherten Verbindung (ODS) oder einer Abfragedatei (ODQ) suchen und diese &ouml;ffnen.</li>
<li> <b>Neu</b> &ouml;ffnet den Dialog <b>Datenbankkonnektor</b>. </li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="UG database connector dialog.png" src="../images/Import_Data/UG_database_connector_dialog.png" width="327"  /></a></dd></dl>
<ul><li> <b>Verbindungszeichenkette</b>:&nbsp;W&auml;hlen Sie diese Option, wenn Sie bereits eine textbasierte Verbindungszeichenkette f&uuml;r eine gegebene Datenquelle haben (ODBC oder OLE DB).</li>
<li> <b>ODBC-Datenquelle</b>:&nbsp;W&auml;hlen Sie diese Option, wenn Sie eine ODBC-Datenquelle &uuml;ber das&nbsp;Windows-Applet&nbsp;<b>ODBC-Datenquellen-Administrator</b>&nbsp;definiert haben.</li>
<li> <b>ODBC-Treiber</b>:&nbsp;W&auml;hlen Sie diese Option, wenn Sie einen ODBC-Treiber haben und eine Datenquelle erstellen m&ouml;chten, die auf diese Datenkonnektorinstanz anwendbar ist.</li>
<li> <b>Windows-Dialog Datenverkn&uuml;pfungseigenschaften</b>:&nbsp;W&auml;hlen Sie diese Option, wenn Sie eine OLE-DB-basierte Datenquelle wie SQL-Server&nbsp;oder&nbsp;Access-Client-Library verwenden.</li></ul></dd></dl>
<p><br /> <i><b>Weiteres, das zu beachten w&auml;re:</b></i></p>
<ul><li> Verwenden Sie die Systemvariable <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#H.2CI.2CJ.2CK"><b>@IPDB</b></a>, um den Schutz des importierten Bereichs (0 = kein Schutz, 1 = gesch&uuml;tzt, aber Neuordnen zul&auml;ssig, 2 = gesch&uuml;tzt) zu steuern.</li>
<li> &Auml;hnlich wie bei anderen Konnektoren haben Sie die Option <b>beim Speichern</b> als OPJU/OGWU <b>Importierte (Daten) auszuschlie&szlig;en</b> .</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="DB Save wo data.png" src="../images/Import_Data/DB_Save_wo_data.png" width="383"  /></a></dd></dl></dd></dl>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen finden Sie in der Origin-Hilfe.<p><b>Hilfe: Origin: Origin-Hilfe &gt; Daten importieren und exportieren &gt; <a class="external text" href="../../UserGuide/Category/Importing_Data_from_a_Database.html">Importieren von Daten aus einer Datenbank</a></b></p>
</td></tr></table>
<h2><a name="Digitizer"></a><span class="mw-headline">Digitalisierer</span></h2>
<p><span class="OIndex" style="display:none">Punktdiagramme digitalisieren</span> Manchmal verf&uuml;gen Sie vielleicht nur &uuml;ber eine grafische Darstellung einiger Daten, die Sie gern weiter untersuchen w&uuml;rden. Verwenden Sie den Digitalisierer, um eine Bilddatei zu importieren. Digitalisieren Sie die Zeichnungen und konvertieren Sie Ihr Bild in numerische Daten, die Sie mit Hilfe von Origins Hilfsmitteln zur Analyse und grafischen Darstellung untersuchen und neu zeichnen k&ouml;nnen.</p>
<dl><dd><a  class="image"><img alt="Digitizer data import chapter 2.png" src="../images/Import_Data/Digitizer_data_import_chapter_2.png" width="603"  /></a></dd></dl>
<ul><li> Importieren Sie die g&auml;ngigsten Bildformate.</li>
<li> Drehen Sie das importierte Bild, entfernen Sie Rauschen und kalibrieren Sie die Skalen durch Auswahl von Anfangs- und Endwerte.</li>
<li> W&auml;hlen Sie Punkte auf Kurven manuell oder automatisch aus.</li>
<li> F&uuml;gen Sie ggf. manuell Kurvenwendepunkte hinzu.</li>
<li> Entfernen Sie interaktiv Punkte, die Sie nicht digitalisiert haben m&ouml;chten.</li>
<li> Kartesische, polare und tern&auml;re Koordinatensysteme werden unterst&uuml;tzt.</li></ul>
<p><br /> Um den Digitalisierer zu &ouml;ffnen:</p>
<ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Bild digitalisieren</b> <a  class="image"><img alt="Button Digitize Image.png" src="../images/Import_Data/Button_Digitize_Image.png" width="23"  /></a> auf der Symbolleiste <b>Standard</b> oder w&auml;hlen Sie im Hauptmen&uuml; <b>Hilfsmittel: Digitalisierer</b>.</li></ol>
<h2><a name="Saving_Origin_Files_without_Imported_Data"></a><span class="mw-headline">Origin-Dateien ohne importierten Daten speichern</span></h2>
<p>Anwender haben seit Langem die Option, Origin-Dateien ohne Daten zu speichern. <b>Vorlage speichern unter...</b>, <b>Arbeitsmappe als Analysevorlage speichern</b> und <b>Projekt ohne Daten speichern</b> waren drei Optionen zum Speichern von Origin-Dateien ohne Daten, w&auml;hrend die Einstellungen und Operationen mit der Datei bewahrt werden.</p><p>Anwender haben jetzt die Option, Origin-Dateien ohne die <i>importierten</i> Daten zu speichern. Diese Option ist besonders attraktiv f&uuml;r Anwender, die mit gro&szlig;en Datendateien arbeiten, wobei das Speichern von diesen Daten mit der Datei die Leistung beeintr&auml;chtigen oder Festplattenplatz verschwenden w&uuml;rde.</p>
<ul><li>  Standardm&auml;&szlig;ig werden Daten, die mit einem <b>Datenkonnektor</b> importiert werden, nicht mit der Mappe gespeichert, <a href="#Things_to_Know_about_Data_Connectors">wenn die Importdateigr&ouml;&szlig;e 500 kB &uuml;berschreitet</a>. Jede Mappe hat ihr eigenes H&auml;kchen <b>Importierte Daten beim Speichern ausschlie&szlig;en</b>, und das Entfernen des H&auml;kchens auf <i>einer beliebigen</i> Seite in der Mappe zieht nach sich, dass alle importierten Daten mit der Mappe gespeichert werden.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="Exclude imported when saving.png" src="../images/Import_Data/Exclude_imported_when_saving.png" width="361"  /></a></dd></dl></dd></dl>
<ul><li> Jede Mappe im Projekt -- nicht nur die Mappen mit <b>Datenkonnektoren</b> -- k&ouml;nnen so konfiguriert werden, dass importierte Daten ausgeschlossen werden, indem mit der rechten Maustaste auf die Fenstertitelleiste geklickt, <b>Eigenschaften</b> ausgew&auml;hlt und dann unten im Dialog <b>Importierte Daten beim Speichern des Projekts ausschlie&szlig;en</b> aktiviert wird.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="Exclude imported when saving Properties dialog.png" src="../images/Import_Data/Exclude_imported_when_saving_Properties_dialog.png" width="568"  /></a></dd></dl></dd></dl>
<p><br /> <i><b>Der Vorgang des Ausschlie&szlig;ens der Daten beim Speichern unterscheidet sich vom Speichern einer Vorlagendatei in ein paar wichtigen Punkten:</b></i></p>
<ul><li> Wenn Sie importierte Daten ausschlie&szlig;en, speichern Sie noch immer alle Ausgaben, die sich aus den Analyseoperationen der importierten Daten ergeben -- Anpassungsergebnisse, statistische Analysen, Berechnungen mittels Werte setzen etc. -- Sie speichern nur die importierten Daten oder Diagramme dieser importierten Daten nicht.</li>
<li> Mappen, die Sie ohne importierte Daten gespeichert haben, behalten eine &quot;Live&quot;-Verbindung zur urspr&uuml;nglichen Datenquelle. Klicken Sie im Fall von Mappen, die Datenkonnektoren enthalten auf das Symbol <b>Datenkonnektor</b> und dann auf <b>Importieren</b> (aktives Blatt) oder <b>Alle importieren</b> (alle Bl&auml;tter in Mappe). Aktivieren Sie bei Mappen, die f&uuml;r den Standarddateiimport verwendet werden, erst die leere Mappe und klicken Sie dann auf <b>Daten: Direkt neu importieren</b> oder klicken Sie auf die Schaltfl&auml;che <b>Neuimport ohne Dialog</b> auf der Symbolleiste <b>Import</b> (siehe n&auml;chsten Abschnitt).</li></ul>
<h2><a name="Re-Importing_Data_Files"></a><span class="mw-headline">Datendateien erneut importieren</span></h2>
<p><span class="OIndex" style="display:none">Neu importieren</span> Es gibt zwei Importbefehle im Men&uuml; <b>Daten</b>, die speziell f&uuml;r den wiederholten Import der gleichen Datei ausgelegt sind (d. h., der Dateipfad und -name m&uuml;ssen gleich sein):</p>
<ul><li><b>Direkt neu importieren</b> Wenn Sie eine Datei in ein Origin-Arbeitsblatt oder -Matrixblatt importieren, wird standardm&auml;&szlig;ig eine Anzahl von Parametern, einschlie&szlig;lich Dateipfad und Name, in dem Blatt gespeichert. Wenn Sie eine externe Datendatei haben, die regelm&auml;&szlig;ig aktualisiert wird, oder wenn Sie eine Standarddatei erneut in das Arbeitsblatt laden m&ouml;chten, k&ouml;nnen Sie direkt erneut importieren, ohne einen Importdialog zu &ouml;ffnen.</li></ul>
<ul><li><b>Neu importieren</b> Dieser Men&uuml;befehl &ouml;ffnet den Importdialog der entsprechenden X-Funktion f&uuml;r den Dateityp, so dass Sie Ihre Importoptionen vor dem Neuimport anpassen k&ouml;nnen.</li></ul>
<table class="note">

<tr>
<td>
<p><b>Hinweise:</b></p>
<ul><li>Es kann nur eine Datei zur gleichen Zeit erneut importiert werden. Wenn Sie eine dieser beiden Men&uuml;befehle verwenden, wird nur die mit dem aktiven Arbeitsblatt oder Matrixblatt verbundene Datei importiert. Wenn die ausgew&auml;hlten Daten aus mehrere Dateien importiert werden, schl&auml;gt der Vorgang des erneuten Importierens fehl.   </li>
<li>Wenn Sie eine <i>ASCII</i>-Datei mit dem <b>Importassistenten</b> importiert haben und im Men&uuml; <b>Datei: Neu importieren</b> w&auml;hlen, wird anstatt des <b><b>Importassistenten</b></b> der Dialog <b>impASC</b> ge&ouml;ffnet. </li>
<li> Der erneute Import funktioniert nicht f&uuml;r <i>bin&auml;re</i> oder <i>benutzerdefinierte</i> Datentypen, die mit dem Importassistent importiert worden sind.</li></ul>
</td></tr></table>
<h2><a name="Clone_Import"></a><span class="mw-headline">Import klonen</span></h2>
<p>Das Klonen eines Imports funktioniert, indem ein Import &quot;modelliert&quot; wird -- und optional eine verbundene Analyseoperation -- und dann das, was mit der urspr&uuml;nglichen Datei gemacht wurde, auf eine Reihe von &auml;hnlichen Dateien angewendet wird. Solange die aktive Mappe die importierten Daten und verbundenen Operationen enth&auml;lt, kann sie geklont werden. So gesehen &auml;hnelt das Klonen dem Erstellen einer <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis_Using_an_Analysis_Template" title="OriginLab:How to Handle Repetitive Tasks"><b>Analysevorlage</b></a>, ist aber etwas eingeschr&auml;nkter hinsichtlich seines Einflusses (z. B. kann es nicht mit dem Hilfsmittel <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis_Using_an_Analysis_Template" title="OriginLab:How to Handle Repetitive Tasks"><b>Stapelverarbeitung</b></a> zusammen verwendet werden).</p><p>Das Klonen des Imports wird von beiden Methoden, <b>Datenkonnektor</b> und <b>X-Funktion</b>, unterst&uuml;tzt. Ein kurzes Tutorial zeigt Ihnen die Grundlagen des Klonens von Import und Analyseoperationen.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Import_Data/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Neue Arbeitsmappe</b> <a  class="image"><img alt="Button New Workbook.png" src="../images/Import_Data/Button_New_Workbook.png" width="23"  /></a>, um eine neue Arbeitsmappe zu erstellen.</li>
<li> Navigieren Sie im Dateiexplorer von Window zu Ihrem Ordner &lt;Origin-Programm&gt;\Samples\Curve Fitting und suchen Sie nach der Datei <i>Sensor01.dat</i>. Ziehen Sie die Datei per Drag&amp;Drop in die neue Arbeitsmappe. Die .dat-Datei wird mit Hilfe des <b>Text/CSV-Konnektors</b> importiert.</li>
<li> Klicken Sie auf den Header von Spalte B, um die Spalte zu markieren, und klicken Sie dann auf die Schaltfl&auml;che <b>Punktdiagramm</b> <a  class="image"><img alt="Button Scatter.png" src="../images/Import_Data/Button_Scatter.png" width="22"  /></a>, um ein Punktdiagramm zu erstellen.</li>
<li> Klicken Sie auf die Skalierung der X- oder Y-Diagrammachse und im dann angezeigten Dialog <b>Achsen</b> auf die Registerkarte <b>Skalierung</b>. Dr&uuml;cken Sie dann die Strg-Taste und markieren Sie die Achsensymbole <b>Horizontal</b> und <b>Vertikal</b> im linken Bedienfeld. Setzen Sie <b>Neu skalieren</b> auf Auto und klicken Sie auf <b>OK</b>.</li>
<li> Klicken Sie bei aktiver Grafik auf <b>Analyse: Anpassen: Lineare Anpassung</b> und &ouml;ffnen Sie den Dialog. Setzen Sie <b>Neu berechnen</b> auf <b>Auto</b>, &uuml;bernehmen Sie die anderen Standardeinstellungen und klicken Sie auf <b>OK</b>. Antworten Sie mit <i>Nein</i> auf die <b>Erinnerung</b> und klicken Sie auf <b>OK</b>.</li>
<li> Klicken Sie mit der rechten Maustaste auf Ihre Arbeitsmappenreiter und klicken Sie auf <b>Diagramm als Blatt hinzuf&uuml;gen</b>. Auf diese Weise wird Ihr Punktdiagramm mit den Ergebnissen der linearen Anpassung als eine Seite in Ihre Arbeitsmappe eingef&uuml;gt.<dl><dd> <a  class="image"><img alt="UG clone import add graph.png" src="../images/Import_Data/UG_clone_import_add_graph.png" width="390"  /></a></dd></dl></li>
<li> Stellen Sie sicher, dass das Blatt mit den importierten Daten aus <i>Sensor01.dat</i> aktiv ist, und klicken Sie auf die Schaltfl&auml;che <b>Import klonen</b> <a  class="image"><img alt="Button Clone Import.png" src="../images/Import_Data/Button_Clone_Import.png" width="25"  /></a> auf der Symbolleiste <b>Import</b>. </li>
<li> Navigieren Sie noch einmal zu Ihrem Ordner &lt;Origin-Programm&gt;\Samples\Curve Fitting, dr&uuml;cken Sie die Strg- oder Shift-Taste und w&auml;hlen Sie die Dateien Sensor02.dat - Sensor07.dat. Klicken Sie auf <b>Hinzuf&uuml;gen</b> und dann auf <b>OK</b>. Was Sie sehen sollten, ist die Verwendung der urspr&uuml;nglichen Mappe als ein Modell f&uuml;r die Import- und Analyseoperationen. Die Sensor-Dateien werden mit Hilfe des Text/CSV-Konnektors importiert und nacheinander verarbeitet (es kann ein paar Sekunden dauern, bis alle Operationen abgeschlossen sind).<dl><dd> <a  class="image"><img alt="UG clone import results.png" src="../images/Import_Data/UG_clone_import_results.png" width="584"  /></a></dd></dl></li></ol>
</td></tr></table>
<h2><a name="Topics_for_Further_Reading"></a><span class="mw-headline">Weiterf&uuml;hrende Themen</span></h2>
<ul><li> <a class="external text" href="../../UserGuide/Category/Data_Connector.html">Datenkonnektoren</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Importing_Simple_ASCII_Data_Files.html">Einfache ASCII-Datendateien importieren</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Customizing_the_ASCII_Import_Options.html">ASCII-Importoptionen benutzerdefiniert anpassen</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Working_with_Microsoft_Excel.html#Updating_Excel_Data_in_Origin">Excel-Daten in Origin aktualisieren</a></li>
<li> <a class="external text" href="https://www.originlab.com/videos/details.aspx?id=269" target="_blank">Video: &apos;Import klonen&apos; verwenden, um mehrere Datendateien durch Stapelverarbeitung zu verarbeiten</a></li>
<li> <a class="external text" href="../../Tutorial/Tutorial/Importing_Multiple_Files_into_Workbooks_Cloned_from_Active_Workbook.html">Tutorial: Mehrere Dateien in Arbeitsmappen importieren, die auf Grundlage der aktiven Arbeitsmappe geklont wurden</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Importing_Third_Party_Files.html">Dateien von Drittanbietern importieren</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Importing_Data_by_Drag_and_Drop.html">Daten per Drag&amp;Drop importieren</a></li>
<li> <a class="external text" href="../../Tutorial/Tutorial/Update_Graph_By_Reimport_Data_From_Database.html">Tutorial: Diagramme durch Neuimport von Daten aus einer Datenbank aktualisieren</a></li>
<li> <a class="external text" href="../../Tutorial/Tutorial/Web_Connect_by_Copy_Link_Address.html">Tutorial: Mit Webdaten verbinden durch Kopieren der Link-Adresse</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Importing_Data_from_a_Database.html">Daten aus einer Datenbank importieren</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Drawing_or_Deleting_Data_Points.html">Datenpunkte zeichnen oder l&ouml;schen</a></li>
<li> <a class="external text" href="../../Tutorial/Tutorial/Enhanced_Digitizer.html">Tutorial: Der Digitalisierer</a></li></ul>



    