<h1 class="firstHeading">Einf&uuml;hrung</h1><p class='urlname' style='display: none'>GSB-Intro</p>
<p>Willkommen und vielen Dank, dass Sie Origin verwenden!</p><p>Origin ist eine leistungsstarke Software zur Datenanalyse und Erstellung von grafischen Darstellungen in Publikationsqualit&auml;t, zugeschnitten auf die Anforderungen von Wissenschaftlern und Ingenieuren. Die Besonderheit von Origin im Vergleich zu anderen Softwareanwendungen liegt in der Einfachheit, mit der Sie Ihre Aufgaben hinsichtlich Datenimport, Datenanalyse, grafischer Darstellung und Berichtserstellung benutzerdefiniert anpassen und automatisieren k&ouml;nnen.</p><p>Benutzerdefinierte Anpassungen umfassen vielf&auml;ltige M&ouml;glichkeiten - von einfachen Modifikationen &uuml;ber als Diagrammvorlage gespeicherte Datenzeichnungen bis hin zu benutzerdefinierten Datenanalysen, die das Erzeugen eines publikationsreifen Berichts umfassen und als Analysevorlage gespeichert werden k&ouml;nnen. Auch die Stapelverarbeitung von Grafik- und Analyseoperationen wird unterst&uuml;tzt, wobei Vorlagen zur wiederholten Analyse von mehreren Dateien oder Datens&auml;tzen verwendet werden.</p><p>Wir sind sicher, dass Sie Origin als ein effektives Werkzeug zum Analysieren Ihrer Daten und Pr&auml;sentieren Ihrer Ergebnisse wertsch&auml;tzen werden. Um Origin optimal zu nutzen, unterst&uuml;tzen wir Sie in Form eines erstklassigen technischen Kundensupports sowie Schulungs- und Beratungsangeboten.</p><p>Wenn nicht anders vermerkt, bezieht sich die Bezeichnung &quot;Origin&quot; in diesem Handbuch auf sowohl Origin als auch OriginPro. <a href="../../GettingStarted/OriginLab/OriginPro.html" title="OriginLab:OriginPro">OriginPro</a> bietet alle Funktionen von Origin, plus die erweiterten Analysehilfsmittel f&uuml;r die Peakanpassung, Oberfl&auml;chenanpassung, Statistik, Signal- sowie Bildverarbeitung.</p><p>Der Zweck dieses Handbuchs besteht darin, einen m&ouml;glichst umfassenden &Uuml;berblick &uuml;ber die Funktionen und M&ouml;glichkeiten von Origin zu vermitteln. Wir hoffen, dass neue Anwender dieses Handbuch als wertvolle Orientierungshilfe f&uuml;r den Origin-Arbeitsbereich und die Hauptfunktionen erleben. Auch Anwender, die bereits mit Origin arbeiten, finden hoffentlich n&uuml;tzliche Informationen zu neuen Funktionen und erfahren m&ouml;glicherweise ein, zwei Dinge &uuml;ber Origin, die Ihnen bisher entgangen sind.</p><p>Ausf&uuml;hrlichere Informationen sind in der Origin-Hilfe (<b>Hilfe: Origin</b> im Hauptmen&uuml; Ihrer Origin-Software) enthalten. Au&szlig;erdem werden zahlreiche weitere Lernquellen bereit gestellt. Eine vollst&auml;ndige Liste der verf&uuml;gbaren Quellen finden Sie in dem Kapitel <b><a href="../../GettingStarted/OriginLab/Origin_Resources.html" title="OriginLab:Origin Resources">Origin-Ressourcen</a></b> dieses Handbuchs.</p><p><br />Worauf Sie in diesem Handbuch achten sollten:</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Introduction/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p>Es wurden in dem gesamten Handbuch kurze Tutorials zu zahlreichen Themen hinzugef&uuml;gt. Diese kurzen Tutorials sollen dazu dienen, Ihnen eine schnelle Einf&uuml;hrung zu einer Schl&uuml;sselfunktion in Origin zu geben. Diese Tutorials werden mit diesem Symbol gekennzeichnet.</p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Introduction/Tip_icon.png" width="57"  border="0" /></td><td><p>Ebenfalls in dem gesamten Handbuch verteilt finden Sie Tipps zu der Verwendung von Origin. Diese Tipps werden mit diesem Symbol gekennzeichnet.</p></td></tr></table>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Introduction/Alert_icon.png" width="57"  border="0" /></td><td><p>Wichtige &Auml;nderungen an Schl&uuml;sselfunktionen und weitere entscheidende Informationen werden mit diesem Symbol gekennzeichnet.</p>
	</td>
	</tr>
	</table>
<p>Um Origins Funktionen im Bereich Datenanalyse und grafischer Darstellung zu verbessern und erweitern, greifen wir u.a. gern auf Ihr Feedback zur&uuml;ck. Wir w&uuml;rden uns daher sehr freuen, von Ihnen zu h&ouml;ren. Die entsprechenden Kontaktdaten finden Sie in dem Kapitel <a href="../../GettingStarted/OriginLab/Origin_Resources.html" title="OriginLab:Origin Resources">Origin-Ressourcen</a> dieses Handbuchs.</p>


    