<h1 class="firstHeading">Origin installieren und aktualisieren</h1><p class='urlname' style='display: none'>Installation-Startup</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Notes_for_Upgrade_Users"><span class="tocnumber">1</span> <span class="toctext">Hinweise f&uuml;r Anwender von Upgrades</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Notes_for_Administrators_of_Multi-user_Packages"><span class="tocnumber">2</span> <span class="toctext">Hinweise f&uuml;r Administratoren von Lizenzen f&uuml;r mehrere Benutzer</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Installing_Origin"><span class="tocnumber">3</span> <span class="toctext">Origin installieren</span></a><ul>
<li class="toclevel-2 tocsection-4"><a href="#How_to_Proceed_if_You_Already_Have_the_Origin_Trial_Version_Installed"><span class="tocnumber">3.1</span> <span class="toctext">Vorgehensweise bei bereits installierter Demoversion von Origin</span></a></li>
<li class="toclevel-2 tocsection-5"><a href="#How_to_Correct_or_Change_your_Serial_Number_After_you_Complete_an_Installation"><span class="tocnumber">3.2</span> <span class="toctext">Ihre Seriennummer nach Fertigstellen einer Installation korrigieren und &auml;ndern</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-6"><a href="#Selecting_a_User_Files_Folder"><span class="tocnumber">4</span> <span class="toctext">Ordner f&uuml;r Anwenderdateien ausw&auml;hlen</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Licensing_Origin"><span class="tocnumber">5</span> <span class="toctext">Origin lizenzieren</span></a><ul>
<li class="toclevel-2 tocsection-8"><a href="#Node-locked"><span class="tocnumber">5.1</span> <span class="toctext">Node-Locked</span></a></li>
<li class="toclevel-2 tocsection-9"><a href="#Concurrent_Network"><span class="tocnumber">5.2</span> <span class="toctext">Netzwerk (Concurrent)</span></a></li>
<li class="toclevel-2 tocsection-10"><a href="#Dongle"><span class="tocnumber">5.3</span> <span class="toctext">Dongle</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-11"><a href="#Registering_Origin"><span class="tocnumber">6</span> <span class="toctext">Origin registrieren</span></a></li>
<li class="toclevel-1 tocsection-12"><a href="#Maintenance"><span class="tocnumber">7</span> <span class="toctext">Softwarepflege</span></a></li>
<li class="toclevel-1 tocsection-13"><a href="#Service_Releases"><span class="tocnumber">8</span> <span class="toctext">Service Releases</span></a></li>
<li class="toclevel-1 tocsection-14"><a href="#Notification_of_Upgrade"><span class="tocnumber">9</span> <span class="toctext">Benachrichtigung &uuml;ber Upgrade</span></a></li>
<li class="toclevel-1 tocsection-15"><a href="#Setting_the_Origin_Display_Language"><span class="tocnumber">10</span> <span class="toctext">Die Sprache von Origin festlegen</span></a></li>
<li class="toclevel-1 tocsection-16"><a href="#System_Transfers_-_Deactivating_a_License"><span class="tocnumber">11</span> <span class="toctext">System&uuml;bertragung - Eine Lizenz deaktivieren</span></a><ul>
<li class="toclevel-2 tocsection-17"><a href="#Node-locked_Licenses_.28Computer_ID-based.29"><span class="tocnumber">11.1</span> <span class="toctext">Rechnergebundene Lizenzen (basierend auf Computer-ID)</span></a></li>
<li class="toclevel-2 tocsection-18"><a href="#Concurrent_Networks"><span class="tocnumber">11.2</span> <span class="toctext">Netzwerklizenzen (Concurrent)</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-19"><a href="#Uninstalling_Origin"><span class="tocnumber">12</span> <span class="toctext">Origin deinstallieren</span></a></li>
</ul>
</div>

<h2><a name="Notes_for_Upgrade_Users"></a><span class="mw-headline">Hinweise f&uuml;r Anwender von Upgrades</span></h2>
<p><span class="OIndex" style="display:none">Upgrade f&uuml;r Origin durchf&uuml;hren</span> <span class="OIndex" style="display:none">Origin, Upgrade durchf&uuml;hren</span> <span class="OIndex" style="display:none">Origin, Lizenzierung</span> <span class="OIndex" style="display:none">Lizenzverwaltung</span> <span class="OIndex" style="display:none">Anwenderdateien, &Uuml;bertragen</span> <span class="OIndex" style="display:none">Origin installieren</span></p>
<ul><li> Das Upgrade f&uuml;r Origin wird in ein neues Programmverzeichnis installiert &ndash; das Upgrade ist kein Update einer &auml;lteren Version. Daher ist es nicht notwendig, eine Vorg&auml;ngerversion von Origin vor dem Upgrade zu installieren oder zu deinstallieren. </li>
<li> Wenn Sie von Origin 2018 oder einer h&ouml;heren Version ein Upgrade durchf&uuml;hren, sollte der Vorgang reibungslos verlaufen. Origin 2018 und h&ouml;here Versionen nutzen eine gemeinsame Lizenzdatei und einen gemeinsamen Anwenderdateiordner. Wenn Sie Origin 2023 zum ersten Mal ausf&uuml;hren, sollte die Software lizenziert sein und wissen, wo Ihre Anwenderdateien abgelegt sind.</li>
<li> Wen Sie ein Upgrade von Origin 2017 durchf&uuml;hren, werden Sie aufgefordert, einen neuen Anwenderdateiordner auszuw&auml;hlen (siehe <b>Anwenderdateiordner ausw&auml;hlen</b> <a href="../../GettingStarted/OriginLab/Origin_Installation_and_Startup.html#Selecting_a_User_Files_Folder" title="OriginLab:Origin Installation and Startup">unten</a>). Wenn Sie benutzerdefinierte Origin-Dateien von Ihrer vorhergehenden Version haben, k&ouml;nnen Sie sie in Ihren neuen <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html"><b>Anwenderdateiordner</b></a> &uuml;bertragen. Klicken Sie dazu im Men&uuml; <b>Einstellungen</b> auf <a class="external text" href="../../UserGuide/UserGuide/Transfer_User_Files.html"><b>Anwenderdateien &uuml;bertragen</b></a>. Vorausgesetzt Ihre Softwarepflege ist nicht abgelaufen, sollten Sie Ihre Software nicht erneut lizenzieren m&uuml;ssen. Wenn Ihre Softwarepflege abgelaufen ist, m&uuml;ssen Sie Ihr Origin 2023 neu lizenzieren (siehe unten <a href="../../GettingStarted/OriginLab/Origin_Installation_and_Startup.html#Registering_Origin" title="OriginLab:Origin Installation and Startup"><b>Origin registrieren</b></a>).</li>
<li> Wenn Sie ein Upgrade von Origin 2016 oder fr&uuml;her durchf&uuml;hren, m&uuml;ssen Sie den Vorgang der Lizenzverwaltung abschlie&szlig;en. Wenn Sie Ihr Upgrade zum ersten Mal starten, wird ein Lizenzdialog angezeigt, der Sie nach Ihrem <b>Produktschl&uuml;ssel</b> fragt. Sollten Sie benutzerdefinierte Origin-Dateien von Ihrer vorherigen Version haben, k&ouml;nnen Sie sie in Ihren neuen <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html"><b>Anwenderdateiordner</b></a> &uuml;bertragen. Klicken Sie dazu im Men&uuml; <b>Einstellungen</b> auf <a class="external text" href="../../UserGuide/UserGuide/Transfer_User_Files.html"><b>Anwenderdateien &uuml;bertragen</b></a>.  </li>
<li>  Wenn Sie eine Dongle-Lizenz haben, aktualisieren Sie bitte Ihren Dongle nach der Verl&auml;ngerung der Softwarepflege, um sicherzustellen, dass Ihr Dongle f&uuml;r die neueste Version verf&uuml;gbar ist. F&uuml;hren Sie f&uuml;r Ihren Dongle ein Upgrade durch, indem Sie einen <b>Produktschl&uuml;ssel</b> im Dialog <b>Lizenzaktivierung</b> eingeben. Wenn Sie das getan haben, k&ouml;nnen Sie diesen Dongle f&uuml;r eine Origin-Software, die mit der gleichen Seriennummer auf beliebigen anderen Computern installiert ist, verwenden, ohne den Dongle erneut aktivieren zu m&uuml;ssen.</li></ul>
<p><br /> Zuletzt soll darauf hingewiesen werden, dass Origin einige gro&szlig;artige neue Funktionen enth&auml;lt. Weitere Informationen zu den Schl&uuml;sselfunktionen im Versionsvergleich finden Sie unter <a class="external text" href="https://www.originlab.com/VersionComparison" target="_blank"><b>originlab.com/VersionComparison</b></a> auf unserer Webseite.</p>
<h2><a name="Notes_for_Administrators_of_Multi-user_Packages"></a><span class="mw-headline">Hinweise f&uuml;r Administratoren von Lizenzen f&uuml;r mehrere Benutzer</span></h2>
<p><span class="OIndex" style="display:none">Netzwerk, Installation</span><span class="OIndex" style="display:none">Gruppenlizenzen, Node-Locked, rechnergebunden</span><span class="OIndex" style="display:none">Concurrent, Netzwerk</span><span class="OIndex" style="display:none">Netwerk, Concurrent</span><span class="OIndex" style="display:none">Netzwerk, Gruppenlizenzen, rechnergebunden, Node-Locked</span> Die ersten Schritten zur Inbetriebnahme von rechnergebundenen Gruppenlizenzen (Node-Locked) sowie Netzwerklizenzen (Concurrent) werden auf der OriginLab-Webseite (<a class="external text" href="https://www.originlab.com/getstarted" target="_blank"><b>originlab.com/GetStarted</b></a>) beschrieben.</p><p>Zus&auml;tzlich zum InstallShield-Setup, das vom DVD-Startprogramm ausgef&uuml;hrt wird, sind ein MSI-Installationsprogramm und eine Beispieltransformation verf&uuml;gbar. Das MSI-Installationsprogramm eignet sich optimal f&uuml;r die Verwendung von Origin mit Mehrbenutzerlizenzen, da es m&ouml;glich ist, mit ihm eine Origin-Installationspaket f&uuml;r die Softwareverteilung zu erzeugen. Informationen zum MSI-Installationsprogramm und alternative Verteilungsmethoden finden Sie auf unserer Webseite:</p>
<ul><li> <a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter/Installation/Multi-userDeployment/MSIInstall" target="_blank">MSI-Installation</a></li>
<li> <a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter/Installation/Multi-userDeployment/SilentInstall" target="_blank">Stille Installation</a></li>
<li> <a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter/Installation/Multi-userDeployment/BuildanInstallPackage" target="_blank">Ein Installationspaket erzeugen</a></li>
<li> <a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter/Installation/Multi-userDeployment/RemoteAccessServer" target="_blank">Origin auf einem Server mit Remote-Zugriff, wie Windows Terminal Server oder Citrix, installieren</a></li></ul>
<h2><a name="Installing_Origin"></a><span class="mw-headline">Origin installieren</span></h2>
<p>Origin ist eine Windows-Anwendung. Sie k&ouml;nnen Origin auf einem Intel-basierten Mac von <b>Boot Camp</b> aus oder &uuml;ber eine Virtualisierungssoftware durchf&uuml;hren. Weitere Informationen finden Sie auf der OriginLab-Webseite <a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter/Installation/RunOriginonaMac" target="_blank"><b>Origin auf Mac mit Hilfe einer Virtualisierungssoftware</b></a> ausf&uuml;hren.</p><p>Folgende drei Schritte m&uuml;ssen vor der Verwendung von Origin durchgef&uuml;hrt sein:</p>
<ul><li> Installation</li>
<li><a href="#Selecting_a_User_Files_Folder">Ordner f&uuml;r Anwenderdateien ausw&auml;hlen</a></li>
<li><a href="#Licensing_Origin">Lizenzverwaltung</a></li></ul>
<p>Sowohl das Origin-Upgrade als auch die neu erworbenen Produkte werden in einem neuen Programmordner installiert. Origin &uuml;berschreibt die vorherigen Versionen beim Upgrade nicht, so dass Ihre alte Version weiterhin verwendet werden kann. Entsprechend muss Ihre urspr&uuml;ngliche Version nicht installiert sein, wenn das Upgrade ausgef&uuml;hrt wird.</p><p>Das automatische Startprogramm &ouml;ffnet sich, sobald Sie die Origin-DVD einlegen. Es zeigt die Installationsschaltfl&auml;che. Sollte das Startprogramm nicht automatisch ausgef&uuml;hrt werden, k&ouml;nnen Sie auf der DVD selbst die Datei <a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter/Installation/DirectInstall" target="_blank">setup.exe ausf&uuml;hren</a>.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Origin_Installation_and_Startup/Alert_icon.png" width="57"  border="0" /></td><td><p>Bitte beachten Sie, dass <b>Origin</b> und <b>OriginPro 2023</b> nur als <b>64-Bit</b>-Versionen verf&uuml;gbar sind.</p>
	</td>
	</tr>
	</table>
<h3><a name="How_to_Proceed_if_You_Already_Have_the_Origin_Trial_Version_Installed"></a><span class="mw-headline">Vorgehensweise bei bereits installierter Demoversion von Origin</span></h3>
<p>Wenn Sie bereits die Demoversion von Origin auf Ihrem Computer installiert haben, k&ouml;nnen Sie diese Version in ein vollwertiges Produkt oder ein Upgrade umwandeln.</p>
<ul><li> Wenn Sie das Origin-Paket mit rechnergebundener Lizenzverwaltung (Node-Locked) erworben haben, f&uuml;hren Sie Origin aus und w&auml;hlen Sie <b>Hilfe: Demoversion in Produkt umwandeln</b> oder verwenden Sie <b>Hilfe: Lizenz aktivieren</b>, klicken Sie auf die entsprechende Option, falls Sie bereits gekauft haben, und w&auml;hlen Sie <b>F&uuml;r diesen Computer aktivieren</b>. In beiden F&auml;llen werden Sie gebeten, den <a class="external text" href="../../License/Category/Single-User_Node-Locked_License(License).html#Get_Product_Key"><b>Produktschl&uuml;ssel</b></a> einzugeben, der bei der Registrierung Ihres Softwarekaufs auf originlab.com erzeugt wurde.</li>
<li> F&uuml;hren Sie f&uuml;r alle anderen Lizenzverwaltungsmodelle das Programm <b>Origin Dateien hinzuf&uuml;gen oder entfernen</b> aus, das sich im Origin-Programmordner befindet, oder f&uuml;hren Sie erneut den Origin-Installationsassistenten aus (beide erfordern eine Anmeldung &uuml;ber ein Konto mit Administratorrechten). Wenn das Setup von Origin aufgerufen wurde, w&auml;hlen Sie die Option <b>Programm &auml;ndern</b> und dann <b>Produkt installieren (erfordert Seriennummer)</b>.</li></ul>
<h3><a name="How_to_Correct_or_Change_your_Serial_Number_After_you_Complete_an_Installation"></a><span class="mw-headline">Ihre Seriennummer nach Fertigstellen einer Installation korrigieren und &auml;ndern</span></h3>
<p>Sollten Sie Origin mit einer falschen Seriennummer installiert haben, k&ouml;nnen Sie diese korrigieren, indem Sie das Programm <b>Origin Dateien hinzuf&uuml;gen und entfernen</b> ausf&uuml;hren, das sich im Origin-Programmordner befindet, oder indem Sie erneut den Origin-Installationsassistenten ausf&uuml;hren (beides erfordert die Anmeldung &uuml;ber ein Konto mit Administratorrechten). Wenn das Setup von Origin aufgerufen wurde, w&auml;hlen Sie die Option <b>Programm &auml;ndern</b> und klicken Sie dann auf <b>Ja</b>, um Ihre Seriennummer zu &auml;ndern.</p>
<h2><a name="Selecting_a_User_Files_Folder"></a><span class="mw-headline">Ordner f&uuml;r Anwenderdateien ausw&auml;hlen</span></h2>
<p><span class="OIndex" style="display:none">Anwenderdateiordner (UFF)</span> Jeder angemeldete Windows-Benutzer muss &uuml;ber einen <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html">Anwenderdateiordner (UFF)</a> zum Speichern der Origin-Anwenderdaten verf&uuml;gen:</p>
<ul><li> Wenn Sie von Origin 2018 oder einer h&ouml;heren Version ein Upgrade durchf&uuml;hren, bleibt der Speicherort Ihres Anwenderdateiordners unver&auml;ndert.</li>
<li> Wenn Sie ein Upgrade von Origin 2017 oder fr&uuml;her durchf&uuml;hren, werden Sie aufgefordert, einen Speicherort f&uuml;r einen neuen Anwenderdateiordner auszuw&auml;hlen. Der Pfad, den Sie ausw&auml;hlen, muss sich von dem Ihres alten Anwenderdateiordners unterscheiden. </li>
<li> Um den Inhalt Ihres alten Anwenderdateiordners und Ihre Symbolleisten- und Arbeitsbereichskonfigurationen in den neuen Anwenderdateiordner zu &uuml;bertragen, f&uuml;hren Sie die Origin-Software aus und w&auml;hlen Sie <b>Einstellungen</b>: <b><span class="OIndex">Anwenderdateien &uuml;bertragen</span></b>. Weitere Informationen finden Sie unter <a class="external text" href="../../UserGuide/UserGuide/Transfer_User_Files.html">Anwenderdateien &uuml;bertragen</a>.</li></ul>
<p><br /> <i><b>Beachten Sie folgende Punkte beim Ausw&auml;hlen Ihres Anwenderdateiordners:</b></i></p>
<ul><li> Falls Sie &uuml;ber einen mobilen Computer verf&uuml;gen, empfiehlt es sich, einen Anwenderdateiordner auf Ihrem Computer anstatt auf Ihrem Netzwerk auszuw&auml;hlen.</li>
<li> F&uuml;r nicht-mobile Computer k&ouml;nnen Sie diesen Speicherort auf dem Computer oder Netzwerk ausw&auml;hlen, sofern Sie einen stabilen Zugriff auf den Ordner haben. <span class="OIndex" style="display:none">Netzwerk, Installation</span> </li>
<li> W&auml;hlen Sie nicht den gleichen Anwenderdateiordner wie andere Origin-Benutzer. Um zu erfahren, wie Sie benutzerdefinierte Dateien mit anderen Origin-Benutzern teilen, lesen Sie bitte das Kapitel <a href="../../GettingStarted/OriginLab/Sharing_Origin_Files.html" title="OriginLab:Sharing Origin Files">Origin-Dateien gemeinsam nutzen</a> in diesem Handbuch.</li></ul>
<p>Jedes Mal, wenn Origin gestartet wird, pr&uuml;ft das Programm, ob auf Ihren Anwenderdateiordner zugegriffen werden kann. Wenn Origin keine Verbindung zu ihm herstellen kann, werden Sie aufgefordert, einen neuen Speicherort f&uuml;r den Anwenderdateiordner auszuw&auml;hlen. Beachten Sie, dass Sie Ihren Anwenderdateiordner jederzeit &auml;ndern k&ouml;nnen, wenn Sie Origin ausf&uuml;hren. Klicken Sie im Men&uuml; <b>Einstellungen</b> auf <b>Optionen</b> und dann auf die Registerkarte <b>Systempfad</b>.</p>
<h2><a name="Licensing_Origin"></a><span class="mw-headline">Origin lizenzieren</span></h2>
<p>Alle Origin-Produkte enthalten ihre eigene Lizenzverwaltung. Der Typ der von Ihnen erworbenen Lizenz wird mit dem Kauf der Software festgelegt.</p>
<h3><a name="Node-locked"></a><span class="mw-headline">Rechnergebundene Einzel-/Gruppenlizenzen (Node-Locked)</span></h3>
<p><span class="OIndex" style="display:none">Lizenz, rechnergebunden, Node-Locked</span> Jeder Origin-Computer erfordert eine individuelle Lizenz zum Ausf&uuml;hren von Origin. Die Lizenz kann von der OriginLab-Webseite durch Eingabe eines <b>Produktschl&uuml;ssels</b> im Dialog <b>Lizenzaktivierung</b> abgerufen werden, wenn Sie Origin &ouml;ffnen. Es sind Anweisungen im Dialog f&uuml;r Computer ohne Internetzugang verf&uuml;gbar.</p>
<h3><a name="Concurrent_Network"></a><span class="mw-headline">Netzwerklizenz (Concurrent)</span></h3>
<p>|<span class="OIndex" style="display:none">Lizenz, Concurrent-Netzwerk</span><span class="OIndex" style="display:none">Netzwerk, Installation</span><span class="OIndex" style="display:none">Concurrent, Netzwerk</span><span class="OIndex" style="display:none">Netzwerk, Concurrent</span><span class="OIndex" style="display:none">FLEXnet</span> Jeder Origin-Computer muss mit einem FLEXnet-Lizenzdienst verbunden sein, um Origin auszuf&uuml;hren. Ihre IT-Abteilung oder Ihr Origin-Administrator installiert einen FLEXnet-Lizenzserver, der von OriginLab bereit gestellt wird (verf&uuml;gbar auf der Origin-DVD), erh&auml;lt eine Lizenz f&uuml;r diesen Server von der OriginLab-Webseite und richtet dann einen Lizenzdienst ein. Der Lizenzdienst z&auml;hlt und begrenzt die Anzahl von Origin-Computern, die parallel ausgef&uuml;hrt werden k&ouml;nnen. Weitere Informationen finden Sie im Hilfecenter auf der Webseite von OriginLab (<a class="external text" href="https://www.originlab.com/index.aspx?go=Support/DocumentationAndHelpCenter" target="_blank"><b>originlab.com/HelpCenter</b></a>).</p>
<h3><a name="Dongle"></a><span class="mw-headline">Dongle</span></h3>
<p><span class="OIndex" style="display:none">Lizenz, Dongle</span> Ein Dongle (USB-Hardwareschl&uuml;ssel) wird mit dem Origin-Paket der Dongle-Lizenz geliefert und muss im USB-Anschluss des Computers vorhanden sein, um Origin auszuf&uuml;hren. Seit Origin 2019 k&ouml;nnen Dongle parallel installiert werden.</p>
<h2><a name="Registering_Origin"></a><span class="mw-headline">Origin registrieren</span></h2>
<p><span class="OIndex" style="display:none">Origin, Registrieren</span> Das Registrieren von Origin ist eine Voraussetzung f&uuml;r den Origin-Support durch OriginLab und durch das Team der Origin-Vertriebspartner. Die Registrierung aktiviert auch Origins Men&uuml;befehl <b>Nach Updates suchen</b> (<b>Hilfe: Nach Updates suchen</b>), &uuml;ber den Sie Patches und Updates der Hilfedateien direkt von Ihrer Software aus erhalten. Zus&auml;tzlich machen es Origins Dialoge <b>App-Center</b> und <b>Vorlagencenter</b>, die direkten Zugriff auf Apps und Vorlagen und deren Updates von der Origin-Software aus haben, erforderlich, dass Ihre Installation registriert ist.</p><p>F&uuml;r <b>Node-Locked</b>-Lizenzen (rechnergebunden) wird die Registrierung automatisch abgeschlossen, wenn Sie einen <b>Produktschl&uuml;ssel</b> im Dialog Lizenzaktivierung eingeben, der sich beim Start von Origin &ouml;ffnet. Um zu pr&uuml;fen, ob Sie registriert sind, klicken Sie auf <b>&Uuml;ber Origin</b> im Men&uuml; <b>Hilfe</b>. Der Dialog sollte die <b>Registration ID</b> anzeigen, die Ihrer Origin-Installation zugewiesen ist.</p>
<dl><dd><a  class="image"><img alt="About Origin RegID.png" src="../images/Origin_Installation_and_Startup/About_Origin_RegID.png" width="377"  /></a></dd></dl>
<p>Bei allen anderen Lizenzverwaltungsmodellen &ouml;ffnen Sie Origin und w&auml;hlen Sie <b>Online-Registrierung</b> im Men&uuml; <b>Hilfe</b>, um den Dialog <b>Registrierung</b> zu &ouml;ffnen. Verwenden Sie den Dialog f&uuml;r die Registrierung zum Registrieren Ihrer Origin-Installation auf der Webseite von OriginLab. W&auml;hrend dieses Vorgangs wird eine <b>Registration ID</b> vergeben. Geben Sie diese ID in den Dialog zur Registrierung ein oder kopieren und f&uuml;gen Sie sie ein, um den Vorgang abzuschlie&szlig;en. Der Dialog <b>&Uuml;ber Origin</b> zeigt jetzt Ihre Registration ID an.</p>
<h2><a name="Maintenance"></a><span class="mw-headline">Softwarepflege</span></h2>
<p><span class="OIndex" style="display:none">Lizenz, Softwarepflege</span> Die meisten Origin-Lizenzen werden inklusive des ersten Jahres <a class="external text" href="https://www.originlab.com/index.aspx?go=PURCHASE/Maintenance" target="_blank">Softwarepflege</a> verkauft. Die Softwarepflege bietet Ihnen kostenfreie Origin-Upgrades und kann auch bevorrechtigten technischen Support, Rabatte auf Origin-Schulungen und Beratungen sowie eine Home-Use-Lizenz beinhalten.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Origin_Installation_and_Startup/Tip_icon.png" width="57"  border="0" /></td><td><p>Kunden mit Softwarepflege sollten eine Nachricht mit ihrer Berechtigung auf ein kostenloses Upgrade erhalten, wenn sie <b>Hilfe: Hilfedateien erhalten/Nach Updates suchen</b> w&auml;hlen.</p></td></tr></table>
<ul><li> Um zu &uuml;berpr&uuml;fen, ob Ihre Origin-Lizenz Softwarepflege enth&auml;lt, w&auml;hlen Sie im Men&uuml; <b>Hilfe</b> die Option <b>&Uuml;ber Origin</b>. Sollte Ihre Lizenz Softwarepflege enthalten, zeigt der Dialog &Uuml;ber Origin das Ablaufdatum Ihrer Softwarepflege an. </li>
<li> Um sich &uuml;ber weitere <a class="external text" href="https://www.originlab.com/index.aspx?go=PURCHASE/Maintenance" target="_blank">Vorteile der Softwarepflege</a> zu informieren, wenden Sie sich bitte an OriginLab oder Ihren lokalen Origin-Vertriebspartner.</li>
<li> Wenn das Ablaufdatum Ihrer Softwarepflege naht, zeigt Origin eine Ablaufmeldung an mit einem Link zur Webseite von OriginLab, wo Sie erfahren, wie Sie die Softwarepflege verl&auml;ngern k&ouml;nnen. Dieser Erinnerungsmeldung weist ein Kontrollk&auml;stchen auf, dessen Aktivierung eine fortw&auml;hrende Anzeige verhindert.</li></ul>
<h2><a name="Service_Releases"></a><span class="mw-headline">Service Releases</span></h2>
<p><span class="OIndex" style="display:none">Origin, Service Releases</span> Im Rahmen einer Origin-Version ver&ouml;ffentlicht OriginLab kostenfreie Service Releases (so genannte Patches). Ein Service Release enth&auml;lt normalerweise Fehlerbehebungen und kann kleinere Verbesserungen umfassen. Alle Kunden sind eingeladen, Service Releases anzuwenden, um sicherzustellen, dass ihre Origin-Software korrekt durchgef&uuml;hrt wird. Um zu pr&uuml;fen, ob ein Patch verf&uuml;gbar ist, w&auml;hlen Sie <b>Nach Updates suchen</b> im Men&uuml; <b>Hilfe</b>. Patches sind auch &uuml;ber den Support-Bereich der Webseite von OriginLab (<a class="external text" href="https://www.originlab.com/index.aspx?go=SUPPORT" target="_blank"><b>originlab.com/Support</b></a>) erh&auml;ltlich.</p>
<h2><a name="Notification_of_Upgrade"></a><span class="mw-headline">Benachrichtigung &uuml;ber Upgrade</span></h2>
<p>OriginLab ver&ouml;ffentlicht regelm&auml;&szlig;ig eine neue Version von Origin mit Funktionen und Verbesserungen, die auf dem Feedback von Kunden basieren. Kunden mit Softwarepflege sind berechtigt - und aufgefordert -, die aktuelle Version von Origin zu verwenden. Nach dem Release einer neuen Version benachrichtigen OriginLab und Vertriebspartner die Kunden mit Softwarepflege per E-Mail. Um jedoch sicher zu stellen, dass Sie &uuml;ber ein neues Versionsrelease informiert werden, registrieren Sie sich bitte auf der Webseite von OriginLab (<a class="external text" href="https://www.originlab.com" target="_blank"><b>originlab.com</b></a>), wenn Sie nicht bereits einen Account haben, und aktivieren Sie das Kontrollk&auml;stchen in Ihrem Anwenderprofil, um &quot;Produkt-Updates&quot; zu erhalten.</p>
<dl><dd><a  class="image"><img alt="Upgrading Origin Version.png" src="../images/Origin_Installation_and_Startup/Upgrading_Origin_Version.png" width="524"  /></a></dd></dl>
<h2><a name="Setting_the_Origin_Display_Language"></a><span class="mw-headline">Die Sprache von Origin festlegen</span></h2>
<p><span class="OIndex" style="display:none">Origin, Sprache</span> Origin-Produkte, die an Unternehmen in einer begrenzten Anzahl von L&auml;ndern, einschlie&szlig;lich Japan, Deutschland, Schweiz, &Ouml;sterreich, Liechtenstein und China, verkauft werden, kann die Softwaresprache entweder Englisch oder Japanisch, Deutsch bzw. Chinesisch sein. Um die Sprachsteuerung aufzurufen, w&auml;hlen Sie <b>Sprache &auml;ndern</b> im Men&uuml; <b>Hilfe</b>.</p>
<h2><a name="System_Transfers_-_Deactivating_a_License"></a><span class="mw-headline">System&uuml;bertragung - Eine Lizenz deaktivieren</span></h2>
<p><span class="OIndex" style="display:none">Lizenz, System&uuml;bertragungen</span> <span class="OIndex" style="display:none">Origin, System&uuml;bertragungen</span> <span class="OIndex" style="display:none">Origin, Lizenzdeaktivierung</span></p>
<h3><a name="Node-locked_Licenses_.28Computer_ID-based.29"></a><span class="mw-headline">Rechnergebundene Lizenzen (basierend auf Computer-ID)</span></h3>
<p>Eine System&uuml;bertragung ist erforderlich, wenn Sie vorhaben, Ihren Computer, auf dem Origin lizenziert ist, durch einen anderen Computer zu ersetzen.</p>
<ul><li> Falls Origin weiterhin auf Ihrem alten Computer verwendet werden kann:</li></ul>
<p>&Ouml;ffnen Sie Origin und w&auml;hlen Sie <b><span class="OIndex">Lizenz deaktivieren</span></b> im Men&uuml; <b>Hilfe</b>. Nach erfolgreicher Deaktivierung wird Ihre Computer-ID vom OriginLab-Server entfernt, so dass Sie die Lizenz auf einem anderen Computer installieren und aktivieren k&ouml;nnen.</p>
<ul><li> Falls Ihr Computer, der f&uuml;r Origin lizenziert ist, nicht mehr zur Verf&uuml;gung steht:</li></ul>
<ol><li> Melden Sie an Ihrem Portal auf www.originlab.com an.</li>
<li> Klicken Sie unter <b>Lizenzierung</b> auf den Link <b>Meine Lizenz(en) verwalten</b>.</li>
<li> Klicken Sie auf die <b>Seriennummer</b>, die mit der Lizenz, die Sie deaktivieren m&ouml;chten, verbunden ist.</li>
<li> Klicken Sie auf den Link <b>Los</b> in der Spalte <b>Deaktivierung</b>. <span class="OIndex" style="display:none">System&uuml;bertragung</span></li></ol>
<h3><a name="Concurrent_Networks"></a><span class="mw-headline">Netzwerklizenzen (Concurrent)</span></h3>
<p>Eine System&uuml;bertragung ist nur erforderlich, wenn Sie den FLEXnet-Lizenzserver ersetzen m&uuml;ssen. Sie ist nicht erforderlich, wenn ein Origin-Computer ersetzt wird.</p><p>Um eine Ersatzlizenzdatei f&uuml;r den FLEXnet-Server zu erhalten, f&uuml;llen Sie das <a class="external text" href="https://www.originlab.com/restricted/Login.aspx?ReturnUrl=%2frestricted%2fSystem_Transfer.aspx" target="_blank">&quot;Anfrageformular f&uuml;r System&uuml;bertragung&quot;</a> (System Transfer Request Form) im Support-Bereich der Webseite von OriginLab aus.</p>
<h2><a name="Uninstalling_Origin"></a><span class="mw-headline">Origin deinstallieren</span></h2>
<p><span class="OIndex" style="display:none">Origin, deinstallieren</span> Um Origin zu deinstallieren, f&uuml;hren Sie das Programm <b>Origin Dateien hinzuf&uuml;gen oder entfernen</b> aus, das sich im Origin-Programmordner befindet, oder verwenden Sie das <b>Deinstallationsprogramm</b> von Windows. In beiden F&auml;llen zeigt Ihnen das Origin-Setup die Optionen <b>Programm &auml;ndern</b>, <b>Programm entfernen</b> oder <b>Programm reparieren</b>. W&auml;hlen Sie die Option<b> Programm entfernen</b> und beenden Sie den Assistenten wie aufgefordert.</p><p>Das Programm zum <b>Entfernen</b> l&ouml;scht alle Ordner und Dateien, die durch das Origin Setup installiert wurden. Es l&ouml;scht auch die in der Windows Registry vom Installationsprogramm erstellten Verzeichnisse und Schl&uuml;ssel.</p>


    