<h1 class="firstHeading">Programmieren in Origin</h1><p class='urlname' style='display: none'>Programming-in-Origin</p>
<p><br /></p>
<dl><dd><a  class="image"><img alt="Programming image connectivity.png" src="../images/Programming_in_Origin/Programming_image_connectivity.png" width="637"  /></a></dd></dl>
<p>Sobald Sie mit Origin vertraut werden und Ihre Verwendung der Software sich ausweitet, m&ouml;chten Sie vielleicht programmatisch auf bestehende Funktionen in Origin zugreifen oder Ihre eigenen benutzerdefinierten Routinen und Hilfsmittel hinzuf&uuml;gen oder von anderen Anwendungen aus mit Origin kommunizieren. Dieses Kapitel gibt einen &Uuml;berblick &uuml;ber die Programmieroptionen, die Origin zur Verf&uuml;gung stellt. Weitere Informationen finden Sie in den folgenden programmierungsrelevanten Quellen:</p>
<ul><li> Die Dokumentation zur Programmierung umfasst Anleitungen sowie Sprachreferenzen. Dar&uuml;ber hinaus sind Beispiele im Men&uuml; <b>Hilfe</b> der Software bereit gestellt. </li>
<li> Eine Programmierungsdokumentation ist online verf&uuml;gbar unter <b>www.originlab.com/doc</b>. </li>
<li> Sie k&ouml;nnen die Online-Seiten zur Programmierung schnell finden, indem Sie eine Websuche &uuml;ber Ihren Browser durchf&uuml;hren und dabei nach Stichw&ouml;rtern wie <b>labtalk importing</b>, <b>originc interpolate</b> oder <b>labview origin send data</b> suchen.</li>
<li> Unter <b>www.originlab.com/forum</b> steht ein Forum zu Fragen der Origin-Programmierung zur Verf&uuml;gung.</li>
<li> Sample-Dateien f&uuml;r LabTalk, Python, COM-Server sowie Client etc. befinden sich in dem Ordner \Samples Ihrer Origin-Software.</li></ul>
<p><span class="OIndex" style="display:none">In Origin programmieren</span></p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#LabTalk"><span class="tocnumber">1</span> <span class="toctext">LabTalk</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Python"><span class="tocnumber">2</span> <span class="toctext">Python</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#R"><span class="tocnumber">3</span> <span class="toctext">R</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#MATLAB"><span class="tocnumber">4</span> <span class="toctext">MATLAB</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#Origin_C"><span class="tocnumber">5</span> <span class="toctext">Origin C</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#X-Function"><span class="tocnumber">6</span> <span class="toctext">X-Funktion</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Automation_Server"><span class="tocnumber">7</span> <span class="toctext">Automatisierungsserver</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#LabVIEW"><span class="tocnumber">8</span> <span class="toctext">LabVIEW</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#Orglab"><span class="tocnumber">9</span> <span class="toctext">Orglab</span></a></li>
</ul>
</div>

<h2><a name="LabTalk"></a><span class="mw-headline">LabTalk</span></h2>
<p><span class="OIndex" style="display:none">Programmierung Origin, LabTalk</span> <span class="OIndex" style="display:none">LabTalk</span> <span class="OIndex" style="display:none">Skript</span></p><p><b>LabTalk</b> ist eine Skriptsprache, die Zugriff auf die meisten Funktionalit&auml;ten in Origin gew&auml;hrt. Mit LabTak ist es m&ouml;glich, auf Eigenschaften von Origin-Objekten wie Arbeitsbl&auml;ttern, Spalten, Diagrammlayern und Diagrammen zuzugreifen und sie zu &auml;ndern. LabTalk-Skript kann sogenannte X-Funktionen einbinden, die eine erweiterte Datenverarbeitung und -analyse durchf&uuml;hren.</p><p>Es gibt viele Optionen zum Ausf&uuml;hren von LabTalk-Skripten. Mehrere Skriptzeilen k&ouml;nnen in einer Datei als Abschnitt strukturiert werden. Diese einzelnen Abschnitte k&ouml;nnen von der Bedienoberfl&auml;che &uuml;ber die Befehlseingabe im <b>Skriptfenster</b> oder <b>Befehlsfenster</b> ausgef&uuml;hrt werden; &uuml;ber Schaltfl&auml;chen, die zu Arbeitsbl&auml;ttern und Diagrammen hinzugef&uuml;gt wurden; &uuml;ber vorhandene oder benutzerdefiniert erstellte Symbolleistenschaltfl&auml;chen; &uuml;ber benutzerdefinierte Men&uuml;befehle.</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Programming_in_Origin/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p>Das folgende &quot;Mini-Tutorial&quot; zeigt, wie Sie ein Schaltfl&auml;chenobjekt zu einem Arbeitsblatt hinzuf&uuml;gen, wie Sie ein kurzes LabTalk -Skript mit der Schaltfl&auml;che verbinden und dann die Schaltfl&auml;che dazu verwenden, das Skript auszuf&uuml;hren und eine grundlegende statistische Berechnung durchf&uuml;hren, w&auml;hrend die Ergebnisse in das Arbeitsblatt geschrieben werden.</p>
<ol>
<li>F&uuml;hren Sie Origin aus und &ouml;ffnen Sie ein neues Projekt, indem Sie auf die Schaltfl&auml;che <b>Neues Projekt</b> <a  class="image"><img alt="Button New Project.png" src="../images/Programming_in_Origin/Button_New_Project.png" width="22"  /></a> auf der Symbolleiste <b>Standard</b> klicken.</li>
<li>Klicken Sie auf <b>Daten: Aus Datei importieren: Einzelnes ASCII</b> und navigieren Sie zur Datei \Samples\Graphing\Box Chart.dat. W&auml;hlen Sie die Datei und klicken auf <b>&Ouml;ffnen</b>. Die Datei wird in das aktive Arbeitsblatt importiert. </li>
<li>W&auml;hlen Sie bei aktivem Arbeitsblattfenster <b>Format: Worksheet</b>. Klicken Sie im Dialog <b>Arbeitsblatteigenschaften</b> auf die Registerkarte <b>Gr&ouml;&szlig;e</b> und legen Sie den <b>Abstand von oben</b> auf <i>25</i>. Klicken Sie dann auf <b>OK</b>. In dem Arbeitsblattfenster wird ein Abstand hinzugef&uuml;gt.</li>
<li>Klicken Sie auf das Hilfsmittel <b>Text einf&uuml;gen</b> auf der Symbolleiste <b>Hilfsmittel</b>. Klicken Sie in den Abstand, den Sie hinzugef&uuml;gt haben, und geben Sie &quot;Beschriftungszeile f&uuml;r Mittelwert hinzuf&uuml;gen&quot; in das Textobjekt ein. Klicken Sie au&szlig;erhalb des Textobjekts, um den Bearbeitungsmodus zu beenden.</li>
<li>Klicken Sie mit der rechten Maustaste auf die Textbeschriftung und w&auml;hlen Sie <b>Eigenschaften</b>. W&auml;hlen Sie die Registerkarte <b>Programmierung</b> unter <b>Kriterien f&uuml;r Skriptausf&uuml;hrung</b> die Option <b>Mausklick</b>. Kopieren und f&uuml;gen Sie das folgende Skript in das Textfeld ein:</li>
<pre class="lt" style="font-family:monospace;">wks.<span style="color: #000080;">userParam1</span> <span style="color: #000080;">=</span> <span style="color: #0000dd;">1</span>; wks.<span style="color: #000080;">userParam1</span><span style="color: #000080;">$</span> <span style="color: #000080;">=</span> <span style="color: #ff00ff;">&quot;Mean&quot;</span>; for <span style="color: #000000;">(</span>int ii <span style="color: #000080;">=</span> <span style="color: #0000dd;">2</span>; ii <span style="color: #000080;">&lt;=</span> wks.<span style="color: #000080;">ncols</span>; ii<span style="color: #000080;">++</span><span style="color: #000000;">)</span> <span style="color: #000000;">{</span> range rr <span style="color: #000080;">=</span> <span style="color: #000080;">$</span><span style="color: #000000;">(</span>ii<span style="color: #000000;">)</span>; Col<span style="color: #000000;">(</span><span style="color: #000080;">$</span><span style="color: #000000;">(</span>ii<span style="color: #000000;">)</span><span style="color: #000000;">)</span><span style="color: #000000;">[</span>D1<span style="color: #000000;">]</span><span style="color: #000080;">$</span> <span style="color: #000080;">=</span> <span style="color: #000080;">$</span><span style="color: #000000;">(</span>mean<span style="color: #000000;">(</span>rr<span style="color: #000000;">)</span>,.2<span style="color: #000080;">*</span><span style="color: #000000;">)</span>; <span style="color: #000000;">}</span></pre>
<li>Klicken Sie auf <b>OK</b>, um die Einstellungen anzuwenden und den Dialog <b>Textobjekt</b> zu schlie&szlig;en. Beachten Sie, dass Ihr Textobjekt jetzt wie eine Schaltfl&auml;che aussieht.</li>
<li>Klicken Sie auf die Schaltfl&auml;che. Beachten Sie, dass eine neue Kopfzeile mit der Beschriftung &quot;Mittelwert&quot; zu dem Arbeitsblatt hinzugef&uuml;gt wurde und der Mittelwert von jeder Datenspalte in die Zelle &uuml;ber der entsprechenden Spalte geschrieben wird.</li>
</ol>
</td></tr></table>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zu LabTalk, Origins Skriptsprache, erhalten Sie in Ihrer Produktdokumentation unter <strong><a class="external text" href="../../LabTalk/Category/LT_Guide.html">Hilfe: Programmierung: LabTalk</a></strong>.</p><p>Die Sample-Dateien befinden sich im Ordner \Samples\LabTalk Script Examples Ihrer Origin-Software.</p>
</td></tr></table>
<h2><a name="Python"></a><span class="mw-headline">Python</span></h2>
<p><span class="OIndex" style="display:none">Programmierung Origin, Python</span><span class="OIndex" style="display:none">PyOrigin Modul</span><span class="OIndex" style="display:none">Python</span></p><p>Origin enth&auml;lt eine eingebettete Python-Umgebung, so dass Sie die M&ouml;glichkeit haben, Python in Origin auszuf&uuml;hren. Origin unterst&uuml;tzt die Ausf&uuml;hrung der Befehlszeile des Python-Codes von der <b>Python-Konsole</b> oder von Origins integrierter Entwicklungsumgebung <b>Code Builder</b> aus. Seit Dezember 2022 ist die eingebettete Python-Version <a class="external text" href="https://www.python.org/downloads/" target="_blank">3.11</a>.</p>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zur integrierten Verwendung von Origin und Python finden Sie in der Python-Dokumentation:</p>
<ul><li> <a class="external text" href="../../Python/Category/Python_(Python).html"><b>Einf&uuml;hrung zu Python in Origin</b></a></li>
<li> <a class="external text" href="../../Python/Python/RunPython_(Python).html"><b>Eingebettetes Python</b></a></li>
<li> <a class="external text" href="../../Python/Python/Sample_Projects_with_Attached_Python_Codes.html"><b>Beispielprojekte mit angeh&auml;ngtem Python-Code</b></a></li></ul>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Programming_in_Origin/Tip_icon.png" width="57"  border="0" /></td><td><ul><li>Es gibt eine API zum Aufrufen von Origin von Python aus. Siehe Hinweis unten unter <b>Automatisierungsserver</b>.</li>
<li>Um Konflikte zwischen den Paketversionen zu vermeiden, unterst&uuml;tzt Origin jetzt mehrere PyPackage-Ordner (stellen Sie die Systemvariable <b>@PYP</b> ein).</li></ul>
</td></tr></table>
<h2><a name="R"></a><span class="mw-headline">R</span></h2>
<p><span class="OIndex" style="display:none">Programmieren in Origin, R</span><span class="OIndex" style="display:none">R</span> Origin unterst&uuml;tzt das Ausf&uuml;hren von R-Befehlen in der Origin-Umgebung. Sie k&ouml;nnen R-Befehle im Skriptfenster oder &uuml;ber die integrierte R-Konsole ausf&uuml;hren oder Sie k&ouml;nnen .R-Dateien ausf&uuml;hren. Alle Release von R bis zur Version <b>3.6</b> werden unterst&uuml;tzt.</p><p>Von Origin aus gibt es zwei M&ouml;glichkeiten, eine Verbindung mit R herzustellen:</p>
<ul><li><a class="external text" href="../../UserGuide/UserGuide/R_Console.html"><b>R</b></a>. Installiert auf Ihrem lokalen Computer. </li>
<li><a class="external text" href="../../UserGuide/UserGuide/R_Server.html"><b>Rserve</b></a>. Installiert auf einem Fern-PC.</li></ul>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zum Integrieren von Origin und R finden Sie in der Origin-Hilfedatei (<a class="external text" href="../../UserGuide/UserGuide/R_Console.html"><b>R-Konsole</b></a> und <a class="external text" href="../../UserGuide/UserGuide/R_Server.html"><b>Rserve-Konsole</b></a>) und in der LabTalk-Anleitung (<a class="external text" href="../../LabTalk/Category/LT_Running_R_in_Origin.html"><b>Running R in Origin</b></a>, <a class="external text" href="../../LabTalk/LabTalk/R_(object).html"><b>R Objects</b></a>, <a class="external text" href="../../LabTalk/LabTalk/Rserve_(object).html"><b>Rserve Objects</b></a>).</p><p>Die Sample-Dateien befinden sich im Ordner \Samples\R Ihrer Origin-Software.</p>
</td></tr></table>
<h2><a name="MATLAB"></a><span class="mw-headline">MATLAB</span></h2>
<p>Die MATLAB-Konsole erlaubt Origin-Anwendern, MATLAB-Befehle von Origin aus auszuf&uuml;hren und Daten zwischen den beiden Anwendungen entweder mit Hilfe einer grafischen Oberfl&auml;che oder durch eine Befehlszeile zu &uuml;bertragen.</p>
<ul><li> Die Konsole macht es erforderlich, dass sowohl Origin als auch MATLAB auf dem gleichen Rechner installiert sind. </li>
<li> Origin unterst&uuml;tzt auch das Importieren von MATLAB-Dateien (MAT) von der Festplatte. Es gibt zwei Importroutinen, die &auml;ltere Routine mit <a class="external text" href="../../UserGuide/UserGuide/Importing_Third_Party_Files.html"><b>Daten: Aus Datei importieren</b></a> und die neue konnektor-basierte mit <a class="external text" href="../../UserGuide/UserGuide/Connecting_to_File.html#JSON.5CMATLAB_file"><b>Daten: Mit Datei verbinden: MATLAB</b></a>. F&uuml;r das Importieren von MAT-Dateien muss MATLAB <i>nicht</i> installiert sein.</li></ul>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zur MATLAB-Konsole finden Sie in der Origin-Hilfe (<a class="external text" href="../../UserGuide/Category/MATLAB_console.html"><b>MATLAB Console</b></a>.</p><p>Der Unterordner <i>Origin-Programmordner </i>&gt;\Samples\COM Server and Client\MATLAB enth&auml;lt ein Beispiel (CreatePlotInOrigin.m, CreatePlotInOrigin.OPJ), das darstellt, wie von einem  MATLAB-Client aus eine Verbindung zu einem COM-Server von Origin hergestellt wird (erfordert MATLAB).</p>
</td></tr></table>
<h2><a name="Origin_C"></a><span class="mw-headline">Origin C</span></h2>
<p><span class="OIndex" style="display:none">Programmieren in Origin, Origin C</span> <span class="OIndex" style="display:none">NAG Numerical Library</span> <b>Origin C</b> ist eine anspruchsvolle Programmiersprache mit vollem Funktionsumfang, basierend auf der Syntax der ANSI C-Programmiersprache. <span class="OIndex">Origin C</span> unterst&uuml;tzt au&szlig;erdem eine Anzahl von C++-Funktionen und einige C#-Funktionen. Origin C bietet vollen Zugriff auf alle Funktionalit&auml;ten von Origin, einschlie&szlig;lich der Bereiche Datenimport, Datenbearbeitung, grafische Darstellung, Analyse und Export. Sie k&ouml;nnen mit Hilfe von LabTalk-Skript &uuml;ber die Elemente der Bedienoberfl&auml;che wie Schaltfl&auml;chen, Symbolleisten und Men&uuml;elemente auf Origin-C-Funktionen zugreifen.</p><p>Origin C-Code ist als eine Zusammenstellung von Funktionen organisiert, die das Weitergeben von Argumenten unterst&uuml;tzt. Origin C-Funktionen werden in Objektcode kompiliert, dann geladen und innerhalb von Origin ausgef&uuml;hrt. Origin C bietet gesteigerte Zuverl&auml;ssigkeit und Verwaltbarkeit f&uuml;r die Entwicklung und Fehlerbehebung von Code mit gr&ouml;&szlig;erem Umfang und gr&ouml;&szlig;erer Komplexit&auml;t.</p><p>Dar&uuml;ber hinaus bietet Origin C auch Zugriff auf die Funktionen der <b>NAG Numerical Library</b>, die in Ihrer Origin-Installation eingeschlossen ist. NAG-Funktionen bieten Ihnen eine gro&szlig;e Auswahl von Algorithmen zur Durchf&uuml;hrung von Berechnungen, die von einfachen Statistiken und Fourier-Transformationen bis hin zu linearer Algebra und multivariaten Analysen reichen. Origin unterst&uuml;tzt aktuell die NAG-Library-Version <b>Mark 26.1</b>.</p>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zu Origin C finden Sie in der Origin-C-Dokumentation:</p><p><b>Hilfe: Programmierung: <a class="external text" href="../../OriginC/Category/Origin_C_Programming_Guide.html">Origin C</a></b></p><p>Dort k&ouml;nnen Sie Informationen zur Verwendung nachlesen. Au&szlig;erdem stehen Ihnen eine Sprachreferenz, Entwicklernotizen, Beispiele etc. zur Verf&uuml;gung.</p><p>Die Beispieldateien befinden sich im Ordner \Samples\Origin C Examples Ihrer Origin-Software.</p>
</td></tr></table>
<h2><a name="X-Function"></a><span class="mw-headline">X-Funktion</span></h2>
<p><span class="OIndex" style="display:none">X-Funktionen</span><span class="OIndex" style="display:none">Programmieren in Origin, X-Funktionen</span> Eine X-Funktion ist eine in sich geschlossene XML-Datei, die in Origin als spezieller Typ einer globalen Funktion geladen werden kann. Origin C ist die Sprache, die zum Erstellen von X-Funktionen verwendet wird. X-Funktionen bieten Anwendern eine M&ouml;glichkeit, die Funktionalit&auml;t von Origin zu erweitern, indem benutzerdefinierte Datenverarbeitungsfunktionen hinzugef&uuml;gt werden. Viele der Standardhilfsmittel in Origin basieren auf X-Funktionen. Sobald eine X-Funktion erstellt wurde, k&ouml;nnen Sie von jeder Stelle Ihrer Bedienoberfl&auml;che aus, die Skriptausf&uuml;hrung zul&auml;sst, wie z.B. das Skriptfenster, Symbolleistenschaltfl&auml;chen oder benutzerdefinierte Men&uuml;s, auf sie zugreifen.</p>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zu X-Funktionen finden Sie in Ihrer Produktdokumentation, die mit Ihrer Software zusammen installiert ist:</p><p><b>Hilfe: Programmierung: <a class="external text" href="../../XFunction/Category/X-Function_Programming_Guide.html">X-Funktionen</a></b></p><p>Dort sind Informationen zur Erstellung und Verwendung von X-Funktionen, eine Sprachreferenz sowie Tutorials zusammengetragen.</p>
</td></tr></table>
<h2><a name="Automation_Server"></a><span class="mw-headline">Automatisierungsserver</span></h2>
<p><span class="OIndex" style="display:none">Automatisierungsserver, Origin als</span><span class="OIndex" style="display:none">Visual Basic/Visual C/C#</span> <span class="OIndex" style="display:none">Excel</span> Origin kann als <b>Automatisierungserver</b> verwendet werden. Client-Applikationen wie National Instruments™ <b>LabVIEW™</b>, Microsoft <b>Excel</b>, <b>Python</b> oder benutzerdefinierte VB/VC/C#-Anwendungen k&ouml;nnen mit Origin Daten austauschen und auch Befehle senden, die in Origin ausgef&uuml;hrt werden.</p>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zu Origins Funktionalit&auml;t als Automatisierungsserver erhalten SIe in der Produktdokumentation, die zusammen mit Ihrer Origin-Software installiert ist:</p><p><b>Hilfe: Programmierung: <a class="external text" href="AutomationServer.chm::/Category/COM_Server.html">Automatisierungsserver</a></b></p><p>Es stehen Beispiele und eine Sprachreferenz zur Verf&uuml;gung. Die Beispieldateien befinden sich im Ordner \Samples\COM Server and Client Ihrer Origin-Software.</p>
</td></tr></table>
<h2><a name="LabVIEW"></a><span class="mw-headline">LabVIEW</span></h2>
<p><span class="OIndex">National Instruments™ LabVIEW™</span> ist eine g&auml;ngige Anwendung zum Sammeln von Daten. Viele Hersteller von Instrumenten und Sensoren bieten beispielsweise <span class="OIndex">LabVIEW</span><span class="OIndex HasShownIndex" style="display:none">LabVIEW™</span>-Treiber, um an Daten zu gelangen. Sobald die Daten erfasst sind, muss der Endanwender die Daten grafisch darstellen und analysieren sowie Berichte zur Pr&auml;sentation erzeugen. Origin bietet eine leistungsstarke Datenanalyse und Hilfsmittel f&uuml;r die grafische Darstellung, einschlie&szlig;lich die Option, Analysevorlagen zu erstellen, um neu erfasste Daten anhand der Einstellungen einer wiederholten Analyse zu analysieren. Die M&ouml;glichkeit der Kommunikation zwischen LabVIEW und Origin kann daher die Effizienz der Analyse und Pr&auml;sentation nach der Datenerfassung enorm verbessern.</p><p>Origin wird mit einer Reihe von LabVIEW Sub-VIs ausgeliefert. LabVIEW-Anwender k&ouml;nnen diese benutzerdefinierten Sub-VIs einfach in ihrer Hauptapplikation von LabVIEW integrieren, um nahtlos mit Origin zu kommunizieren.</p>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Weitere Informationen zur Konnektivit&auml;t von Origin und LabVIEW finden Sie in der Produktdokumentation, die mit Ihrer Origin-Software installiert ist:</p><p><b>Hilfe: <a class="external text" href="CustomVIsForLabVIEW.chm::/Category/LabVIEW_VI.html">LabVIEW VI</a></b></p><p>Es werden Beispiele und Tutorials bereit gestellt.</p>
</td></tr></table>
<p><br /></p>
<h2><a name="Orglab"></a><span class="mw-headline">Orglab</span></h2>
<p><span class="OIndex">Orglab</span> ist eine frei verteilte Komponenten-DLL zum direkten Erstellen oder Lesen von Origin-Projekten (.opj) und anderen Origin-Dateitypen (.ogg, .ogw und .ogm). Sie ist als kostenfreier Download verf&uuml;gbar. Es wird keine Origin-Lizenz ben&ouml;tigt, um Orglab zu verwenden. Normalerweise wird Orglab von Instrumentenherstellern und anderen Drittanbietern eingesetzt, um es ihrer Frontend-Software zu gestatten, Daten als Origin-Dateien auszugeben.</p>
<table class="note">

<tr>
<td>
<p>Das Orglab-Modul ist f&uuml;r 64-Bit-Systeme verf&uuml;gbar. Weitere Informationen zu Orglab und die M&ouml;glichkeit, das Orglab-Modul herunterzuladen, stehen Ihnen unter <b>Produkte &gt; <a class="external text" href="http://originlab.com/index.aspx?go=Products/Orglab" target="_blank">Orglab</a></b> auf der Webseite <b>www.originlab.com</b> zur Verf&uuml;gung.</p>
</td></tr></table>



    