<h1 class="firstHeading">Ver&ouml;ffentlichung und Export</h1><p class='urlname' style='display: none'>Publishing-and-Export</p>
<p><br /></p>
<dl><dd><a  class="image"><img alt="Grand image graphic export.png" src="../images/Publishing_and_Export/Grand_image_graphic_export.png" width="652"  /></a></dd></dl>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#The_Master_Page"><span class="tocnumber">1</span> <span class="toctext">Die Masterseite</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#The_Export_Margin_Offsets_Dialog_Box"><span class="tocnumber">2</span> <span class="toctext">Dialog Randverschiebung f&uuml;r Export</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Fit_Page_to_Layer_and_Layer_to_Page"><span class="tocnumber">3</span> <span class="toctext">Seite an Layer anpassen und Layer an Seite anpassen</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Copying_and_Pasting_Graphs_to_Other_Applications"><span class="tocnumber">4</span> <span class="toctext">Diagramme in andere Anwendungen kopieren und einf&uuml;gen</span></a><ul>
<li class="toclevel-2 tocsection-5"><a href="#Copy_Graph_as_Image"><span class="tocnumber">4.1</span> <span class="toctext">Diagramm als Bild kopieren</span></a></li>
<li class="toclevel-2 tocsection-6"><a href="#Copy_Graph_as_Editable_OLE_Graph_Object"><span class="tocnumber">4.2</span> <span class="toctext">Diagramm als bearbeitbares OLE-Diagrammobjekt kopieren</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-7"><a href="#Organizing_Your_Graphs_for_Presentation_or_Export"><span class="tocnumber">5</span> <span class="toctext">Diagramme f&uuml;r Ver&ouml;ffentlichung bzw. Export organisieren</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#The_Layout_Page"><span class="tocnumber">6</span> <span class="toctext">Die Layoutseite</span></a><ul>
<li class="toclevel-2 tocsection-9"><a href="#Merge_Graphs_to_Layout"><span class="tocnumber">6.1</span> <span class="toctext">Diagramme in Layout einf&uuml;gen</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-10"><a href="#Exporting_Graphs_and_Layout_Pages_to_an_Image_File"><span class="tocnumber">7</span> <span class="toctext">Diagramme und Layoutseiten in eine Bilddatei exportieren</span></a><ul>
<li class="toclevel-2 tocsection-11"><a href="#File:_Export_Graph"><span class="tocnumber">7.1</span> <span class="toctext">Datei: Grafik exportieren</span></a></li>
<li class="toclevel-2 tocsection-12"><a href="#File:_Export_Graphs_.28Advanced.29"><span class="tocnumber">7.2</span> <span class="toctext">Datei: Grafik exportieren (Erweitert)</span></a><ul>
<li class="toclevel-3 tocsection-13"><a href="#Saving_Export_Settings_to_a_Theme"><span class="tocnumber">7.2.1</span> <span class="toctext">Exporteinstellungen in einem Design speichern</span></a></li>
</ul>
</li>
</ul>
</li>
<li class="toclevel-1 tocsection-14"><a href="#Exporting_Browser_Graphs_to_Video"><span class="tocnumber">8</span> <span class="toctext">Browserdiagramme in Video exportieren</span></a></li>
<li class="toclevel-1 tocsection-15"><a href="#Exporting_Images_to_a_Raster_or_Video_File"><span class="tocnumber">9</span> <span class="toctext">Bilder in ein Raster oder eine Videodatei exportieren</span></a></li>
<li class="toclevel-1 tocsection-16"><a href="#Exporting_Matrices"><span class="tocnumber">10</span> <span class="toctext">Matrizen exportieren</span></a><ul>
<li class="toclevel-2 tocsection-17"><a href="#Export_Matrix_as_ASCII"><span class="tocnumber">10.1</span> <span class="toctext">Matrix als ASCII exportieren</span></a></li>
<li class="toclevel-2 tocsection-18"><a href="#Export_Matrix_as_NetCDF"><span class="tocnumber">10.2</span> <span class="toctext">Matrix als NetCDF exportieren</span></a></li>
<li class="toclevel-2 tocsection-19"><a href="#Export_Matrix_as_Image"><span class="tocnumber">10.3</span> <span class="toctext">Matrix als Bild exportieren</span></a></li>
<li class="toclevel-2 tocsection-20"><a href="#Export_Matrix_as_Video"><span class="tocnumber">10.4</span> <span class="toctext">Matrix als Video exportieren</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-21"><a href="#Exporting_Worksheets"><span class="tocnumber">11</span> <span class="toctext">Arbeitsbl&auml;tter exportieren</span></a><ul>
<li class="toclevel-2 tocsection-22"><a href="#As_ASCII.2C_NI_TDM_.28TDM.2C_TDMS.29.2C_and_Sound_.28WAV.29"><span class="tocnumber">11.1</span> <span class="toctext">ASCII, NI TDM (TDM, TDMS) und Sound (WAV)</span></a></li>
<li class="toclevel-2 tocsection-23"><a href="#As_Excel"><span class="tocnumber">11.2</span> <span class="toctext">Als Excel</span></a></li>
<li class="toclevel-2 tocsection-24"><a href="#As_SQLite"><span class="tocnumber">11.3</span> <span class="toctext">Als SQLite</span></a></li>
<li class="toclevel-2 tocsection-25"><a href="#As_Multipage_PDF_File"><span class="tocnumber">11.4</span> <span class="toctext">Als mehrseitige PDF-Datei</span></a></li>
<li class="toclevel-2 tocsection-26"><a href="#As_Image_File"><span class="tocnumber">11.5</span> <span class="toctext">Als Bilddatei</span></a></li>
<li class="toclevel-2 tocsection-27"><a href="#As_PDF_File"><span class="tocnumber">11.6</span> <span class="toctext">Als PDF-Datei</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-28"><a href="#Send_Graphs_to_PowerPoint"><span class="tocnumber">12</span> <span class="toctext">Diagramme an PowerPoint senden</span></a></li>
<li class="toclevel-1 tocsection-29"><a href="#Slide_Show_of_Graphs"><span class="tocnumber">13 </span><span class="toctext">Slide-Show der Diagramme</span></a></li>
<li class="toclevel-1 tocsection-30"><a href="#Creating_Movies"><span class="tocnumber">14</span> <span class="toctext">Animationen erstellen</span></a></li>
<li class="toclevel-1 tocsection-31"><a href="#Notes_Windows_for_Reporting"><span class="tocnumber">15</span> <span class="toctext">Notizfenster f&uuml;r Reporting</span></a><ul>
<li class="toclevel-2 tocsection-32"><a href="#Notes_Window_Syntax"><span class="tocnumber">15.1</span> <span class="toctext">Syntax des Notizfensters</span></a></li>
<li class="toclevel-2 tocsection-33"><a href="#Rich_Text"><span class="tocnumber">15,2</span> <span class="toctext">Rich Text</span></a><ul>
<li class="toclevel-3 tocsection-34"><a href="#Adding_Content_to_Your_Notes"><span class="tocnumber">15.2.1</span> <span class="toctext">Inhalt zu Ihren Notizen hinzuf&uuml;gen</span></a></li>
<li class="toclevel-3 tocsection-35"><a href="#Text_Styles_Manager"><span class="tocnumber">15.2.2</span> <span class="toctext">Textstile verwalten</span></a></li>
<li class="toclevel-3 tocsection-36"><a href="#Adding_Rich_Text_Content_to_Layout_or_Graph"><span class="tocnumber">15.2.3</span> <span class="toctext">Rich-Text-Inhalt zu Layout oder Diagramm hinzuf&uuml;gen</span></a></li>
<li class="toclevel-3 tocsection-37"><a href="#Print_or_Export_to_PDF"><span class="tocnumber">15.2.4</span> <span class="toctext">Drucken oder in PDF exportieren</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-38"><a href="#HTML_and_Markdown"><span class="tocnumber">15.3</span> <span class="toctext">HTML und Markdown</span></a><ul>
<li class="toclevel-3 tocsection-39"><a href="#Adding_Content_to_Your_HTML_Report"><span class="tocnumber">15.3.1</span> <span class="toctext">Inhalt zu Ihrem HTML-Bericht hinzuf&uuml;gen</span></a></li>
<li class="toclevel-3 tocsection-40"><a href="#Using_Your_HTML_Report"><span class="tocnumber">15.3.2</span> <span class="toctext">Ihren HTML-Bericht verwenden</span></a></li>
</ul>
</li>
</ul>
</li>
<li class="toclevel-1 tocsection-41"><a href="#Topics_for_Further_Reading"><span class="tocnumber">16</span> <span class="toctext">Weiterf&uuml;hrende Themen</span></a></li>
</ul>
</div>

<h2><a name="The_Master_Page"></a><span class="mw-headline">Die Masterseite</span></h2>
<p>Die Funktion <b>Masterseite</b> wird dazu verwendet, eine oder mehrere allgemeine Objekte zu den <b>exportierten</b> oder <b>gedruckten</b> Diagrammen hinzuzuf&uuml;gen. Verwenden Sie die Masterseite, um eine Reihe von Eigenschaften und Objekten -- ein benutzerdefinierter Hintergrund, ein Unternehmenslogo, Textbeschriftungen, Bilder etc. -- zu ausgew&auml;hlten Diagrammfenstern in Ihrem Projekt hinzuzuf&uuml;gen.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Master items applied.png" src="../images/Publishing_and_Export/Master_items_applied.png" width="619"  /></a></dd></dl></dd></dl>
<p>Um diese Funktion zu nutzen, m&uuml;ssen Sie zuerst Ihre Masterseite erstellen. Die Masterseite sollte die Eigenschaften und Objekte enthalten, die Sie in anderen Diagrammfenstern anzeigen lassen m&ouml;chten:</p>
<ol><li> W&auml;hlen Sie im Men&uuml; <b>Datei: Neu: Masterseite</b>. Wenn Sie sich beim Ausw&auml;hlen des Men&uuml;befehls nicht im Hauptverzeichnis des Projekts befinden, werden Sie gefragt, ob Sie in das Hauptverzeichnis wechseln m&ouml;chten. </li>
<li> Passen Sie die Mastervorlage benutzerdefiniert an. Beachten Sie, dass die Kommentare, die unter der Schaltfl&auml;che <b>Mastervorlage speichern</b> gezeigt werden, &quot;verborgen&quot; sind und nicht auf Ihre Diagrammfenster angewendet werden. </li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Mastervorlage speichern</b>. Wenn Sie speichern, wird die <b>Mastervorlage</b> im <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html">Anwenderdateiordner</a> als &quot;Name des aktiven Fensters&quot;.otpu (z. B. &quot;C:\Users\<i>YourName</i>\Dokumente\OriginLab\Anwenderdateien\Master.otpu&quot;) gespeichert.</li></ol>
<p><br /> <i><b>Dinge, die Sie &uuml;ber die Masterseite wissen sollten:</b></i></p>
<ul><li> Masterelemente werden nur in Diagrammseiten der gleichen Dimensionen als Vorlage gezeigt. <b>Dimension auf alle Diagramme anwenden</b> wendet die Seitendimensionen der Mastervorlage auf alle Diagramme mit dem <i>gleichen Seitenverh&auml;ltnis</i> an.</li>
<li> Wenn Sie ein Diagramm erstellen und die Seitengr&ouml;&szlig;e modifizieren, <b>Datei: Neu: Masterseite</b> w&auml;hlen und eine Mastervorlage in den Arbeitsbereich laden, dann wird die Mastervorlage mit den Seitenabmessungen Ihrer modifizierten Diagrammseite geladen.</li>
<li> Die Schaltfl&auml;che <b>Drehen</b> vertauscht die Seitendimensionen der Mastervorlage (die Ausrichtung Hoch- und Querformat wird gewechselt).</li>
<li> Wenn Sie auf <b>Dimension auf alle Diagramme anwenden</b> klicken, werden Sie aufgefordert, die Abmessungen nur auf Diagramme mit dem gleichen Seitenverh&auml;ltnis anzuwenden oder auf alle Diagramme mit der gleichen Ausrichtung (Hoch- oder Querformat).</li>
<li> Die Elemente der Masterseite auf einem Diagramm mit der Ausrichtung Hochformat werden nicht auf einem Diagramm mit der Ausrichtung Querformat gezeigt und <i>umgekehrt</i>.</li>
<li> Wenn Sie KEINE Masterelemente verwenden, legt <b>Bearbeiten: Seite kopieren</b> (STRG + J) <i>ein mit OLE bearbeitbare Origin-Diagrammobjekt</i> in der Zwischenablage ab. Wenn Sie Masterelemente verwenden, legt <b>Bearbeiten: Seite kopieren</b> ein <i>Bild</i> in der Zwischenablage ab. Der Dialog <b>Diagramm als Bild kopieren</b> wird ge&ouml;ffnet und Sie werden gebeten, die Bildeinstellungen zu &uuml;bernehmen bzw. anzupassen, bevor Sie auf <b>Kopieren</b> klicken.</li>
<li> Wenn ein Diagramm Masterelemente verwendet, unterst&uuml;tzt <a href="#Send_Graphs_to_PowerPoint"><b>Grafiken an PowerPoint senden</b></a> <i>nicht</i> die Funktion <b>Diagramme als eingebettetes Objekt einf&uuml;gen</b>. Stattdessen verwendet <b>Diagramme als Bild einf&uuml;gen</b>, das Masterelemente <i>unterst&uuml;tzt</i>. </li>
<li> Es gibt eine Methode, um Masterelemente selektiv in Ihrer exportierten oder gedruckten Seite auszuschlie&szlig;en. <i>Jedes Objekt</i>, von dem Sie nicht m&ouml;chten, dass es auf der exportierten/gedruckten Seite gezeigt wird, sollte mit &quot;NoExport&quot; beginnen (&ouml;ffnen Sie z. B. den Dialog <b>Eigenschaften</b> des Pfeilobjekts und benennen Sie auf der Registerkarte <b>Programmierung</b> &quot;Arrow&quot; in &quot;NoExport_Arrow&quot; um).</li>
<li> Wenn Sie Ihre Masterseite benutzerdefiniert anpassen und im <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html">Anwenderdateiordner</a> speichern, laden Sie beim n&auml;chsten Mal, wenn Sie <b>Datei: Neu: Masterseite</b> w&auml;hlen, Ihre benutzerdefinierte Vorlage.</li>
<li> Wenn Sie die Masterlelemente nicht im Arbeitsbereich zeigen m&ouml;chten, klicken Sie auf <b>Ansicht: Zeigen: Masterelemente</b> und entfernen das H&auml;kchen. Das exportierte Diagramm enth&auml;lt noch die Masterelemente (sie werden nur nicht mehr im Arbeitsbereich angezeigt).</li>
<li> Wenn Sie die Masterelemente aus einem Diagramm entfernen m&ouml;chten, sowohl im Arbeitsbereich <i>als auch</i> in den exportierten Bildern, klicken Sie im Men&uuml; auf <b>Format: Seite</b> und die Registerkarte <b>Anzeige</b> und deaktivieren Sie das Kontrollk&auml;stchen <b>Masterelemente verwenden</b>.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Sie k&ouml;nnten das Hilfsmittel Text verwenden, um Projekt- und Systeminformationen zu Ihrer Mastervorlage als statische Textobjekte hinzuzuf&uuml;gen, aber da es bei einer Vorlage um ihre Wiederverwendung geht, ziehen Sie doch die &quot;Softcodierung&quot; der Informationen in Ihren Textbeschriftungen in Erw&auml;gung. Weitere Informationen finden Sie unter folgenden Themen:</p>
<ul><li> <a class="external text" href="../../UserGuide/UserGuide/Linking_Text_Labels_to_Data_and_Variables.html">Variablenwerte in Textbeschriftungen ersetzen</a></li>
<li> <a class="external text" href="../../LabTalk/LabTalk/String_registers.html">Register von LabTalk-Zeichenketten</a></li></ul>
</td></tr></table>
<h2><a name="The_Export_Margin_Offsets_Dialog_Box"></a><span class="mw-headline">Dialog Randverschiebung f&uuml;r Export</span></h2>
<p>Standard ist, dass die R&auml;nder Ihrer kopierten oder exportierten Diagramme durch <a class="external text" href="../../UserGuide/UserGuide/The_(Options)_Page_Tab.html">den <b>Umfang</b> in der Gruppe <b>Seiteneinstellungen kopieren</b> unter <b>Einstellungen: Optionen</b></a> (Kopieren)  oder durch den Zweig <b>Exporteinstellungen</b> des Dialog <b>Grafiken exportieren</b> (Export) bestimmt werden. Sie k&ouml;nnen die Standardr&auml;nder interaktiv &uuml;ber <a class="external text" href="../../UserGuide/UserGuide/Export_Margin_Offsets.html">den <b>Dialog Randverschiebung f&uuml;r Export</b></a> modifizieren.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Export margin control.png" src="../images/Publishing_and_Export/Export_margin_control.png" width="471"  /></a></dd></dl></dd></dl>
<ol><li> Klicken Sie auf das Diagrammfenster (um es zu aktivieren) und w&auml;hlen Sie <b>Bearbeiten: Randverschiebung f&uuml;r Export</b>. Der Dialog <b>Randverschiebung f&uuml;r Export</b> wird ge&ouml;ffnet.</li>
<li> Ziehen Sie an den blauen Auswahlelementen, die an den Seitenr&auml;ndern angezeigt werden, oder geben Sie die Werte in die Dialogbearbeitungsfelder ein. Klicken Sie auf <b>Anwenden</b>.</li></ol>
<h2><a name="Fit_Page_to_Layer_and_Layer_to_Page"></a><span class="mw-headline">Seite an Layer anpassen und Layer an Seite anpassen</span></h2>
<p>Es gibt zwei kleine Dialoge, die vor dem Exportieren hilfreich beim Entfernen von wei&szlig;er Fl&auml;che oder Platzieren eines Randes um Ihr Diagramm herum sind:</p>
<ul><li> <b>Seite an Layer anpassen</b>: W&auml;hlen Sie <b>Grafik: Seite an Layer anpassen</b>, um den Dialog <b>pfit2l</b> zu &ouml;ffnen.</li>
<li> <b>Layer an Seite anpassen</b>: W&auml;hlen Sie <b>Grafik: Layer an Seite anpassen</b>, um den Dialog <b>gfitp</b> zu &ouml;ffnen.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="DB pfit2l 1 small.png" src="../images/Publishing_and_Export/DB_pfit2l_1_small.png" width="593"  /></a></dd></dl></dd></dl>
<p>Beide Dialoge k&ouml;nnen verwendet werden, um die wei&szlig;e Fl&auml;che zu entfernen. Beide k&ouml;nnen die Gr&ouml;&szlig;e ver&auml;ndern, mit und ohne &Auml;nderung der Seitenverh&auml;ltnisse des Diagramms. Sie k&ouml;nnen <a class="external text" href="../../UserGuide/UserGuide/Fitting_Page_to_Layers_and_Fitting_Layer_to_Page.html">die Dokumentation f&uuml;r beide Dialoge lesen</a>, um zu entscheiden, welcher am besten f&uuml;r Sie geeignet ist. Grunds&auml;tzlich kommt es aber nur darauf an, ob Sie eine bestimmte Seitengr&ouml;&szlig;e beibehalten m&uuml;ssen. Falls ja, eignet sich wahrscheinlich <b>Layer an Seite anpassen</b> besser. Falls nein, k&ouml;nnen Sie beide Dialoge verwenden.</p>
<h2><a name="Copying_and_Pasting_Graphs_to_Other_Applications"></a><span class="mw-headline">Diagramme in andere Anwendungen kopieren und einf&uuml;gen</span></h2>
<p><span class="OIndex" style="display:none">Diagramme, kopieren/einf&uuml;gen oder einbetten</span> <span class="OIndex" style="display:none">Diagramme kopieren/einf&uuml;gen</span> <span class="OIndex" style="display:none">Diagramme einbetten, Anwendungen von Drittanbietern</span> Es gibt zwei M&ouml;glichkeiten, wie Sie Origin-Diagramme in Dateien anderer Anwendungen einbinden k&ouml;nnen (z. B. Microsoft Words .docx-Dateien ):</p>
<ul><li> Als ein <i>Bild </i></li>
<li> Als ein <i>bearbeitbares OLE-Diagrammobjekt</i><span class="OIndex" style="display:none">Objektverkn&uuml;pfung und  Einbettung (OLE)</span></li></ul>
<p><br /> Wenn Sie als ein <i>Bild</i> einf&uuml;gen, f&uuml;gen Sie ein statisches Objekt ein. In MS Word zum Beispiel k&ouml;nnen Sie das Bild mit Words Bildbearbeitungstools modifizieren, aber Sie k&ouml;nnen keine Bearbeitungen an dem Diagramm in Origin vornehmen und das Diagramm in Word dann aktualisieren wollen (Sie k&ouml;nnen nur das existierende Bild l&ouml;schen und es durch ein neues ersetzen).</p><p>Wenn Sie im Gegensatz dazu ein <i>bearbeitbares Diagrammobjekt</i> einf&uuml;gen, k&ouml;nnen Sie sp&auml;ter in der Hostanwendung doppelt auf das Objekt klicken, um eine neue Instanz von Origin zu starten. Das Diagramm und jegliche zugeh&ouml;rige Datenbl&auml;tter stehen f&uuml;r die Bearbeitung zur Verf&uuml;gung. Nach der Bearbeitung verwenden Sie im Men&uuml; <b>Datei: Beenden und zu ... zur&uuml;ckkehren</b>, um das eingebettete Objekt zu aktualisieren, Origin zu schlie&szlig;en und zu der Zielanwendung zur&uuml;ckzukehren.</p>
<h3><a name="Copy_Graph_as_Image"></a><span class="mw-headline">Diagramm als Bild kopieren</span></h3>
<ol><li> Klicken Sie auf Ihr Origin-Diagramm, um es zu aktivieren. Dann...</li>
<li> W&auml;hlen Sie <b>Bearbeiten: Diagramm als Bild kopieren</b> (Strg+Alt+J). Alternativ klicken Sie auf das Diagrammfenster in der N&auml;he des Seitenrands und dann auf die Schaltfl&auml;che <b>Diagramm als Bild kopieren</b> auf der <a href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Mini_Toolbars" title="OriginLab:The Origin Interface">Minisymbolleiste</a>.<dl><dd><a  class="image"><img alt="MT copy graph as image mt button.png" src="../images/Publishing_and_Export/MT_copy_graph_as_image_mt_button.png" width="610"  /></a></dd></dl></li>
<li> W&auml;hlen Sie in Ihrer Hostanwendung <b>Einf&uuml;gen</b> oder dr&uuml;cken Sie Strg+V.</li></ol>
<p>Beim Kopieren des Diagramms als ein Bild (Strg+Alt+J) haben Sie nun eine Auswahl von Bildformaten (PNG, EMF, DIB, HTML, JPG). Au&szlig;erdem k&ouml;nnen Sie schnelle Gr&ouml;&szlig;enanpassungen vornehmen und die Hintergrundtransparenz festlegen (PNG). Der Dialog <b>Diagramm als Bild kopieren</b> (copyimg) schlie&szlig;t das Bedienelement <b>Dialogdesign</b> ein, das die Wiederholung der <b>&lt;zuletzt verwendeten&gt;</b> Einstellungen, das Speichern der aktuellen Einstellungen als Standard mit <b>Als &lt;Standard&gt; speichern</b> oder das Speichern von Einstellungen als ein benanntes Design (<b>Speichern unter...</b>) erm&ouml;glicht.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Copy graph as image dialog.png" src="../images/Publishing_and_Export/Copy_graph_as_image_dialog.png" width="290"  /></a></dd></dl></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Es gibt das Bedienelement <b>Kopieren</b> auf der Registerkarte <b>Einstellungen: Optionen: Seite</b>, mit dem Sie die Tastenkombination Strg+C verwenden k&ouml;nnen, um entweder das <b>Diagramm als Bild zu kopieren &lt;zuletzt verwendet&gt;</b> oder die <b>Seite zu kopieren (Strg+J)</b> (d. h. &quot;bearbeitbares OLE-Diagrammobjekt&quot;). Dies erm&ouml;glicht Ihnen, den Dialog <b>Diagramm als Bild kopieren</b> zu umgehen und das Positionieren eines standardisierten Bildes in der Zwischenablage mit Strg+C zu beschleunigen.</p></td></tr></table>
<h3><a name="Copy_Graph_as_Editable_OLE_Graph_Object"></a><span class="mw-headline">Diagramm als bearbeitbares OLE-Diagrammobjekt kopieren</span></h3>
<ol><li> W&auml;hlen Sie <b>Bearbeiten: Seite kopieren</b> (Strg+J).</li>
<li> W&auml;hlen Sie in Ihrer Hostanwendung <b>Einf&uuml;gen</b> oder dr&uuml;cken Sie Strg+V.</li></ol>
<p><br /></p>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Exportieren und Ver&ouml;ffentlichen von Diagrammen &gt; <a class="external text" href="../../UserGuide/UserGuide/Pasting_or_Embedding_Graphs_in_other_Applications.html">Diagramme in andere Anwendungen einf&uuml;gen oder einbetten</a></b></p>
</td></tr></table>
<h2><a name="Organizing_Your_Graphs_for_Presentation_or_Export"></a><span class="mw-headline">Diagramme f&uuml;r Pr&auml;sentation bzw. Export organisieren</span></h2>
<p>Wenn Ihre Origin-Projektdatei viele Diagramme enth&auml;lt, die Sie exportieren oder in einer Origin-Slideshow verwenden m&ouml;chten, k&ouml;nnen Sie dem Vorgang vereinfachen, indem Sie Shortcuts zu Ihren Diagrammen in einem <b>Favoriten</b>ordner des Projekt Explorers einf&uuml;gen und sie dort ordnen:</p>
<ul><li> Klicken Sie mit der rechten Maustaste auf ein Fenster und w&auml;hlen Sie <b>Shortcuts zu Favoriten hinzuf&uuml;gen</b>. Auf diese Weise wird ein Shortcut zu jedem Diagrammfenster hinzugef&uuml;gt und zwar zu einem neuen Unterordner <b>Favoriten</b> (zu sehen im <a class="external text" href="../../UserGuide/UserGuide/Project_Explorer.html">Projekt Explorer</a>).</li>
<li> Beim Sende von Diagrammen an PowerPoint oder Erstellen einer Origin-Slideshow k&ouml;nnen Sie (1) die Folienreihenfolge in dem entsprechenden Dialog festlegen oder (2) die Folienreihenfolge gem&auml;&szlig; <a class="external text" href="../../UserGuide/UserGuide/Project_Explorer.html#Modify_Graph_Order_for_Slide_Show_or_PowerPoint">dieser Vorgehensweise</a> festlegen.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn Sie ein Manuskript zur Ver&ouml;ffentlichung vorbereiten, ist folgende FAQ m&ouml;glicherweise hilfreich: <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_export_graphs_with_exact_size_and_resolution_as_specified_by_publishers.html">FAQ-441 Wie kann ich Diagramme mit exakter vom Herausgeber festgelegter Gr&ouml;&szlig;e und Aufl&ouml;sung exportieren?</a></p></td></tr></table>
<h2><a name="The_Layout_Page"></a><span class="mw-headline">Die Layoutseite</span></h2>
<p>Eine Layoutseite ist, wie der Name schon sagt, ein Fenster, mit dem sich die verschiedenen Elemente f&uuml;r eine Ver&ouml;ffentlichung oder den Export gut anordnen lassen. Verwenden Sie sie, um Diagramme, Ergebnistabellen, Textobjekte etc. auf einem einzelnen Bedienfeld zusammenzuf&uuml;gen.</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG PubExport Layout1.png" src="../images/Publishing_and_Export/UG_PubExport_Layout1.png" width="506"  /></a></dd></dl></dd></dl>
<p>Normalerweise beginnen Sie, indem Sie ein leeres Bedienfeld &ouml;ffnen:</p>
<ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Neues Layout</b> in der Symbolleiste Standard.</li>
<li> Klicken Sie mit der rechten Maustaste auf das leere Layout, um Inhalte der Zwischenablage einzuf&uuml;gen, Text hinzuzuf&uuml;gen, Bilder aus Dateien einzuf&uuml;gen, Diagramme und Tabellen hinzuzuf&uuml;gen etc.</li>
<li> Wenn Sie ein Bild aus einer Datei einf&uuml;gen, klicken Sie mit der rechten Maustaste in den Bereich, in den Sie einf&uuml;gen m&ouml;chten. Beim Hinzuf&uuml;gen von Diagrammen oder Arbeitsbl&auml;ttern w&auml;hlen Sie ein Fenster im Browser und ziehen Sie mit der Maus einen Bereich im Layout auf. Beachten Sie, dass hinzugef&uuml;gte Objekte durch Ziehen mit der Maus verschoben oder in der Gr&ouml;&szlig;e ver&auml;ndert werden k&ouml;nnen.<ul><li> Weiterhin k&ouml;nnen Sie Bearbeitungen an eingef&uuml;gten Bildern vornehmen, indem Sie doppelt auf das Bild klicken. Das Bild wird im <a href="../../GettingStarted/OriginLab/Matrix_Book_Matrix_Sheet_Matrix_Objects.html#Image_Window" title="OriginLab:Matrix Book Matrix Sheet Matrix Objects"><b>Bildfenster</b></a> ge&ouml;ffnet. </li>
<li> Weiterhin k&ouml;nnen Sie Bearbeitungen an dem Diagramm vornehmen, indem Sie doppelt auf das eingef&uuml;gte Diagrammobjekt klicken. Dadurch wird das Quelldiagramm zur Bearbeitung ge&ouml;ffnet. Bearbeitungen am Quelldiagramm werden auf der Layoutseite aktualisiert.</li>
<li> Eingef&uuml;gte Tabellen k&ouml;nnen durch Doppelklick auf das Tabellenobjekt bearbeitet werden. Stilanpassungen k&ouml;nnen vorgenommen werden, indem Sie das Tabellenobjekt ausw&auml;hlen und die verf&uuml;gbaren Schaltfl&auml;chen der <b>Minisymbolleiste</b> verwenden.</li></ul></li>
<li> Beachten Sie, dass einzelne Elemente auf der Layoutseite mit Hilfe der Symbolleistensschaltfl&auml;chen von <b>Objekt bearbeiten</b> ausgerichtet werden k&ouml;nnen.</li></ol>
<dl><dd><dl><dd><a  class="image"><img alt="Object Edit bar.png" src="../images/Publishing_and_Export/Object_Edit_bar.png" width="409"  /></a></dd></dl></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Das Exportieren der Layoutseiten in .SVG-Dateien wird unterst&uuml;tzt. Beim Hinzuf&uuml;gen von Diagrammen zum Layout w&auml;hlen Sie <b>Diagramm hinzuf&uuml;gen</b> im Kontextmen&uuml; des Layouts, und Elemente Ihrer SVG-Datei (z. B. Text) werden in Anwendungen wie Inkscape oder Adobe Illustrator bearbeitbar.</p></td></tr></table>
<p><br /> Mehr zur Layoutseite finden Sie unter <a class="external text" href="../../UserGuide/UserGuide/Using_the_Layout_Page_Window.html"><b>Das Layoutseitenfenster verwenden</b></a> in der Origin-Hilfe.</p>
<h3><a name="Merge_Graphs_to_Layout"></a><span class="mw-headline">Diagramme in Layout einf&uuml;gen</span></h3>
<p>Als eine Alternative zum manuellen Erstellen von Layouts bietet Origin ein Hilfsmittel, das ausgew&auml;hlte Diagramme auf einer einzelnen Layoutseite mit gleichen Abst&auml;nden zusammengef&uuml;gt. In diesem Fall sind zusammengef&uuml;gte Diagramme Bilder und daher nicht mit der in Schritt #3 des vorherigen Abschnitts beschriebenen Methode bearbeitbar. Falls keine weiteren Diagrammbearbeitungen erforderlich sind, k&ouml;nnen Sie diese Methode jedoch verwenden, um schnell ein attraktiv aussehendes Layout zu erstellen.</p>
<dl><dd><a  class="image"><img alt="UG graph merge layout.png" src="../images/Publishing_and_Export/UG_graph_merge_layout.png" width="796"  /></a></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Zus&auml;tzlich zu <b>Diagramme in Layoutseite einf&uuml;gen</b> schlie&szlig;t Origin die Funktion zum Zusammenf&uuml;gen von Diagrammen in mehrere andere Dialoge ein: <a href="../../GettingStarted/OriginLab/Customizing_Graphs.html#Menus.2C_Dialogs_and_Buttons_Used_in_Graph_Customization" title="OriginLab:Customizing Graphs"><b>Diagrammfenster zusammenf&uuml;gen</b>, <b>Layer anordnen</b> und <b>Layerverwaltung</b></a>.</p></td></tr></table>
<p><br /> <i><b>Um Diagrammbilder in einem einzelnen Layout zusammenzuf&uuml;gen:</b></i></p>
<ol><li> Klicken Sie bei aktivem Diagrammfenster auf <b>Grafik: Diagramm in Layout einf&uuml;gen: Dialog &ouml;ffnen</b>.</li>
<li> Verwenden Sie die Auswahlliste <b>Auswahl</b>, um festzulegen, wie Sie die Diagramme ausw&auml;hlen. Um einzelne Diagramm zu w&auml;hlen, w&auml;hlen Sie <i>Festgelegt</i> und verwenden die Schaltfl&auml;che Durchsuchen neben <b>Diagramme</b>, um den Diagrammbrowser zu &ouml;ffnen und die Diagramme auszuw&auml;hlen.</li></ol>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Verwenden Sie den Men&uuml;befehl <b>Seite an Objekte anpassen</b> (<b>Format: Seite an Objekte anpassen</b>), um einen einheitlichen Rand f&uuml;r die aktive Layoutseite zu &uuml;bernehmen. Dies funktioniert genauso wie das zuvor erw&auml;hnte <a href="#Fit_Page_to_Layer_and_Layer_to_Page"><b>Seite an Layer anpassen</b></a> dies f&uuml;r Diagrammfenster tut.</p></td></tr></table>
<h2><a name="Exporting_Graphs_and_Layout_Pages_to_an_Image_File"></a><span class="mw-headline">Diagramme und Layoutseiten in eine Bilddatei exportieren</span></h2>
<p><span class="OIndex" style="display:none">Grafiken, Exportieren</span><span class="OIndex" style="display:none">Grafiken exportieren/Layoutseiten</span> <span class="OIndex" style="display:none">Layoutseiten, Exportieren</span></p><p>Origin 2021b f&uuml;gte eine vereinfachte Diagrammexportroutine als Erg&auml;nzung zur existierenden Diagrammexportroutine hinzu:</p>
<ul><li> <b>Datei: Grafik exportieren</b>: Wenn Sie einfach ein oder zwei Diagramme in einem von mehreren g&auml;ngigen Bildformaten (PNG, BMP, JPEG, TIFF, EMF) exportieren m&ouml;chten und nur minimale Kontrolle &uuml;ber die Bildgr&ouml;&szlig;e ben&ouml;tigen, ist diese Routine schnell und einfach.</li>
<li> <b>Datei: Grafik exportieren (Erweitert)</b>: Wenn Sie Diagramme per Stapelverarbeitung (z. B. <i>Alle in aktivem Ordner</i>, <i>Alle in Projekt</i> etc.) oder in Vektortypen wie PDF oder EPS exportieren m&ouml;chten, verwenden Sie diese Routine. Der Dialog unterst&uuml;tzt Ausgeben in einem festgelegten Pfad, automatisches Benennen, Anwenden der Einstellungen des Entwurfsmodus auf exportierte Diagramme plus das Festlegen von Rand, Bildgr&ouml;&szlig;e und weitere dateitypspezifische Einstellungen.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Seit <b>Origin 2023</b> verf&uuml;gen die folgenden Exportdialoge einen mit Datums-/Zeitstempel versehenen anklickbaren Link zum Meldungsprotokoll. Klicken Sie auf den Link, um die Datei mit Hilfe eines internen Origin-Viewers zu &ouml;ffnen (siehen unten):</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG Message Log Link.png" src="../images/Publishing_and_Export/UG_Message_Log_Link.png" width="565"  /></a></dd></dl></dd></dl>
<p>Zus&auml;tzlich werden zwei Systemvariablen hinzugef&uuml;gt, um die Ausgabe des Meldungsprotokolls f&uuml;r Bilder zu verwalten:</p>
<ul><li> <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#U.2CV.2CW"><b>@VID</b></a> wird hinzugef&uuml;gt, um einen Bildviewer (Raster, EMF) auszuw&auml;hlen: 1 = Origin Viewer verwenden (Standard); 0 = Standardapplikation des Systems verwenden</li>
<li> <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#M"><b>@MSG</b></a> wird hinzugef&uuml;gt, um zu steuern, was im Meldungsprotokoll ausgegeben wird: 0 = Datei und Link ausgeben (Standard); 1 = nur Link ausgeben; -1 = Meldungsausgabe deaktivieren.</li></ul>
<p><br /> <b>Um den Dateispeicherort im Windows Explorer zu &ouml;ffnen (<i>ohne die Datei zu &ouml;ffnen</i>)</b>:</p>
<ol><li> Klicken Sie mit der rechten Maustaste auf einen Link und w&auml;hlen Sie <b>Speicherort der Datei &ouml;ffnen</b> oder dr&uuml;cken Sie die Strg-Taste, w&auml;hrend Sie auf den Link klicken.</li></ol>
</td></tr></table>
<h3><a name="File:_Export_Graph"></a><span class="mw-headline">Datei: Grafik exportieren</span></h3>
<p><b>Datei: Grafik exportieren</b> (X-Funktion = <b>expG2img</b>) ist eine vereinfachte Routine zum Exportieren der aktiven Diagrammseite in eines der folgenden Formate: PNG, BMP, JPEG, TIFF oder EMF. Sie bietet nicht das Level von Kontrolle oder Flexibilit&auml;t wie <b>Datei: Grafik exportieren (Erweitert)</b> (n&auml;chster Abschnitt), aber sie funktioniert gut f&uuml;r den einfachen Export von individuellen Diagrammseiten.</p><p><br /> <i><b>Um ein Diagramm oder eine Layoutseite mit Hilfe des vereinfachten Dialogs expG2img in ein Rasterbild zu exportieren:</b></i></p>
<ol><li> Wenn ein Diagrammfenster aktiv ist, w&auml;hlen Sie <b>Datei: Grafik exportieren</b>.</li>
<li> Setzen Sie f&uuml;r <i>EMF</i>-Bilder einen Gr&ouml;&szlig;enfaktor relativ zur <i>Bildgr&ouml;&szlig;e</i>. Er wird unten im Dialog angegeben. W&auml;hlen Sie f&uuml;r Rasterformate eine <b>DPI</b>-Einstellung f&uuml;r die Ausgabe. Alternativ deaktivieren Sie das Kontrollk&auml;stchen <b>Auto</b> und geben Sie eine <b>Breite in Pixeln</b> ein. Das Klicken auf <b>Vorschau</b> ruft das zu exportierende Diagramm in einem internen Viewer an.</li></ol>
<dl><dd><a  class="image"><img alt="UG expG2img.png" src="../images/Publishing_and_Export/UG_expG2img.png" width="628"  /></a></dd></dl>
<h3><a name="File:_Export_Graphs_.28Advanced.29"></a><span class="mw-headline">Datei: Grafik exportieren (Erweitert)</span></h3>
<p><b>Datei: Grafik exportieren (Erweitert)</b> (X-Funktion = <b>expGraph</b>) ist Origins prim&auml;res Hilfsmittel zum Exportieren von Diagrammen und Layoutseiten. Es unterst&uuml;tzt die Raster- oder Vektorausgabe, einen flexiblen mehrseitigen Export (z. B. <b>Alle in aktivem Ordner</b>), DPI- und <a href="../../GettingStarted/OriginLab/2D_Graphs.html#Speed_Mode" title="OriginLab:2D Graphs">Entwurfsmodus</a> und so weiter.</p><p><br /> <i><b>Um ein Diagramm oder eine Layoutseite als eine Bilddatei zu exportieren:</b></i></p>
<ol><li> W&auml;hlen Sie im Men&uuml; <b>Datei: Grafik exportieren (Erweitert)</b>. </li></ol>
<dl><dd><a  class="image"><img alt="UG expGraph DB.png" src="../images/Publishing_and_Export/UG_expGraph_DB.png" width="799"  /></a></dd></dl>
<p><br /> Die Routine <b>expGraph</b> exportiert Diagramme in einem von 15 Dateiformaten:</p>
<table class="simple">

<tr>
<th> Rasterformate</th>
<td> BMP, GIF, JPG, PCX, PNG, TGA, PSD, TIF<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn Sie <b>Bildtyp</b> = TIF/TIFF ausw&auml;hlen und mehrere Diagramme f&uuml;r den Export (z. B. <b>Alle im aktiven Ordner</b>), wird ein Kontrollk&auml;stchen <b>Als TIF mit mehreren Frames exportieren</b> zum Dialog hinzugef&uuml;gt. Aktivieren Sie dieses Kontrollk&auml;stchen, um ausgew&auml;hlte Diagrammfenster als ein einzelnes TIF-Bild (TIF-Stapel) zu exportieren.</p></td></tr></table>
</td></tr>
<tr>
<th> Vektorformate</th>
<td> CGM, DXF, EPS, EMF, PDF, SVG, WMF</td></tr></table>
<h4><a name="Saving_Export_Settings_to_a_Theme"></a><span class="mw-headline">Exporteinstellungen in einem Design speichern</span></h4>
<p>Wie bei den meisten Origin-Dialogen k&ouml;nnen Sie Ihre Einstellungen f&uuml;r den Diagrammexport in einem <b>Dialogdesign</b> zur wiederholten Nutzung speichern.</p>
<dl><dd><a  class="image"><img alt="UG expGraph Dialog Theme.png" src="../images/Publishing_and_Export/UG_expGraph_Dialog_Theme.png" width="471"  /></a></dd></dl>
<p>Sobald Sie Ihre Exporteinstellungen bestimmt haben:</p>
<ul><li> Klicken Sie auf die Ausklappschaltfl&auml;che rechts von <b>Dialogdesign</b> und w&auml;hlen Sie eine der <a class="external text" href="../../UserGuide/UserGuide/Dialog_Themes.html">Optionen zum Speichern von Designs</a>.</li>
<li> Die Verwendung einer Gruppe benutzerdefinierter Einstellungen erstellt ein tempor&auml;res Standarddesign mit dem Titel <b>&lt;Zuletzt verwendet&gt;</b>. Mit diesem Design k&ouml;nnen Sie dann Ihre zuletzt verwendeten Einstellungen laden. Sie k&ouml;nnen auf dieses Design &uuml;ber die Dialoge <b>expG2img</b> oder <i>expGraph</i> zugreifen oder es im Men&uuml; <b>Datei: Zuletzt verwendete Exporte</b> aufrufen.</li></ul>
<dl><dd><a  class="image"><img alt="ExpGraph Last used.png" src="../images/Publishing_and_Export/ExpGraph_Last_used.png" width="584"  /></a></dd></dl>
<p><br /> Seit Origin 2021 werden die Einstellungen des Dialogs <b>expGraph</b> beim Export automatisch im Diagramm gespeichert.</p>
<ul><li> Um die aktuellen Einstellungen <i>ohne</i> Export zu speichern, w&auml;hlen Sie <b>In &lt;Diagramm&gt; speichern</b>. </li>
<li> Um gespeicherte Einstellungen wiederherzustellen, nachdem Sie sie im Dialog Export ge&auml;ndert haben, w&auml;hlen Sie <b>&lt;Diagramm&gt;</b>.</li></ul>
<dl><dd><a  class="image"><img alt="UG Save to Graph Theme.png" src="../images/Publishing_and_Export/UG_Save_to_Graph_Theme.png" width="649"  /></a></dd></dl>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Exportieren und Ver&ouml;ffentlichen von Diagrammen &gt; <a class="external text" href="../../UserGuide/Category/Exporting_Your_Graph_or_Layout_Page_to_an_Image_File.html">Ihr Diagramm oder Ihre Layoutseite in eine Bilddatei exportieren</a></b></p>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Sie k&ouml;nnen mehrere Diagramme, z. B. alle Diagramme in einem Ordner oder in einem ganzen Projekt, in eine einzelne, mehrseitige PDF-Datei exportieren. W&auml;hlen Sie <b>Datei: Grafiken exportieren</b> und &ouml;ffnen Sie den Dialog Grafiken exportieren. Setzen Sie den <b>Bildtyp</b> auf <b>Portable Document Format (*.pdf)</b> und <b>Diagramm(e) ausw&auml;hlen</b> auf eine der folgenden Optionen und Sie werden sehen, dass das Kontrollk&auml;stchen <b>Als mehrseitige PDF-Datei exportieren</b> aktiviert ist.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Export as multipage PDF.png" src="../images/Publishing_and_Export/Export_as_multipage_PDF.png" width="468"  /></a></dd></dl></dd></dl>
</td></tr></table>
<h2><a name="Exporting_Browser_Graphs_to_Video"></a><span class="mw-headline">Browserdiagramme in Video exportieren</span></h2>
<p><i><b>Um ein Browserdiagramm als Video (GIF, TIFF, AVI) zu exportieren:</b></i></p>
<ol><li> Aktivieren Sie das <a href="../../GettingStarted/OriginLab/2D_Graphs.html#Browser_Graph" title="OriginLab:2D Graphs">Browserdiagramm</a>. Bevor Sie weitermachen, pr&uuml;fen Sie, dass das Diagramm sich in der <b>Seitenansicht</b> befindet (klicken Sie dazu unter die Fenstertitelleiste und pr&uuml;fen Sie, wenn die Minisymbolleiste angezeigt wird, dass sich neben der Schaltfl&auml;che <b>Fensteransicht</b> kein rotes H&auml;kchen befindet. Falls dort eines ist, entfernen Sie es).<dl><dd><a  class="image"><img alt="UG MT turn off window view.png" src="../images/Publishing_and_Export/UG_MT_turn_off_window_view.png" width="363"  /></a></dd></dl></li>
<li> Klicken Sie im Bedienfeld links auf die Men&uuml;schaltfl&auml;che <a  class="image"><img alt="OH dropdown menu button.png" src="../images/Publishing_and_Export/OH_dropdown_menu_button.png" width="28"  /></a> und w&auml;hlen Sie <b>Durchbl&auml;ttern</b>.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Export</b> und setzen Sie <b>Dateityp</b> = <i>GIF</i>, <i>TIFF</i> oder <i>AVI</i>.</li>
<li> Passen Sie die anderen Einstellungen nach Bedarf an und klicken Sie auf <b>OK</b>. Falls die Option nicht deaktiviert ist, legt der Export einen anklickbaren Link im Meldungsprotokoll ab. Klicken Sie auf den Link, um das Video in der unterst&uuml;tzenden Anwendung auszuf&uuml;hren.</li></ol>
<dl><dd><dl><dd><a  class="image"><img alt="UG browser to video.png" src="../images/Publishing_and_Export/500px-UG_browser_to_video.png" width="500"   /></a></dd></dl></dd></dl>
<h2><a name="Exporting_Images_to_a_Raster_or_Video_File"></a><span class="mw-headline">Bilder in ein Raster oder eine Videodatei exportieren</span></h2>
<p>Mit Hilfe von <b>Datei: Bild exportieren</b> (X-Funktion = <b>cvExport</b>) <a href="../../GettingStarted/OriginLab/Matrix_Book_Matrix_Sheet_Matrix_Objects.html#Image_Window" title="OriginLab:Matrix Book Matrix Sheet Matrix Objects">Bildfenster</a> k&ouml;nnen Sie Bilder in eines von mehreren Rasterformaten exportieren: BMP, GIF, JPG, PNG, TIF.</p><p><br /> <i><b>Um ein (Bildfenster) Bild mit Hilfe von cvExport zu exportieren:</b></i></p>
<ol><li> W&auml;hlen Sie bei aktivem Bildfenster <b>Bild: Bild exportieren</b>.</li>
<li> W&auml;hlen Sie aus der Liste der Rasterbilder oder speichern Sie eine Videodatei (*.avi).</li></ol>
<dl><dd><a  class="image"><img alt="UG cvExport dlg.png" src="../images/Publishing_and_Export/UG_cvExport_dlg.png" width="354"  /></a></dd></dl>
<p>Nach dem Exportieren wird ein <a href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Messages_Log" title="OriginLab:The Origin Interface">anklickbarer Link</a> im <b>Meldungsprotokoll</b> erzeugt.</p>
<h2><a name="Exporting_Matrices"></a><span class="mw-headline">Matrizen exportieren</span></h2>
<h3><a name="Export_Matrix_as_ASCII"></a><span class="mw-headline">Matrix als ASCII exportieren</span></h3>
<p>Diese Option erstellt eine ASCII-Datei der Daten, die im aktiven Matrixobjekt enthalten sind.</p>
<ol><li> W&auml;hlen Sie bei aktiver Matrix <b>Datei: Export: ASCII</b>.</li></ol>
<h3><a name="Export_Matrix_as_NetCDF"></a><span class="mw-headline">Matrix als NetCDF exportieren</span></h3>
<p>Dies exportiert alle Objekte in der aktiven Matrix in eine .nc-Datei:</p>
<ol><li> W&auml;hlen Sie bei aktiver Matrix <b>Datei: Export: NetCDF</b>.</li>
<li> Beachten Sie bei <b>Basisjahr f&uuml;r jahres&uuml;bergreifende Abtastung</b>, dass die Zeitvariable nicht mit der NetCDF-Datei exportiert wird, wenn der Durchschnitt der Matrixdaten &uuml;ber die Jahre ermittelt wird. Verwenden Sie diese Option, um festzulegen, wie Zeit kennzuzeichnen ist:</li></ol>
<dl><dd><a  class="image"><img alt="Exporting NetCDF.png" src="../images/Publishing_and_Export/Exporting_NetCDF.png" width="481"  /></a></dd></dl>
<table class="dialogcontroltable">

<tr>
<th>Kein</th>
<td>Es wird keine Zeitvariable festgelegt.</td></tr>
<tr>
<th>Anfangsjahr verwenden</th>
<td>Anfangsjahr als Zeitvariable verwenden</td></tr>
<tr>
<th>Endjahr verwenden</th>
<td>Endjahr als Zeitvariable verwenden</td></tr></table>
<p>Weitere Informationen zum Export von NetCDF-Daten finden Sie in der <a class="external text" href="../../UserGuide/UserGuide/Exporting_NetCDF.html">Origin-Hilfedatei</a>.</p>
<h3><a name="Export_Matrix_as_Image"></a><span class="mw-headline">Matrix als Bild exportieren</span></h3>
<p>Matrixbilder k&ouml;nnen mit Hilfe von <b>Datei: Export: Bild</b> (X-Function = <b>expImage</b>) exportiert werden.</p><p><br /> <i><b>Um ein Matrixbild in eine Rasterdatei zu exportieren, einschlie&szlig;lich graustufiges GeoTIFF:</b></i></p>
<ol><li> W&auml;hlen Sie bei aktiver Matrix Datei: Export: Bild.</li>
<li> &Uuml;berpr&uuml;fen Sie, dass der <b>Dateityp</b> korrect ist. F&uuml;r GeoTIFF-Daten sollte das  TIF/TIFF-Format vorausgew&auml;hlt sein. Um sie jedoch als graustufige GeoTIFF zu exportieren, aktivieren Sie das Kontrollk&auml;stchen <b>ls graustufiges GeoTIFF exportieren</b>.</li></ol>
<dl><dd><a  class="image"><img alt="UG expImage dialog save as GS GeoTIFF.png" src="../images/Publishing_and_Export/UG_expImage_dialog_save_as_GS_GeoTIFF.png" width="494"  /></a></dd></dl>
<p>Nach dem Exportieren wird ein <a href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Messages_Log" title="OriginLab:The Origin Interface">anklickbarer Link des exportierten Dateipfads</a> im <b>Meldungsprotokoll</b> erzeugt.</p>
<h3><a name="Export_Matrix_as_Video"></a><span class="mw-headline">Matrix als Video exportieren</span></h3>
<p>Matrizen, die mehrere Matrixobjekte enthalten, k&ouml;nnen in GIF, TIF und AVI exportiert werden (X-Funktion = <b>expm2video</b>).</p>
<dl><dd><a  class="image"><img alt="UG export matrix stack to video.gif" src="../images/Publishing_and_Export/UG_export_matrix_stack_to_video.gif" width="720"  /></a></dd></dl>
<p><br /> <i><b>Um eine Reihe von Matrixobjekte als Videodatei zu exportieren:</b></i></p>
<ol><li> W&auml;hlen Sie bei aktiver Matrix <b>Datei: Export: Video</b>.</li></ol>
<dl><dd><a  class="image"><img alt="UG export matrix to video dialog.png" src="../images/Publishing_and_Export/UG_export_matrix_to_video_dialog.png" width="471"  /></a></dd></dl>
<h2><a name="Exporting_Worksheets"></a><span class="mw-headline">Arbeitsbl&auml;tter exportieren</span></h2>
<p><span class="OIndex" style="display:none">Arbeitsbl&auml;tter, Exportieren</span> <span class="OIndex" style="display:none">Arbeitsbl&auml;tter exportieren</span></p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Nach dem Exportieren der Arbeitsblattdaten in ASCII oder Excel wird ein <a href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Messages_Log" title="OriginLab:The Origin Interface">anklickbarer Link des exportierten Dateipfads</a> im <b>Meldungsprotokoll</b> erzeugt.</p></td></tr></table>
<p><br /> Bei aktivem Arbeitsblatt bietet der Men&uuml;befehl <b>Datei: Export</b> die folgenden Optionen:</p>
<h3><a name="As_ASCII.2C_NI_TDM_.28TDM.2C_TDMS.29.2C_and_Sound_.28WAV.29"></a><span class="mw-headline">Als ASCII, NI TDM (TDM, TDMS) und Sound (WAV)</span></h3>
<p>Diese gelten nur f&uuml;r Bl&auml;tter, die Datenspalten enthalten, und sind nicht verf&uuml;gbar f&uuml;r <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Analysis_Report_Sheets" title="OriginLab:How to Handle Repetitive Tasks">Analyseberichtsbl&auml;tter</a> (siehe weitere Optionen unten). Die exportierte Datei enth&auml;lt nur Daten aus Arbeitsblattspalten. Frei bewegliche oder eingebettete Diagramme, die im Arbeitsblatt platziert sind, werden ignoriert.</p>
<h3><a name="As_Excel"></a><span class="mw-headline">Als Excel</span></h3>
<p>Exportieren Sie die Mappen der Arbeitsblattspalten mit den Text- und numerischen Daten in eine MS-Excel-Datei (XLS, XSLX, XSLM). Beachten Sie, dass die <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Analysis_Report_Sheets" title="OriginLab:How to Handle Repetitive Tasks">Analyseberichtsbl&auml;tter</a> mit ihren hierarchischen Tabellen und Elemente wie eingebettete Diagramme und Bilder nicht in die Excel-Datei exportiert werden. Analyseergebnisse, die in &uuml;blichen Origin-Arbeitsbl&auml;ttern ausgegeben werden, <i>werden</i> exportiert.</p>
<ol><li> W&auml;hlen Sie bei aktivem Arbeitsblatt <b>Datei: Export: Excel</b>.</li>
<li> Setzen Sie im aufgerufenen Dialog <b>Bl&auml;tter exportieren</b> auf <b>Gesamte Mappe</b> oder <b>Nur aktives Blatt</b>.</li>
<li> Aktivieren Sie optional das Kontrollk&auml;stchen <b>Zellenformate exportieren</b>, um numerische und Stilformate (Dezimalstellen, Schrift, Hintergrundfarbe etc.) zu exportieren.</li></ol>
<dl><dd><a  class="image"><img alt="UG expExcel format.png" src="../images/Publishing_and_Export/UG_expExcel_format.png" width="491"  /></a></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Informationen zum Kopieren der Analyseberichtsbl&auml;tter und ihr Einf&uuml;gen in MS-Office-Anwendungen finden Sie unter <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_copy_report_sheet_table_and_paste_into_PowerPoint_or_Word.html">FAQ-815 Wie kopiere ich eine Berichtsblatttabelle und f&uuml;ge sie in Word, Excel oder PowerPoint ein?</a></p></td></tr></table>
<h3><a name="As_SQLite"></a><span class="mw-headline">Als SQLite</span></h3>
<p>Diese Option exportiert die aktiven Arbeitsbl&auml;tter als eine SQLite-Datei. Legen Sie eine Dateierweiterung von .<i>sqlite</i>, .<i>sqlite3</i> oder .<i>db</i> fest (Achten Sie darauf, dass die Dateistruktur identisch ist). Optionen zum &Uuml;berspringen von verborgenen Spalten oder Zeilen. Beschr&auml;nkt auf den Export von Daten in Arbeitsblattspalten.</p>
<h3><a name="As_Multipage_PDF_File"></a><span class="mw-headline">Als mehrseitige PDF-Datei</span></h3>
<p>Diese Option ist nur auf Bl&auml;ttern mit Datenspalten verf&uuml;gbar und nicht f&uuml;r <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Analysis_Report_Sheets" title="OriginLab:How to Handle Repetitive Tasks">Analyseberichtsbl&auml;tter</a>. Verwenden Sie den Men&uuml;befehl <b>Ansicht: Seitenumbruch in Druckvorschau</b>, um die vertikalen und horizontalen Seitenumbruchslinien anzuzeigen, die bestimmen, welche Spalten und Zeilen auf jeder Seite des Exports eingeschlossen sind. Frei bewegliche oder eingebettete Diagramme, die in dem Arbeitsblatt platziert sind, sind in dem exportierten Bild enthalten.</p>
<h3><a name="As_Image_File"></a><span class="mw-headline">Als Bilddatei</span></h3>
<p>Diese Option ist f&uuml;r sowohl Daten- als auch <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Analysis_Report_Sheets" title="OriginLab:How to Handle Repetitive Tasks">Analyseberichtsbl&auml;tter</a> verf&uuml;gbar.</p>
<ol><li> W&auml;hlen Sie bei aktivem Arbeitsblatt <b>Datei: Export: Als Bilddatei</b>.</li>
<li> In dem aufgerufenen Dialog  </li></ol>
<dl><dd><ul><li>werden Bilddateiformate, einschlie&szlig;lich PDF und SVG, unterst&uuml;tzt. </li>
<li>Frei bewegliche oder eingebettete Diagramme, die in dem Arbeitsblatt platziert sind, sind in dem exportierten Bild enthalten.</li>
<li>Setzen Sie den <b>Exportbereich</b> auf <b>Sichtbar</b>, <b>Gesamt</b> oder <b>Auswahl</b>. Beachten Sie, dass leere Zeilen nicht mehr exportiert werden, wenn <b>Exportbereich</b> = <b>Gesamt</b>.</li>
<li> Der Rahmen wird per Standard zum exportierten Arbeitsblatt hinzugef&uuml;gt. &Auml;ndern Sie die Rahmendicke oder entfernen Sie den Rahmen. Sie k&ouml;nnen die <b>Rahmendicke</b> in der Auswahlliste festlegen.</li></ul></dd>
<dd><a  class="image"><img alt="UG export worksheet as image border.png" src="../images/Publishing_and_Export/UG_export_worksheet_as_image_border.png" width="566"  /></a></dd></dl>
<h3><a name="As_PDF_File"></a><span class="mw-headline">Als PDF-Datei</span></h3>
<p>Diese Option ist f&uuml;r sowohl Daten- als auch <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Analysis_Report_Sheets" title="OriginLab:How to Handle Repetitive Tasks">Analyseberichtsbl&auml;tter</a> verf&uuml;gbar. In dem aufgerufenen Dialog k&ouml;nnen Sie ausw&auml;hlen, ob das gesamte Blatt, der sichtbare Bereich oder eine Auswahl exportiert werden soll. Frei bewegliche oder eingebettete Diagramme werden in die exportierte PDF-Datei eingeschlossen.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Beim Erstellen eines benutzerdefinierten Berichts basierend auf einem Arbeitsblatt, das Daten, numerische Ergebnisse und Diagramme kombiniert, besteht die beste Option darin, das gesamte Blatt als eine PDF-Datei oder das Blatt als eine mehrseitige PDF-Datei zu exportieren.</p></td></tr></table>
<h2><a name="Send_Graphs_to_PowerPoint"></a><span class="mw-headline">Grafiken an PowerPoint senden</span></h2>
<p><span class="OIndex" style="display:none">Grafiken, An PowerPoint senden</span> <span class="OIndex" style="display:none">PowerPoint, Exportieren in</span> Sie k&ouml;nnen eine Gruppe von Origin-Diagrammen an MS PowerPoint als Bilder oder als eingebettete Objekte senden (siehe Einschr&auml;nkungen der eingebetteten Objekte und <b>Master Items</b>, wie <a href="#The_Master_Page">oben</a> beschrieben). Diagramme, die als eingebettete Objekte eingef&uuml;gt sind, k&ouml;nnen in Ihrer Origin-Software weiter bearbeitet werden. Klicken Sie dann doppelt auf das Diagramm, um das Diagramm in einer OLE-Instanz von Origin zu &ouml;ffnen.</p><p><br /> <i><b>Grafiken an PowerPoint senden</b></i></p>
<ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Grafiken an PowerPoint senden</b> <a  class="image"><img alt="Buttons send graphs to PowerPoint.png" src="../images/Publishing_and_Export/Buttons_send_graphs_to_PowerPoint.png" width="22"  /></a> in der Symbolleiste Standard.</li></ol>
<p><i>oder ...</i></p>
<ol><li> Klicken Sie auf das Symbol <b>Send Graphs to PowerPoint</b> <a  class="image"><img alt="APP SG2PP.png" src="../images/Publishing_and_Export/APP_SG2PP.png" width="34"  /></a> in der <a href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Apps_Gallery_and_App_Center" title="OriginLab:The Origin Interface">Apps-Galerie</a>, die rechts von Ihrem Origin-Arbeitsbereich angesiedelt ist (wenn Sie die Apps-Galerie nicht sehen, klicken Sie auf <b>Ansicht: Apps</b> oder dr&uuml;cken Sie ALT + 9).</li></ol>
<p><i>oder ...</i></p>
<ol><li> Klicken Sie mit der rechten Maustaste in das untere Bedienfeld des <a href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Project_Explorer" title="OriginLab:The Origin Interface">Projekt Explorers</a> und w&auml;hlen Sie <b>Grafiken an PowerPoint senden</b>. </li></ol>
<p><br /></p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b> Tutorial: Send Graphs to PowerPoint</b></p>
<ol><li> F&uuml;hren Sie Origin aus und &ouml;ffnen Sie die Sample-Datei <i>&lt;Origin-Ordner&gt;</i>\Samples\Graphing\Column and Bar.opju.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Grafiken an PowerPoint senden</b> <a  class="image"><img alt="Buttons send graphs to PowerPoint.png" src="../images/Publishing_and_Export/Buttons_send_graphs_to_PowerPoint.png" width="22"  /></a> in der Symbolleiste Standard.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Diagramm(e) ausw&auml;hlen</b> und w&auml;hlen Sie <b>Festgelegt</b>.</li>
<li> W&auml;hlen Sie alle au&szlig;er <i>Graph5B</i> im linken Bedienfeld und verschieben Sie sie ins rechte Bedienfeld, indem Sie auf <a  class="image"><img alt="Button Add Files.png" src="../images/Publishing_and_Export/Button_Add_Files.png" width="30"  /></a> in der Mitte des Dialogs klicken. Klicken Sie auf <b>OK</b>. Es wird eine scrollbare Liste der Diagramme zum linken Bedienfeld in der App hinzugef&uuml;gt.</li>
<li> Setzen Sie <b>Insert Graph as</b> = <b>Picture</b>.</li>
<li> Setzen Sie die obere Dimension von <b>Slide Margin</b> auf <i>8 %</i> und belassen Sie die anderen auf <i>0</i>.</li>
<li> Setzen Sie die <b>Title Line</b> = <b>Top of Slide</b> und den <b>Title</b> = <i>Fensterlangname</i>.</li>
<li> Setzen Sie <b>Startfolienindex</b> = <i>3</i> und den <b>Folienmodus</b> = <b>Neue &ouml;ffnen</b>.</li>
<li> Verwenden Sie die Schaltfl&auml;che Durchsuchen neben <b>Load File/Template (optional)</b>, um die Datei <i>&lt;Origin EXE Folder&gt;</i>\Samples\Import and Export\Column_Plots_in_Sample_OPJ.pptx zu laden.</li>
<li> Legen Sie einen Ausgabepfad f&uuml;r <b>Save File as (optional)</b> f&uuml;r die sich ergebende PPTX-Datei fest.</li></ol>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Es gibt auch eine <a class="external text" href="https://www.originlab.com/fileExchange/details.aspx?fid=238" target="_blank">App <b>Send Graphs to Word</b></a>, die in Ihrer Origin-Software vorinstalliert ist. Diese App ist besonders n&uuml;tzlich f&uuml;r den <a class="external text" href="../../Tutorial/Tutorial/Batch_Processing_with_Word_Template_for_Reporting.html">Stapelexport von Diagrammen in ein MS-Word-Dokument mit Textmarken</a>.</p></td></tr></table>
<h2><a name="Slide_Show_of_Graphs"></a><span class="mw-headline">Slide-Show der Grafiken</span></h2>
<p><span class="OIndex" style="display:none">Grafiken, Slide-Show</span> <span class="OIndex" style="display:none">Slide-Show der Grafiken</span> Origin verf&uuml;gt &uuml;ber ein integriertes Hilfsmittel zum Erstellen einer Slide-Show, die Ihre Diagramme, w&auml;hrend Origin ausgef&uuml;hrt wird, anzeigt und pr&auml;sentiert. Es gibt zwei M&ouml;glichkeiten, um die Slide-Show aufzurufen:</p>
<ul><li> Klicken Sie mit der rechten Maustaste auf einen beliebigen Ordner im <b>Projekt Explorer</b> und w&auml;hlen Sie <b>Slide-Show der Grafiken.</b> </li></ul>
<p><i>oder</i></p>
<ul><li> Klicken Sie auf die Schaltfl&auml;che <b>Slide-Show der Grafiken</b> <a  class="image"><img alt="Button Slide Show Graphs.png" src="../images/Publishing_and_Export/Button_Slide_Show_Graphs.png" width="22"  /></a> auf der Symbolleiste <b>Standard</b>. </li></ul>
<p>Es wird ein Dialog ge&ouml;ffnet, in dem Sie Optionen zum Festlegen der Folienreihenfolge, der Zykluszeit, dem Einf&uuml;gen von Diagrammen in Unterordner usw. finden. Der Dialog listet auch Tastenkombinationen auf, die w&auml;hrend der Slide-Show verwendet werden k&ouml;nnen (z.B. <b>G</b> = Zu dem tats&auml;chlichen Diagrammfenster der aktuell angezeigten Folie gehen).</p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><p><b> Tutorial: Slide-Show der Diagramme</b></p>
<ol><li> Verwenden Sie das Men&uuml; <b>Datei: Sample-Projekt &ouml;ffnen: 2D- und Konturdiagramme</b>, um das Sample-Projekt zu &ouml;ffnen.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Slide-Show der Grafiken </b>in der <b>Symbolleiste Standard</b>.</li>
<li> &Uuml;bernehmen Sie die Standardeinstellungen in dem sich &ouml;ffnenden Dialog und klicken Sie auf <b>OK</b>, um die Slide-Show zu starten.</li>
<li> Sie k&ouml;nnen die Pfeiltasten f&uuml;r Aufw&auml;rts/Abw&auml;rts oder das Scrollrad verwenden, um durch die Folien zu bl&auml;ttern. </li></ol>
</td></tr></table>
<h2><a name="Creating_Movies"></a><span class="mw-headline">Animationen erstellen</span></h2>
<p><span class="OIndex" style="display:none">Diagramme, Animationen erstellen aus</span> <span class="OIndex" style="display:none">Animationen aus Diagrammen erstellen</span> <span class="OIndex" style="display:none">Videos, Animationen aus Diagrammen erstellen</span> <span class="OIndex" style="display:none">Animation erstellen</span> Origin enth&auml;lt das Hilfsmittel <b>Animationen erstellen</b>, auf das Sie &uuml;ber die Schaltfl&auml;che <b>Animation erstellen</b> <a  class="image"><img alt="Button Open Video Builder.png" src="../images/Publishing_and_Export/Button_Open_Video_Builder.png" width="23"  /></a> auf der <b>Symbolleiste Standard</b> zugreifen k&ouml;nnen. Dieses Hilfsmittel kann verwendet werden, um manuell eine Reihe von Diagrammfenstern zu erfassen und diese in jeweils einen Frame einer .AVI-Datei zu schreiben.</p><p>Animationen k&ouml;nnen mit Hilfe von LabTalk-Skript oder Origin C-Code erstellt werden. Dazu werden zun&auml;chst Daten programmatisch berechnet oder aktualisiert. Danach wird das Diagramm bei jedem Schritt der Berechnung als Frame in die Animation eingef&uuml;gt.</p>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Exportieren und Ver&ouml;ffentlichen von Diagrammen &gt; <a class="external text" href="../../UserGuide/UserGuide/Creating_Graph_Animation.html">Animation erstellen</a></b></p>
</td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Spezielle Beispiele f&uuml;r per Programm erstellte Animationen, einschlie&szlig;lich Origin-Projekte und Code, stehen unter <a class="external text" href="http://www.originlab.com/animation" target="_blank">www.originlab.com/animation</a> bereit.</p></td></tr></table>
<h2><a name="Notes_Windows_for_Reporting"></a><span class="mw-headline">Notizfenster f&uuml;r Reporting</span></h2>
<p>&Uuml;ber die Zeit hat sich Origins Notizfenster von einem Klartextfenster zum Festhalten Ihrer Forschungsnotizen in ein flexibles Medium zum Zusammenstellen einer Vielzahl von forschungsrelevanten Materialien entwickelt.</p><p>Da das Notizfenster <i>verkn&uuml;pfte</i> Objekte enthalten kann -- Diagramme, Bilder, Werte in Arbeitsblattzellen etc. --, kann es sich das Hinzuf&uuml;gen eines Notizfensters zu einem <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis_Using_an_Analysis_Template" title="OriginLab:How to Handle Repetitive Tasks"><b>Analyse-Template™</b></a> als n&uuml;tzlich erweisen, um die Analyseergebnisse zusammenzufassen. Alternativ k&ouml;nnen Sie Ihre Notizfenster als eine PDF speichern, indem Sie auf <b>Datei: Drucken</b> klicken und einen PDF-Treiber ausw&auml;hlen.</p>
<h3><a name="Notes_Window_Syntax"></a><span class="mw-headline">Syntax des Notizfensters</span></h3>
<p>Origins Notizfenster unterst&uuml;tzt vier Syntaxen: <b>Text</b>, <a href="#Rich_Text"><b>Origin Rich Text</b></a> (Standard), <a href="#HTML_and_Markdown"><b>HTML</b> und <b>Markdown</b></a>.</p>
<ol><li> Um die Syntax zu wechseln, w&auml;hlen Sie <b>Notizen</b>: <b>Syntax</b>: <b>Text</b>.</li>
<li> Wenn Sie <b>Text</b> ausgew&auml;hlt haben, k&ouml;nnen Sie eine der anderen Syntaxen frei im Men&uuml; <b>Notizen</b> ausw&auml;hlen.</li></ol>
<h3><a name="Rich_Text"></a><span class="mw-headline">Rich Text</span></h3>
<p>Mit Rich Text hat das Notizfenster zwei Modi -- den Rohtextmodus und den <b>Render</b>modus. Wechseln Sie zwischen diesen Modi &uuml;ber <b>Notizen: Rendermodus</b> oder die Tastenkombination Strg + M.</p><p>Um Text in das Notizfenster einzuf&uuml;gen, m&uuml;ssen Sie im Rohtextmodus sein. Um den Stil des hinzugef&uuml;gten Texts zu bearbeiten, verwenden Sie die Symbolleiste <b>Format</b> und/oder wenden Sie <a href="#Text_Styles_Manager">vordefinierte Absatzstile</a> an.</p>
<dl><dd><a  class="image"><img alt="UG basic rich text fmt.png" src="../images/Publishing_and_Export/UG_basic_rich_text_fmt.png" width="780"  /></a></dd></dl>
<h4><a name="Adding_Content_to_Your_Notes"></a><span class="mw-headline">Inhalt zu Ihren Notizen hinzuf&uuml;gen</span></h4>
<p>Sie k&ouml;nnen diese Objekte in das Notizfenster einf&uuml;gen, indem Sie mit der rechten Maustaste in das Notizfenster klicken und im Kontextmen&uuml; w&auml;hlen:</p>
<dl><dd><a  class="image"><img alt="UG insert objects shortcut menu notesWin.png" src="../images/Publishing_and_Export/UG_insert_objects_shortcut_menu_notesWin.png" width="571"  /></a></dd></dl>
<table class="simple" style="width: 95%">
<tr>
<th style="width: 20%">Objekt</th>
<th style="width: 75%">Kommentare</th></tr>
<tr>
<td> <b>Diagramm/Bild</b></td>
<td> &Ouml;ffnet den <b>Diagramm-/Bildbrowser</b>, in dem Sie Projektdiagramme und -bilder ausw&auml;hlen k&ouml;nnen. Beachten Sie, dass Sie <b>eingebettete Diagramme</b> (siehe eine Definition des &quot;eingebetteten Diagramms&quot; in der ersten Zeile <a href="#What_Types_of_Data_Can_I_Store_in_the_Workbook.3F">dieser Tabelle</a>) und Shortcuts im &quot;Favoriten&quot;ordner des Projekt Explorers (<a class="external text" href="../../UserGuide/UserGuide/Project_Explorer.html#Create_a_Shortcut_to_a_Window"><b>Shortcut-Seite einschlie&szlig;en</b></a>) zeigen k&ouml;nnen.</td></tr>
<tr>
<td> <b>Arbeitsblattzelle ...</b></td>
<td> &Ouml;ffnet die <a class="external text" href="../../UserGuide/UserGuide/Specifying_Your_Input_Data.html#Using_the_interactive_range_selection_control">interaktive Bereichsauswahl</a>. Verwenden Sie diese Option, um einen Zellenwert in einem Arbeit- oder Berichtsblatt auszuw&auml;hlen. Klicken Sie auf <b>Fertig</b>, um einen verkn&uuml;pften Zellenwert einzuf&uuml;gen.</td></tr>
<tr>
<td> <b>Infovariable ...</b></td>
<td> &Ouml;ffnet den Dialog <a class="external text" href="../../UserGuide/UserGuide/The_Insert_Variables_Dialog_Box.html"><b>Variablen einf&uuml;gen</b></a>, um beim Datenimport gespeicherte Projektvariablen einzuf&uuml;gen.</td></tr>
<tr>
<td> <b>Neue Tabelle</b></td>
<td> &Ouml;ffnet den Dialog <a class="external text" href="../../UserGuide/UserGuide/Origin_Rich_Text.html#New_Table"><b>Neue Tabelle</b></a> zum Konfigurieren einer einfachen Tabelle. Klicken auf <b>OK</b> schlie&szlig;t den Dialog und &ouml;ffnet eine einfache Arbeitsmappe, die ein einzelnes Arbeitsblatt enth&auml;lt. Passen Sie das Arbeitsblatt an, f&uuml;gen Sie Daten hinzu etc., verwenden Sie dann den Rendermodus des Notizfensters, um die Ergebnistabelle anzuzeigen.</td></tr>
<tr>
<td> <b>Abbildung Symbole</b></td>
<td> Dies &ouml;ffnet den <a href="../../GettingStarted/OriginLab/Customizing_Graphs.html#Tips_for_Editing_Your_Graph_Annotations" title="OriginLab:Customizing Graphs">vereinfachten Dialog <b>Abbildung Symbole</b></a> mit Zeichen, die nach Registerkarten sortiert sind. Klicken Sie auf <b>Erweitert</b>, um zur <a class="external text" href="../../UserGuide/UserGuide/Accessing_the_Extended_Character_Set.html">vollst&auml;ndigen Abbildung der Symbole</a> zu gehen.</td></tr>
<tr>
<td> <b>LaTeX-Gleichung</b></td>
<td> &Ouml;ffnet die <a class="external text" href="https://www.originlab.com/fileExchange/details.aspx?fid=221" target="_blank">App LaTeX Equation Editor</a> (falls Sie diese kostenlose App nicht bereits installiert haben, werden Sie aufgefordert, dies nachzuholen). Sie k&ouml;nnen auf die Schaltfl&auml;che <b>Gleichung</b> <a  class="image"><img alt="UG latex equation button.png" src="../images/Publishing_and_Export/UG_latex_equation_button.png" width="26"  /></a> klicken, um eine Liste von Origins Anpassungsfunktionen (inkl. Ihrer benutzerdefinierten Funktionen) zu &ouml;ffnen. W&auml;hlen Sie eine Funktion (oder geben Sie eine Funktion in das obere Feld ein) und klicken Sie auf <b>Vorschau</b>, um Ihre Gleichung gerendert zu sehen.</td></tr>
<tr>
<td> <b>Verkn&uuml;pfen</b></td>
<td> &Ouml;ffnet einen Dialog zum Eingeben des <b>anzuzeigenden Textes</b> und eines <b>Links</b>. Der Link kann eine URL oder <a class="external text" href="../../UserGuide/UserGuide/Add_hyperlinks_to_text_labels.html">ein Link zu Elementen</a> wie einem Arbeitsblattdatenbereich sein (z. B. range://[book1]sheet1!col(1)[100]). Zus&auml;tzlich k&ouml;nnen Sie einfache LabTalk-Befehle mit dem Tag &quot;labtalk://&quot; ausf&uuml;hren (z. B. labtalk://newsheet).</td></tr>
<tr>
<td> <b>Bild aus Datei</b></td>
<td> &Ouml;ffnet einen Dialog zum Durchsuchen von Bilddateien. Beachten Sie, dass das eingef&uuml;gte Bild mit einer externen Datei verkn&uuml;pft ist und nicht mit dem Projekt gespeichert wird.</td></tr>
<tr>
<td> <b>Bild aus Web</b></td>
<td> &Ouml;ffnet einen Dialog, um einen <b>Bildlink</b> f&uuml;r ein Web-Bild festzulegen (<b>Hinweis</b>: Klicken Sie in Ihrem Browser mit der rechten Maustaste auf ein Bild und dann auf <b>Bildadresse kopieren</b>, <b>Bildlink kopieren</b> etc).</td></tr></table>
<p><br /></p>
<ol><li> F&uuml;gen Sie Ihren Inhalt unter Verwendung des Rohtextmodus&apos; hinzu. </li>
<li> Wenn Sie bereit sind, Ihren Inhalt anzusehen, aktivieren Sie (durch ein H&auml;kchen daneben) <b>Notizen: Rendermodus</b> oder dr&uuml;cken Sie Strg + M. Beachten Sie, dass Sie das Kombinationsfeld <b>Zoom</b> <a  class="image"><img alt="Standard button zoom combo.png" src="../images/Publishing_and_Export/Standard_button_zoom_combo.png" width="65"  /></a> auf der Standardsymbolleiste verwenden k&ouml;nnen, um in die Seite hinein- oder aus ihr herauszuzoomen (Strg + Mausrad funktioniert ebenso).</li></ol>
<dl><dd><a  class="image"><img alt="UG cell notes rich text images.png" src="../images/Publishing_and_Export/UG_cell_notes_rich_text_images.png" width="799"  /></a></dd></dl>
<h4><a name="Text_Styles_Manager"></a><span class="mw-headline">Textstile verwalten</span></h4>
<p>Zus&auml;tzlich zum Bearbeiten des Textstils mit der Symbolleiste <b>Format</b> k&ouml;nnen Sie einen einfachen Satz von Absatzstilen auf Zeilenbasis anwenden. Verwalten Sie Stile mit dem Dialog <b>Textstile verwalten</b>.</p>
<ol><li> W&auml;hlen Sie bei aktivem Arbeitsblatt <b>Hilfsmittel: Textstile verwalten</b>.</li>
<li> W&auml;hlen Sie einen <b>zu modifizierenden Stil</b> und dann <b>Anwenden</b> oder <b>Schlie&szlig;en</b>. </li></ol>
<dl><dd><dl><dd><a  class="image"><img alt="UG mod txt styles dlg.png" src="../images/Publishing_and_Export/UG_mod_txt_styles_dlg.png" width="290"  /></a></dd></dl></dd></dl>
<p>Beachten Sie, dass Sie Stile durch Auswahl von <i>&lt;neu&gt;</i> in der Auswahlliste <b>Zu modifizierende Stile</b> hinzuf&uuml;gen k&ouml;nnen oder einen Stil ausw&auml;hlen und <b>l&ouml;schen</b>.</p><p>Um einen Absatzstil auf einen Text im Notizfenster anzuwenden:</p>
<ol><li> &Ouml;ffnen Sie die Zellennotiz in einem Notizfenster.</li>
<li> Klicken Sie bei inaktivem <b>Rendermodus</b> (Umschalten mit Strg + M) auf eine Textzeile. Klicken Sie dann mit der rechten Maustaste und w&auml;hlen Sie erst <b>Absatzstile</b> und dann einen Stil aus dem Popupmen&uuml;.</li>
<li> Um die Ergebnisse zu pr&uuml;fen, dr&uuml;cken Sie Strg + M (<b>Rendermodus</b>).</li></ol>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Um eine Liste der Standardabsatzstille anzusehen, &ouml;ffnen Sie ein neues Notizfenster und w&auml;hlen Sie dann im Men&uuml; <b>Notizen: Beispiele laden: Built-in Styles.txt</b>.</p></td></tr></table>
<h4><a name="Adding_Rich_Text_Content_to_Layout_or_Graph"></a><span class="mw-headline">Rich-Text-Inhalt zu Layout oder Diagramm hinzuf&uuml;gen</span></h4>
<p>Sie k&ouml;nnen den Rich-Text-Inhalt eines Notizfensters zu einem Textobjekt auf einer Layout- oder Diagrammseite hinzuf&uuml;gen.</p>
<dl><dd><a  class="image"><img alt="UG insert notes text to layout.png" src="../images/Publishing_and_Export/UG_insert_notes_text_to_layout.png" width="659"  /></a></dd></dl>
<p><br /> <i><b>Um den Inhalt einer existierenden Notiz (Layout oder Diagramm) hinzuzuf&uuml;gen:</b></i></p>
<ol><li> W&auml;hlen Sie das Hilfsmittel <b>Text einf&uuml;gen</b> <a  class="image"><img alt="Text button.png" src="../images/Publishing_and_Export/Text_button.png" width="23"  /></a>, kicken Sie dann auf das Layout/Diagramm und geben Sie &quot;<b>@@@Notes<i>N</i></b>&quot; ein (d. h. den Kurznamen des Notizfensters).</li>
<li> Klicken Sie auf das Textobjekt, um den Notizinhalt einzuf&uuml;gen.</li></ol>
<p><br /> <i><b>Um Inhalt durch Erstellen einer neuen Notiz (nur Layout) hinzuzuf&uuml;gen:</b></i></p>
<ol><li> Klicken Sie mit der rechten Maustaste auf das Layout und w&auml;hlen Sie <b>Notiztext einf&uuml;gen</b>.</li>
<li> Siehe <a href="#Adding_Content_to_Your_Notes"><b>Inhalt zu Ihren Notizen hinzuf&uuml;gen</b></a>.</li></ol>
<h4><a name="Print_or_Export_to_PDF"></a><span class="mw-headline">Drucken oder in PDF exportieren</span></h4>
<p>Sie k&ouml;nnen Rich-Text-Inhalt auf einem physischen Drucker ausgeben oder ihn mit Hilfe des Treibers eines Drittanbieters, wie Microsoft Print to PDF, in einem PDF drucken.</p><p>Um eine attraktive Ausgabe zu erreichen, m&uuml;ssen Sie auf diese Einstellungen achten:</p>
<ul><li> <b>Papiergr&ouml;&szlig;e</b>: Dies legen Sie in <b>Datei: Seite einrichten</b> oder in den <b>Erweiterten</b> Optionen f&uuml;r Ihren Druckertreiber fest.</li>
<li> <b>R&auml;nder</b>: Sie werden unter <b>Datei: Seite einrichten</b> festgelegt.</li>
<li> <b>Anzeigerand der Notizen</b>: Per Standard ist der Anzeigerand der Notizen = <i>5</i> (Einheiten = Punkte). Sie werden daher feststellen, dass es im <b>Rendermodus</b> (Strg + M) eine schmalen Rand links von der Notizen gibt. Dieser Anzeigerand wird &uuml;ber die Systemvariable <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#N"><b>@NDM</b></a> gesteuert. </li>
<li>  <b>Seitenbreite des Notizfensters</b>: Die Seitenbreite wird von der Eigenschaft <code>note.width</code> (Einheiten = in/cm etc) gesteuert. Standardwert = <i>0</i>, was einer nicht festgelegten Breite entspricht. </li></ul>
<dl><dd><ul><li> Wenn die Breite nicht gesteuert wird (<code>note.width = 0</code>), ist die <b>Seitenbreite des Notizfensters</b> ungef&auml;hr gleich der <b>Papiergr&ouml;&szlig;e</b> &ndash; <b>R&auml;ndern</b>. Dies sollte einen zufriedenstellenden Ausdruck in PDF oder auf Papier erstellen.</li>
<li> Wenn Sie <code>note.width</code> festlegen, &uuml;berschreiten Sie nicht <b>Papiergr&ouml;&szlig;e</b> &ndash; <b>R&auml;nder</b>, sonst wird Ihr Text eventuell abgeschnitten.</li></ul></dd></dl>
<h3><a name="HTML_and_Markdown"></a><span class="mw-headline">HTML und Markdown</span></h3>
<p>Sie k&ouml;nnen auch das <b>Notiz</b>fenster verwenden, um HTML- oder Markdown-Berichte zu erstellen. Wie bei Rich Text k&ouml;nnen Sie Ihren HTML-Bericht mit Hilfe von Platzhaltern erstellen, die zu Berichtsblattelementen wie Metadaten, statistischen Ergebnisse oder Diagrammen verlinken. Der resultierende HTML-Bericht kann gedruckt oder exportiert werden oder er kann in Ihre <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis_Using_an_Analysis_Template" title="OriginLab:How to Handle Repetitive Tasks">Analysevorlage</a> eingebunden werden. Wenn Markdown verwendet wird, kann HTML optional f&uuml;r die erweiterte benutzerdefinierte Anpassung eingeschlossen werden.</p><p>Um diese Funktion zu verwenden, sollte der Anwender mit den Grundlagen von HTML bzw. Markdown vertraut sein. Wie bei den meisten Dingen gilt auch hier, je ge&uuml;bter ein Anwender ist, desto einfach wird es f&uuml;r ihn sein, professionell aussehende Ausgaben zu erzeugen. Allerdings kann die F&auml;higkeit, die es braucht, um einen einfachen Bericht zu erstellen, leicht erworben werden. Aneisungen finden Sie in <a class="external text" href="http://blog.originlab.com/publishing/creating-html-reports-and-documents-in-origin-2019b" target="_blank">diesen Blogeintrag von OriginLab</a>.</p>
<dl><dd><a  class="image"><img alt="HTML Reports.png" src="../images/Publishing_and_Export/850px-HTML_Reports.png" width="850"   /></a></dd></dl>
<h4><a name="Adding_Content_to_Your_HTML_Report"></a><span class="mw-headline">Inhalt zu Ihrem HTML-Bericht hinzuf&uuml;gen</span></h4>
<p><i><b>Die grundlegenden Schritte zum Erstellen von Berichten mit Hilfe eines Origin-Notizfensters sind die folgenden:</b></i></p>
<ol><li> Erstellen Sie Ihr Projekt und schlie&szlig;en Sie Grafik- und Analyseergebnisse ein.</li>
<li> Klicken Sie auf die Schaltfl&auml;che <b>Neue Notizen</b> <a  class="image"><img alt="Button New Notes.png" src="../images/Publishing_and_Export/Button_New_Notes.png" width="23"  /></a>, um ein neues Notizfenster zu erstellen.</li>
<li> W&auml;hlen Sie im Men&uuml; <b>Notizen: Syntax</b>, dann <b>HTML</b> oder <b>Markdown</b> (<b>Hinweis</b>: Sie k&ouml;nnen zwischen Text/Ansicht und Markup-Modi durch Dr&uuml;cken von <b>STRG+M</b> wechseln und die Standardsyntax durch Festlegen der LabTalk-Systemvariablen <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#N"><b>@NPS</b></a> w&auml;hlen).</li>
<li> Sie k&ouml;nnen Ihren Code im Mae  Yo u can write your code in the Notes window&apos;s markup mode or you can use a text editor such as Notepad++, then copy and paste it to your Notes window. Wenn Sie keine Erfahrung mit HTML oder Markdown haben, m&ouml;chten Sie vielleicht Beispiele laden, indem Sie Ihr Notizfenster aktivieren und auf <b>Notizen: Beispiele laden</b> klicken (HTML = &quot;.html&quot;, Markdown = &quot;.md&quot;).</li>
<li> Sie werden wahrscheinlich die Grafik- und Analyseergebnisse Ihres aktuellen projekts in Ihren Bericht einbinden wollen. Der einfachste Weg, dies zu tun, besteht darin, in Ihrem Code &quot;Platzhalter&quot; f&uuml;r jedes Origin-Objekt, das Sie in Ihren Bericht einbinden m&ouml;chten, einzuf&uuml;gen. Diese Platzhalter k&ouml;nnen mittels jeder Zeichenkette, die Ihnen sinnvoll erscheint, benannt werden und sie sollten in doppelten geschweiften Klammern stehen (z. B. <code>{{MyR-SquareValue}}</code>).</li>
<li> Klicken Sie mit der rechten Maustaste auf die Titelleiste des Notizfensters und w&auml;hlen Sie <b>Platzhalter bearbeiten</b>. Platzhalter, die Sie in Ihren Code eingebunden haben, wird ausgew&auml;hlt und zu einem Arbeitsblatt <b>Platzhalter</b> in der Arbeitsmappe hinzugef&uuml;gt. Das Blatt listet in Spalte A alle Platzhalter auf, die in Ihrem Code gefunden wurden. Eine zweite Spalte -- Spalte B -- ist leer und zum Hinzuf&uuml;gen der verbundenen Origin-Objekte reserviert (d. h. Variablen, Analyse- und Grafikergebnisse etc.), die Sie in Ihrem Bericht einschlie&szlig;en m&ouml;chten.</li>
<li> Suchen Sie f&uuml;r jeden Platzhalter in Spalte A das zugeh&ouml;rige Origin-Objekt und kopieren Sie es in die Zwischenablage (wenn es sich z. B. um eine numerische Eigenschaft in einem Blatt handelt, die sich aus einer statistischen Analyse ergibt, markieren Sie die Zelleneigenschaft, klicken Sie mit der  rechten Maustaste und w&auml;hlen Sie <b>Kopieren</b> oder dr&uuml;cken Sie Strg+C auf Ihrer Tastatur).</li>
<li> Kehren Sie zur&uuml;ck zum Blatt <b>Platzhalter</b>, klicken Sie mit der rechten Maustaste in Spalte B neben dem zugeh&ouml;rigen Platzhalter und w&auml;hlen Sie <b>Verkn&uuml;pfung einf&uuml;gen</b>. Dies verbindet Ihren Platzhalter mit dem bestimmten Origin-Objekt.</li>
<li> Wenn Sie beabsichtigen, Ihren HTML-Bericht in eine Analysevorlage einbinden m&ouml;chten, k&ouml;nnen Sie mit der rechten Maustaste auf einen Arbeitsmappenreiter in Ihrer Analysevorlage klicken und <b>Notizen als Blatt hinzuf&uuml;gen</b> w&auml;hlen. Dies f&uuml;gt Ihr Notizfenster in die Arbeitsmappe ein, und Sie k&ouml;nnen jetzt <b>Datei: Arbeitsmappe als Analysevorlage speichern</b> w&auml;hlen.</li></ol>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Publishing_and_Export/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn ein Notizfenster aktiv ist, k&ouml;nnen Sie im Men&uuml; <b>Notizen</b> ausw&auml;hlen und eine HTML-Beispieldatei in das Notizfenster laden.</p>
<dl><dd><dl><dd><a  class="image"><img alt="HTML load samples.png" src="../images/Publishing_and_Export/HTML_load_samples.png" width="450"  /></a></dd></dl></dd></dl>
</td></tr></table>
<h4><a name="Using_Your_HTML_Report"></a><span class="mw-headline">Ihren HTML-Bericht verwenden</span></h4>
<p>W&auml;hrend Sie Ihr Platzhalterblatt f&uuml;llen, sollten Sie sehen, wie Ihr HTML-Bericht im Notizfenster Form annimmt. Sobald es fertiggestellt ist, k&ouml;nnen Sie verschiedene Dinge mit Ihrem HTML-Bericht tun, einschlie&szlig;lich:</p>
<ul><li> Papierausdruck oder PDF ausdrucken (<b>Datei: Drucken</b>).</li>
<li> Fenster als Webseite exportieren (<b>Notizen: In Webseite exportieren</b>).</li>
<li> Klicken Sie auf die Schaltfl&auml;che Einbetten in der oberen rechten Ecke des Notizfensters, um den Inhalt in Ihre Arbeitsmappe einzubetten. Speichern Sie dann die Arbeitsmappe als eine <a href="../../GettingStarted/OriginLab/How_to_Handle_Repetitive_Tasks.html#Batch_Analysis_Using_an_Analysis_Template" title="OriginLab:How to Handle Repetitive Tasks">Analysevorlage</a> (<b>Datei: Arbeitsmappe als Analysevorlage speichern</b>).</li></ul>
<h2><a name="Topics_for_Further_Reading"></a><span class="mw-headline">Weiterf&uuml;hrende Themen</span></h2>
<ul><li> <a class="external text" href="../../UserGuide/UserGuide/The_(Options)_Page_Tab.html">Die Seiteneinstellungen unter <b>Einstellungen: Optionen</b></a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Pasting_or_Embedding_Graphs_in_other_Applications.html">Diagramme in andere Anwendungen einf&uuml;gen oder einbetten</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Exporting_Your_Graph_or_Layout_Page_to_an_Image_File.html">Diagramme oder Layoutseiten in eine Bilddatei exportieren</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Which_Export_Format_Should_I_Choose.html">Welches Bildformat soll ich nehmen?</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/The_Export_Graph_Dialog_Box.html">Dialog Grafiken exportieren</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Project_Explorer.html#View_Graphs_as_Slide_Show_or_Send_Graphs_to_PowerPoint">Grafiken an PowerPoint senden</a></li>
<li> <a class="external text" href="../../XFunction/X-Function/Pef_pptslide.html">Einstellungen im Dialog Grafiken an PowerPoint senden</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Project_Explorer.html#View_Graphs_as_Slide_Show_or_Send_Graphs_to_PowerPoint">Slide-Show der Grafiken</a></li>
<li> <a class="external text" href="../../XFunction/X-Function/Pef_slideshow.html">Einstellungen im Dialog Slide-Show der Grafiken</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Creating_Graph_Animation.html">Animationen erstellen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Printing_Graphs_Layout_Pages_and_Analytical_Results.html">Diagramme, Layoutseiten und analytische Ergebnisse drucken</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/The_Print_Dialog_Box.html">Der Dialog Drucken</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/The_Print_Option_Dialog_Box.html">Der Dialog Druckoptionen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Copying_and_Pasting_Graphs_inside_Origin.html">Diagramme in Origin kopieren und einf&uuml;gen</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Inserting_Graphs_Images_and_Other_Objects_into_Worksheet_Cells.html">Diagramme und Bilder in Arbeitsblattzellen einf&uuml;gen</a></li>
<li> <a class="external text" href="../../Tutorial/Tutorial/Creating_a_Custom_Report_Sheet.html">Tutorial: Ein benutzerdefiniertes Berichtsblatt erstellen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Using_the_Layout_Page_Window.html">Das Layoutseitenfenster verwenden</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Creating_a_master_Page_Layout_for_Graphs.html">Ein Master-Seitenlayout f&uuml;r Diagramme erstellen</a></li></ul>



    