<h1 class="firstHeading">Origin-Projekte gemeinsam nutzen</h1><p class='urlname' style='display: none'>Sharing-Files</p>
<dl><dd><a  class="image"><img alt="Grand image sharing files.png" src="../images/Sharing_Origin_Files/Grand_image_sharing_files.png" width="650"  /></a></dd></dl>
<p>M&ouml;glicherweise m&ouml;chten Sie einige Aspekte Ihrer Origin-Installation benutzerdefiniert anpassen und diese Anpassungen dann mit anderen Origin-Benutzern teilen. Benutzerdefinierte Einstellungen k&ouml;nnen in vielen Dateitypen, einschlie&szlig;lich Diagrammvorlagen (.otpu) und -designs (.oth), Analysevorlagen (.ogwu oder .opju), Dialogdesigns, Kurvenanpassungsfunktionen, Filtern des Importassistenten, LabTalk-Skriptdateien (.OGS) und X-Funktionen, gespeichert werden.</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Drag_and_Drop_Sharing"><span class="tocnumber">1</span> <span class="toctext">Mit Drag&amp;Drop teilen</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Sharing_Files_with_Multiple_Machines_for_Single_Users"><span class="tocnumber">2</span> <span class="toctext">Dateien auf mehreren Rechnern f&uuml;r einzelne Anwender teilen</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Sharing_Files_with_Other_Users_in_a_Network"><span class="tocnumber">3</span> <span class="toctext">Dateien mit anderen Anwendern in einem Netzwerk teilen</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Packaging_Files"><span class="tocnumber">4</span> <span class="toctext">Dateien packen</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#The_Origin_Viewer"><span class="tocnumber">5</span> <span class="toctext">Der Origin-Viewer</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#Topics_for_Further_Reading"><span class="tocnumber">6</span> <span class="toctext">Weiterf&uuml;hrende Themen</span></a></li>
</ul>
</div>

<h2><a name="Drag_and_Drop_Sharing"></a><span class="mw-headline">Teilen per Drag&amp;Drop</span></h2>
<p><span class="OIndex" style="display:none">Origin-Dateien per Drag&amp;Drop teilen</span> <span class="OIndex" style="display:none">Origin, Dateien gemeinsam nutzen</span><span class="OIndex" style="display:none">Origin-Dateien gemeinsam nutzen</span> Eine schnelle und einfache M&ouml;glichkeit, eine Datei mit anderen Anwendern gemeinsam zu nutzen, besteht in ihrem Versenden als E-Mail-Anhang. Der Empf&auml;nger kann die Datei dann mit Drag&amp;Drop in seinen Arbeitsbereich von Origin ziehen.</p><p>Der Vorgang des Drag&amp;Drop wird f&uuml;r die meisten Origin-Dateitypen unterst&uuml;tzt. Projektdateien (.opju) und Diagrammvorlagen (.otpu) von Origin werden automatisch ge&ouml;ffnet, nachdem sie im Arbeitsbereich &quot;fallen gelassen&quot; wurden. Andere Dateien werden in die entsprechenden Unterordner im Anwenderdateiordner kopiert. Wenn Sie beispielsweise eine Fitfunktionsdatei (.fdf) in den Arbeitsbereich ziehen, wird ein Dialog ge&ouml;ffnet, der nachfragt, wie Sie die neue Fitfunktion kategorisieren m&ouml;chten.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Sharing_Origin_Files/Tip_icon.png" width="57"  border="0" /></td><td><p>Sie k&ouml;nnen einen kleinen Dialog zum <a href="../../GettingStarted/OriginLab/Workbooks_Worksheets_Columns.html#Remove_Formula.2FLinks" title="OriginLab:Workbooks Worksheets Columns">Entfernen von Formeln und Links</a> aus der aktuellen Auswahl, dem aktiven Blatt, der aktiven Mappe oder dem gesamten Projekt verwenden. Diese Option wandelt Formeln und Links in Rohzahlen um. Das Entfernen von Formeln und Links kann es einfacher machen, Projektdaten mit Kollegen zu teilen, ohne Dinge wie extern verkn&uuml;pfte (DDE) Excel-Dateien teilen oder die Projektgr&ouml;&szlig;e vor dem Archivieren der Daten signifikant reduzieren zu m&uuml;ssen.</p></td></tr></table>
<h2><a name="Sharing_Files_with_Multiple_Machines_for_Single_Users"></a><span class="mw-headline">Dateien mit mehreren Rechnern f&uuml;r einzelne Anwender teilen</span></h2>
<p>Wenn Sie ein Einzelbenutzer sind und Origin auf mehreren Rechner installiert haben, k&ouml;nnen Sie Ihre benutzerdefinierten Einstellungen installations&uuml;bergreifend nutzen. Richten Sie den <span class="OIndex">Anwenderdateiordner (UFF)</span> auf einem gemeinsam genutzten Laufwerk ein, z. B. einem Netzwerk oder sogar einem USB-Speicherstick, und verwenden Sie bei jeder Installation den gleichen Pfad f&uuml;r den Anwenderdateiordner.</p>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen zum &Auml;ndern des Pfads f&uuml;r den Anwenderdateiordner finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Benutzerdefinierte Anpassung und Automatisierung &gt; Einstellen Ihrer Voreinstellungen &gt; <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html">Anwenderdateiordner</a></b></p>
</td></tr></table>
<h2><a name="Sharing_Files_with_Other_Users_in_a_Network"></a><span class="mw-headline">Dateien mit anderen Anwendern in einem Netzwerk gemeinsam nutzen</span></h2>
<p><span class="OIndex" style="display:none">Netzwerk, Dateien gemeinsam nutzen</span><span class="OIndex" style="display:none">Netzwerk, Installation</span><span class="OIndex" style="display:none">Dateien mit mehreren Anwendern gemeinsam nutzen</span> Sie k&ouml;nnen einen Gruppenordner einrichten und dazu verwenden, Dateien mit anderen Anwendern zu teilen. Es sind mehrere Gruppen zugelassen. Jede Gruppe kann dabei ihren eigenen, spezifischen Anwender f&uuml;r die Rolle als Gruppenverwalter besitzen. Der Gruppenverwalter kann das Hilfsmittel <b><span class="OIndex">Gruppenordner verwalten</span></b> verwenden, um benutzerdefinierte Dateien zu ver&ouml;ffentlichen und sie auf diese Weise mit anderen Gruppenmitgliedern zu teilen. Wenn Gruppenmitglieder Origin starten, werden die ver&ouml;ffentlichten Dateien automatisch in ihre Origin-Software kopiert und stehen f&uuml;r die weitere Verwendung zur Verf&uuml;gung.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Sharing_Origin_Files/Tip_icon.png" width="57"  border="0" /></td><td><p>Origin unterst&uuml;tzt das Festlegen von mehreren Gruppenordnern, wodurch es m&ouml;glich wird, dass die Gruppen unterschiedliche Dateien gemeinsam nutzen. Der Rechner des Leiters kann mehrere Gruppe einrichten und verschiedene Dateien in verschiedenen Gruppen ver&ouml;ffentlichen. Eine Mitgliederrechner kann zu mehreren Gruppen geh&ouml;ren und auf diese Weise alle Dateien erhalten, die der jeweilige Gruppenleiter ver&ouml;ffentlicht.</p></td></tr></table>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen zu Gruppenordnern finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Gemeinsames Nutzen Ihrer Origin-Dateien mit Dritten &gt; Dateien mit mehreren Anwendern gemeinsam nutzen &gt; <a class="external text" href="../../UserGuide/UserGuide/Set_Group_Folder_Location_Dialog.html">Gruppenordnermanager</a></b></p>
</td></tr></table>
<h2><a name="Packaging_Files"></a><span class="mw-headline">Dateien packen</span></h2>
<p><span class="OIndex" style="display:none">Origin-Dateien packen</span><span class="OIndex" style="display:none">OPX-Dateien</span><span class="OIndex" style="display:none">Packdateien verwalten</span><span class="OIndex" style="display:none">Origin-Datei per Drag&amp;Drop teilen</span><span class="OIndex" style="display:none">Origin, Dateien gemeinsam nutzen</span><span class="OIndex" style="display:none">Origin-Dateien gemeinsam nutzen</span> Origin verf&uuml;gt &uuml;ber ein Hilfsmittel <b>Packdateien verwalten</b>, mit dem mehrere Dateien in eine einzelne Origin-Paketdatei (.opx) gepackt werden k&ouml;nnen. Es bietet damit eine bequeme M&ouml;glichkeit, benutzerdefinierte Applikationen zu verteilen, die mehrere Origin-Dateien, wie Vorlagen, X-Funktionen und LabTalk-Skriptdateien, enthalten. Die Funktion Packdateien verwalten umfasst Optionen zum Ausf&uuml;hren von LabTalk-Skripts vor und nach der Installation.</p><p>Um auf dieses Hilfsmittel zuzugreifen, klicken Sie auf <b>Hilfsmittel</b> und dann auf <b>Packdateien verwalten</b>.</p><p>Zum Installieren einer .opx-Datei ziehen Sie die Datei einfach per Drag&amp;Drop in den Arbeitsbereich von Origin.</p>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen zum Packen von Dateien finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Gemeinsames Nutzen Ihrer Origin-Dateien mit Dritten &gt; <a class="external text" href="../../UserGuide/UserGuide/Packaging_Multiple_Files_as_OPX.html">Mehrere Dateien als OPX packen</a></b></p>
</td></tr></table>
<h2><a name="The_Origin_Viewer"></a><span class="mw-headline">Der Origin-Viewer</span></h2>
<p>Der <b><span class="OIndex">Origin Viewer</span></b> ist eine kostenlose, alleinstehende Anwendung, mit der Informationen aus Origin-Projektdateien und Origin-Fensterdateien (Grafik, Arbeitsblatt, Matrix) auf Computern ohne installiertem Origin angezeigt und kopiert werden k&ouml;nnen.</p>
<ul><li> Der Origin Viewer steht als einzelne EXE-Datei bereit - es ist keine Installation erforderlich.</li>
<li> Verf&uuml;gbar als eine 64-Bit Windows-Anwendung oder als eine native Mac-Anwendung (nicht kompatibel mit 11.0.1, Big Sur).</li>
<li> Wie beim Projekt Explorer wird bei Bewegung der Maus &uuml;ber das entsprechende Objekt eine Diagrammvorschau angezeigt. Au&szlig;erdem bestehen die Ansichtsoptionen Symbole, Details und extragro&szlig;e Symbole.</li>
<li> Zur besseren Ansicht k&ouml;nnen Sie ein Diagramm in einem Popup-Fenster &ouml;ffnen.</li>
<li> Origins 3D-<span class="OIndex">OpenGL</span>-Diagramme k&ouml;nnen angezeigt und gedreht werden.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Sharing_Origin_Files/Tip_icon.png" width="57"  border="0" /></td><td><p>Origin 2018 f&uuml;hrte einen neuen Unicode-kompatiblen Projektdateityp ein -- die OPJU-Datei. Mit Versionen des Origin Viewer <b>9.6.5</b> oder h&ouml;her kann jeder die neuen Unicode-kompatiblen OPJU-Projektdateien im OPJ-Format der Vorg&auml;ngerversion von 2018 speichern, um Projekte mit Benutzern der &auml;lteren Versionen von Origin zu teilen.</p></td></tr></table>
<p><br /> Wenn Sie Origin-Diagramme oder -Daten haben, die Sie mit Kollegen teilen m&ouml;chten, die zurzeit kein Origin verwenden, k&ouml;nnen Sie die Seite des Origin-Viewers (<a class="external text" href="http://www.originlab.com/viewer/" target="_blank">http://originlab.com/viewer/</a>) an sie weiterleiten. Dort k&ouml;nnen sie mehr &uuml;ber den Viewer erfahren und die kostenfreie EXE-Datei herunterladen.</p>
<h2><a name="Topics_for_Further_Reading"></a><span class="mw-headline">Weiterf&uuml;hrende Themen</span></h2>
<ul><li> <a class="external text" href="../../UserGuide/UserGuide/The_User_Files_Folder.html">Der Anwenderdateiordner</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Attaching_Files_to_the_Origin_Project.html">Dateien an das Origin-Projekt anh&auml;ngen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Package_Manager.html">Packdateien verwalten</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Set_Group_Folder_Location_Dialog.html">Gruppenordner einrichten</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Exporting_Button_Group.html">Benutzerdefinierte Schaltfl&auml;chengruppen exportieren</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Exporting_Toolbar_Settings.html">Symbolleisteneinstellungen exportieren</a></li>
<li> <a href="../../GettingStarted/OriginLab/Apps.html" title="OriginLab:Apps">Apps f&uuml;r Origin</a></li></ul>



    